//m.ionov@a-prof.ru 25.03.2014
//Добавил СуммаРегл, СуммаНУ, СуммаВР, СуммаПР - для корректировки реализаций
//- если нет движений по партиям (по документу основания) и нет средней себестоимости - то сумма будет браться из этих реквизитов.
//----m.ionov@a-prof.ru---
 
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения(ОтражатьВНалоговомУчетеУСН=Ложь) Экспорт

	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");

	Если ОтражатьВНалоговомУчетеУСН Тогда
		Для Каждого ТекущаяСтрока Из мТаблицаДвижений Цикл
			ТекущаяСтрока.СчетУчетаНУ = ТекущаяСтрока.СчетУчетаБУ;
			ТекущаяСтрока.КорСчетНУ = ТекущаяСтрока.КорСчетБУ;
		КонецЦикла;
	КонецЕсли;	
	
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

КонецПроцедуры // ВыполнитьДвижения()
