

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	СтруктураОбязательныхПолей = Новый Структура("Организация,Событие");
	Заголовок = "";
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
	ВидыСобытий = ПолучитьСписокЗначенийВидыСобытий();
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.Событие.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(Событие.ВидСобытияОС,
							  ВидыСобытий,
							  ПредставлениеРеквизита,Отказ);
							  
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
	
		// регистр СобытиеОС
	Движения.СобытияОСОрганизаций.Записывать = Истина;
	Для Каждого ТекСтрокаОС Из ОС Цикл
		Движение = Движения.СобытияОСОрганизаций.Добавить();
		Движение.Период 	 		= Дата;
		//начало изменений БП 10
		Движение.Организация 		= Организация;
		//конец изменений БП 10
		Движение.ОсновноеСредство 	= ТекСтрокаОС.ОС;
		Движение.Событие 			= Событие;
		Движение.НазваниеДокумента  = "Списание ОС по 012 счету";
		Движение.НомерДокумента		= Номер;
	КонецЦикла;
	
	//начало изменений БП 10
	СостоянияОС = Движения.СостоянияОСОрганизаций;
	для каждого стр из ОС цикл
		Движение = СостоянияОС.Добавить();
		Движение.Период			  = Дата;
		Движение.ОсновноеСредство = стр.ОС;
		Движение.Организация 	  = Организация;
		Движение.Состояние	 	  = Перечисления.СостоянияОС.СнятоСУчета;
		Движение.ДатаСостояния    = Дата;
	Конеццикла;	
	
	//начало изменений БП 10

	// регистр Хозрасчетный 
	
	Запрос = Новый Запрос;
	//начало изменений БП 10
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ХозрасчетныйОстатки.Счет,
	//	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//	|	ХозрасчетныйОстатки.Субконто2 КАК ОС,
	//	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&дата, счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеОсновныеСредства), , Субконто2 В (&ОС)) КАК ХозрасчетныйОстатки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйОстатки.Счет,
	//	|	ХозрасчетныйОстатки.Субконто2,
	//	|	ХозрасчетныйОстатки.Субконто1";
	
	Запрос .Текст = "ВЫБРАТЬ
	                |	ХозрасчетныйОстатки.Счет,
	                |	ХозрасчетныйОстатки.Субконто1 КАК ОССубконто,
	                |	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0)) КАК Сумма,
	                |	ВозвратОСПоСчету012.ОС КАК ОС
	                |ИЗ
	                |	Документ.ВозвратОСПоСчету012.ОС КАК ВозвратОСПоСчету012
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	                |				&дата,
	                |				счет = &Счет,
	                |				&МассивСубконто,
	                |				организация = &Организация
	                |					И Субконто1 В
	                |						(ВЫБРАТЬ
	                |							ВозвратОС.ОС
	                |						ИЗ
	                |							Документ.ВозвратОСПоСчету012.ОС КАК ВозвратОС
	                |						ГДЕ
	                |							ВозвратОС.Ссылка = &Ссылка)) КАК ХозрасчетныйОстатки
	                |		ПО ВозвратОСПоСчету012.ОС = ХозрасчетныйОстатки.Субконто1
	                |ГДЕ
	                |	ВозвратОСПоСчету012.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ХозрасчетныйОстатки.Счет,
	                |	ХозрасчетныйОстатки.Субконто1,
	                |	ВозвратОСПоСчету012.ОС";

	Запрос.УстановитьПараметр("дата", МоментВремени());
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("012"));
	Запрос.УстановитьПараметр("Организация",Организация);
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//конец изменений БП 10
	

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    ПроводкиБУ=Движения.Хозрасчетный;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//начало изменений БП 10 
		//Если ВыборкаДетальныеЗаписи.сумма=0 тогда Продолжить;КонецЕсли;
		//конец изменений БП 10
		Проводка   = ПроводкиБУ.Добавить();
		
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание  = "ОС по счету 012";
		Проводка.сумма       = ВыборкаДетальныеЗаписи.сумма;
		Проводка.СчетКт 	 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("012");
		
		//начало изменений БП 10
		Если ВыборкаДетальныеЗаписи.сумма =0 тогда
			// пока не жестко
			ОбщегоНазначения.СообщитьОбОшибке("Не определена сумма для основного средства "+ВыборкаДетальныеЗаписи.ОС);
		КонецЕсли;	
		//конец изменений БП 10
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства"		,ВыборкаДетальныеЗаписи.ОС);
		//////МестонахождениеОСБухгалтерскийУчет		
	КонецЦикла;
	//начало изменений БП 10 
// 	ПроводкиБУ.Записать(Истина);
	//конец изменений БП 10 
КонецПроцедуры

Функция ПолучитьСписокЗначенийВидыСобытий() Экспорт
	
	ВидыСобытий = Новый СписокЗначений;
	ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.Списание);
	
	Возврат ВидыСобытий;
	
КонецФункции