
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Для каждого СтрокаПроверки Из Продукция Цикл
			Если Не ЗначениеЗаполнено(СтрокаПроверки.Проект) И Не ЗначениеЗаполнено(СтрокаПроверки.Брендообъем) И Не ЗначениеЗаполнено(СтрокаПроверки.ТоварнаяКатегория)
				И СтрокаПроверки.СрокГодностиДо = 0  И СтрокаПроверки.СрокГодностиОт = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Данные продукции содержат пустые строки", Отказ);	
			КонецЕсли;		
			
			Если Не СтрокаПроверки.СрокГодностиДо = 0 и СтрокаПроверки.СрокГодностиДо < СтрокаПроверки.СрокГодностиОт Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не верно указаны сроки годности", Отказ);	
			КонецЕсли;		
		КонецЦикла; 
	КонецЕсли;	

КонецПроцедуры

Функция ЕстьСсылкиНаФормуДоговора() Экспорт
	
	Если ЭтоГруппа ИЛИ ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;

	ЕстьСсылки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.НСИ_ФормаДоговора = &Ссылка
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
		
	Пока Результат.Следующий() Цикл
		ЕстьСсылки = Истина;
		ОбщегоНазначения.Сообщение("Данная форма договора уже используется в договоре контрагента " + СокрЛП(Результат.Договор) + " у контрагента " + СокрЛП(Результат.Контрагент));			   
	КонецЦикла;
	
	Возврат ЕстьСсылки;
КонецФункции


