//m.ionov@a-prof.ru 04.09.2014
//Сделали иерархическим справочник
//----m.ionov@a-prof.ru---

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)

	//m.ionov@a-prof.ru 14.10.2014
	//Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(БазовыйТипЦен) Тогда
	//	// Если цена расчетная и введена на основании расчетной- это неправильно - записывать нельзя
	//	Если БазовыйТипЦен.Рассчитывается Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Базовый тип цен не может быть динамическим!", Отказ);
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;

	//Если НЕ ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
	//	Если Рассчитывается Тогда
	//		// Если цена расчетная и на основании её введена уже расчетная - это неправильно - записывать нельзя
	//		Запрос = Новый Запрос;
	//		Запрос.УстановитьПараметр("ТекущийТипЦен", ЭтотОбъект.Ссылка);

	//		Запрос.Текст =
	//		"ВЫБРАТЬ
	//		|	ТипЦен.Рассчитывается КАК Рассчитывается,
	//		|	ТипЦен.БазовыйТипЦен КАК БазовыйТипЦен
	//		|ИЗ
	//		|	Справочник.ТипыЦенНоменклатуры КАК ТипЦен
	//		|
	//		|ГДЕ
	//		|	ТипЦен.БазовыйТипЦен = &ТекущийТипЦен
	//		| И ТипЦен.Рассчитывается = Истина";

	//		ВыборкаЦен = Запрос.Выполнить().Выбрать();
	//		Если ВыборкаЦен.Следующий() Тогда
	//			ОбщегоНазначения.СообщитьОбОшибке("Этот тип цен уже используется как базовый, он уже не может быть динамическим!", Отказ);
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ОбменДанными.Загрузка ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Рассчитывается Тогда
		ТестБазовойЦены = ПЦ_Ценообразование.ВернутьБазовыйТипЦенКлиент(ЭтотОбъект);
		Если Не ЗначениеЗаполнено(ТестБазовойЦены) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не верно указан базовый тип цен", отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьСсылкиНаТипЦен() Тогда
		Если Ссылка.ПЦ_Категория <> ПЦ_Категория Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить категорию тип цен уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПЦ_Категория",, Отказ);
		КонецЕсли; 
		
		Если Ссылка.ПЦ_Проект <> ПЦ_Проект Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить проект ГП уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПЦ_Проект",, Отказ);
		КонецЕсли;
		
		Если Ссылка.СпособРасчетаЦены <> СпособРасчетаЦены Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить способ расчета цены уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СпособРасчетаЦены",, Отказ);
		КонецЕсли;
		
		Если Ссылка.ЦенаВключаетНДС <> ЦенаВключаетНДС Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить цены включают НДС уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ЦенаВключаетНДС",, Отказ);
		КонецЕсли;
		
		Если Ссылка.ВалютаЦены <> ВалютаЦены Тогда
			
			ТекстСообщения = НСтр("ru = 'Тип цен уже участвует в ценообразовании. 
                             |Изменить валюту цены уже нельзя!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВалютаЦены",, Отказ);
		КонецЕсли;

	КонецЕсли;
	//----m.ionov@a-prof.ru---

	Если НЕ ОбменДанными.Загрузка Тогда
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	КонецЕсли;
	
КонецПроцедуры

//m.ionov@a-prof.ru 14.10.2014
Функция ЕстьСсылкиНаТипЦен() Экспорт
	
	ЕстьСсылки = Ложь;
	
	Если Не ЭтоНовый() и Не ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЦеныНоменклатурыСрезПоследних.ТипЦен
		               |ИЗ
		               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреСрезПоследних.ПЦ_ТипЦен
		               |ИЗ
		               |	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(, ПЦ_ТипЦен = &ТипЦен) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреСрезПоследних";
					   
		Запрос.УстановитьПараметр("ТипЦен", Ссылка);
		
		ЕстьСсылки = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат ЕстьСсылки;
					   
КонецФункции
//----m.ionov@a-prof.ru---

