&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если ПроверитьЗаполнение() Тогда
		Модифицированность = Ложь;
		Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеЗаполнения);
	
	СписокКодовПоставки = КонтролируемыеСделкиПовтИсп.ПолучитьКодыУсловийПоставки();
	Элементы.КодУсловийПоставки.СписокВыбора.Очистить();
	Для Каждого Код Из СписокКодовПоставки Цикл
		НовыйКод = Элементы.КодУсловийПоставки.СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКод, Код);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Цена) Тогда
		Стоимость = Цена * Количество;
	ИначеЕсли ЗначениеЗаполнено(Стоимость) Тогда 
		Цена = ?(ЗначениеЗаполнено(Количество), Стоимость / Количество, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Количество) Тогда 
		Стоимость = Цена * Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Количество) Тогда 
		Цена = Стоимость / Количество;
	КонецЕсли;
КонецПроцедуры
