
Процедура ПередЗаписью(Отказ)
	
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	
	Если НЕ ЭтоГруппа И НЕ ОбменДанными.Загрузка Тогда
	
		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
		
		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(КоррСчет) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры без пробелов.",, СтрокаОшибки);
			Отказ = Истина;
		КонецЕсли; 
	
		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(Код) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В составе БИК банка должны быть только цифры без пробелов.",, СтрокаОшибки);
			Отказ = Истина;
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

