
&НаКлиенте
Процедура ДобавитьМетку(Команда)
	
	ПараметрыМетки = 
	"{hideIcon: " + Формат(hideIcon, "БЛ=false; БИ=true") + 
	", draggable: " + Формат(draggable, "БЛ=false; БИ=true") + 
	", style: """ + СтильМетки + """}";
	
	Если ВариантКоординат = "Координаты" Тогда
		
		Элементы.ТекстHTML.Документ.parentWindow.eval(
		"AddPlacemark(""" + ИмяМетки + """, """ + ОписаниеМетки + """, """ + ПодсказкаМетки + """, " + Формат(Широта, "ЧРД=.; ЧГ=0") + ", " + Формат(Долгота, "ЧРД=.; ЧГ=0") + "," + ПараметрыМетки + ")");
		
	Иначе
		
		Элементы.ТекстHTML.Документ.parentWindow.eval(
		"AddPlacemarkByAddress(""" + ИмяМетки + """, """ + ОписаниеМетки + """, """ + ПодсказкаМетки + """, """ + Адрес + """," + ПараметрыМетки + ")");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	ТекстHTML = Макет.ПолучитьТекст();
	
	ИмяМетки       = "Москва";
	ОписаниеМетки  = "Столица РФ";
	ПодсказкаМетки = "Метка";
	
	hideIcon = Истина;
	
	Широта  = 37.609218;
	Долгота = 55.753559;
	
	МаршрутНачалоПути    = "Москва, м. Арбатская";
	МаршрутОкончаниеПути = "Москва, м. Курская";
	
	ВариантКоординат     = "Координаты";
	
	Адрес = "Москва г, Ленинградский пр-т, д. 100";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМаршрут(Команда)
	
	Маршрут = Элементы.ТекстHTML.Документ.parentWindow.eval(
	"AddRoute(""" + МаршрутНачалоПути + """, """ + МаршрутОкончаниеПути + """)");
	
КонецПроцедуры
