
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	Движения.Международный.Очистить();
	Движения.Международный.Записывать = Истина;
	
	Для Каждого лСтрокаПоказателя Из Показатели Цикл
		
			Если лСтрокаПоказателя.ОНАЗаПериод > 0 Тогда 
				лПроводка = Движения.Международный.Добавить();
				лПроводка.Период = Дата;
				лПроводка.Организация = Организация;
				лПроводка.СчетДт = ПланыСчетов.Международный.ОтложенныеНалоговыеАктивы;
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетДт, лПроводка.СубконтоДт, 1, лСтрокаПоказателя.Показатель);
				лПроводка.СчетКт = СчетОтнесенияРасходовПоНалогу;
				лПроводка.Сумма = лСтрокаПоказателя.ОНАЗаПериод;
				лПроводка.Содержание = "Увеличение ОНА";
			ИначеЕсли лСтрокаПоказателя.ОНАЗаПериод < 0 Тогда 
				лПроводка = Движения.Международный.Добавить();
				лПроводка.Период = Дата;
				лПроводка.Организация = Организация;
				лПроводка.СчетДт = СчетОтнесенияРасходовПоНалогу;
				лПроводка.СчетКт = ПланыСчетов.Международный.ОтложенныеНалоговыеАктивы;
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетКт, лПроводка.СубконтоКт, 1, лСтрокаПоказателя.Показатель);
				лПроводка.Сумма = -лСтрокаПоказателя.ОНАЗаПериод;
				лПроводка.Содержание = "Уменьшение ОНА";
			КонецЕсли;
			Если лСтрокаПоказателя.ОНОЗаПериод < 0 Тогда 
				лПроводка = Движения.Международный.Добавить();
				лПроводка.Период = Дата;
				лПроводка.Организация = Организация;
				лПроводка.СчетДт = ПланыСчетов.Международный.ОтложенныеНалоговыеОбязательства;
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетДт, лПроводка.СубконтоДт, 1, лСтрокаПоказателя.Показатель);
				лПроводка.СчетКт = СчетОтнесенияРасходовПоНалогу;
				лПроводка.Сумма = -лСтрокаПоказателя.ОНОЗаПериод;
				лПроводка.Содержание = "Уменьшение ОНО";
			ИначеЕсли лСтрокаПоказателя.ОНОЗаПериод > 0 Тогда 
				лПроводка = Движения.Международный.Добавить();
				лПроводка.Период = Дата;
				лПроводка.Организация = Организация;
				лПроводка.СчетДт = СчетОтнесенияРасходовПоНалогу;
				лПроводка.СчетКт = ПланыСчетов.Международный.ОтложенныеНалоговыеОбязательства;
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетКт, лПроводка.СубконтоКт, 1, лСтрокаПоказателя.Показатель);
				лПроводка.Сумма = лСтрокаПоказателя.ОНОЗаПериод;
				лПроводка.Содержание = "Увеличение ОНО";
			КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
