
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДС_КорректировкиНачисленийПоЛизингу.Записывать = Истина;
	
	Если Не Корректировка Тогда
		СформироватьДвиженияРегламентные();	
	Иначе
		СформироватьДвиженияКорректировки();
	КонецЕсли;		
	
КонецПроцедуры     

Процедура СформироватьДвиженияРегламентные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ДС_ГрафикПлатежей.ПериодПлатежа) КАК ПериодПлатежа,
	|	ДС_ГрафикПлатежей.Договор,
	|	МАКСИМУМ(ДС_ГрафикПлатежей.ДатаПлатежа) КАК ДатаПлатежа
	|ПОМЕСТИТЬ МаксПериод
	|ИЗ
	|	РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
	|ГДЕ
	|	ДС_ГрафикПлатежей.ДатаПлатежа <= &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_ГрафикПлатежей.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПервых.ПервоначальнаяСтоимость, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК FALeasedGBVEq,
	|	СУММА(ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ВидВзаиморасчетов = &Машины
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПервых.ПервоначальнаяСтоимость, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК FALeasedGBVVeh,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПервых(&ДатаОкончания, ) КАК ОсновныеСредстваМеждународныйУчетСрезПервых
	|		ПО ДоговорыКонтрагентов.ДС_ОбъектДоговора = ОсновныеСредстваМеждународныйУчетСрезПервых.ОсновноеСредство
	|ГДЕ
	|	НЕ ОсновныеСредстваМеждународныйУчетСрезПервых.ОсновноеСредство ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК FALeasedADEq,
	|	СУММА(ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ВидВзаиморасчетов = &Машины
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК FALeasedADVeh,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ПО ДоговорыКонтрагентов.ДС_ОбъектДоговора = ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	НЕ ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СчетЗатрат.Код = ""26""
	|					И НЕ ДоговорыКонтрагентов.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СуммаНачисленнойАмортизации, 0) - ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода.СуммаНачисленнойАмортизации, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSDepreciation26,
	|	СУММА(ВЫБОР
	|			КОГДА (ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СчетЗатрат.Код = ""44""
	|					ИЛИ ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СчетЗатрат.Код = ""44.01""
	|					ИЛИ ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СчетЗатрат.Код = ""44.02"")
	|					И НЕ ДоговорыКонтрагентов.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СуммаНачисленнойАмортизации, 0) - ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода.СуммаНачисленнойАмортизации, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSDepreciation44,
	|	СУММА(ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.СуммаНачисленнойАмортизации, 0) - ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода.СуммаНачисленнойАмортизации, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSDepreciation,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода
	|			ПО ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.ОсновноеСредство = ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода.ОсновноеСредство
	|				И ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.Организация = ОсновныеСредстваМеждународныйУчетСрезПоследнихНаНачалоГода.Организация
	|		ПО ДоговорыКонтрагентов.ДС_ОбъектДоговора = ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.ОсновноеСредство
	|ГДЕ
	|	НЕ ОсновныеСредстваМеждународныйУчетСрезПоследнихНаДатуОкончания.ОсновноеСредство ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат.Код = ""26""
	|					И НЕ ДС_ФактическиеПлатежи.Договор.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ВЫБОР
	|						КОГДА ДС_ФактическиеПлатежи.Договор.ДС_РаспределятьАванс
	|							ТОГДА ДС_ФактическиеПлатежи.LeasePaymentActualRaspred * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|						ИНАЧЕ ДС_ФактическиеПлатежи.LeasePaymentActual * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSLeasePayments26,
	|	СУММА(ВЫБОР
	|			КОГДА (ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат.Код = ""44""
	|					ИЛИ ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат.Код = ""44.01""
	|					ИЛИ ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат.Код = ""44.02"")
	|					И НЕ ДС_ФактическиеПлатежи.Договор.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ВЫБОР
	|						КОГДА ДС_ФактическиеПлатежи.Договор.ДС_РаспределятьАванс
	|							ТОГДА ДС_ФактическиеПлатежи.LeasePaymentActualRaspred * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|						ИНАЧЕ ДС_ФактическиеПлатежи.LeasePaymentActual * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSLeasePayments44,
	|	СУММА(ВЫБОР
	|			КОГДА ДС_ФактическиеПлатежи.Договор.ВидВзаиморасчетов = &Оборудование
	|				ТОГДА ВЫБОР
	|						КОГДА ДС_ФактическиеПлатежи.Договор.ДС_РаспределятьАванс
	|							ТОГДА ДС_ФактическиеПлатежи.LeasePaymentActualRaspred * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|						ИНАЧЕ ДС_ФактическиеПлатежи.LeasePaymentActual * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК COSLeasePayments,
	|	ДС_ФактическиеПлатежи.Договор
	|ИЗ
	|	РегистрСведений.ДС_ФактическиеПлатежи КАК ДС_ФактическиеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДС_ФактическиеПлатежи.Договор.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|			И (НАЧАЛОПЕРИОДА(ДС_ФактическиеПлатежи.ДатаПлатежа, ДЕНЬ) = НАЧАЛОПЕРИОДА(КурсыВалют.Период, ДЕНЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ПО ДС_ФактическиеПлатежи.Договор.ДС_ОбъектДоговора = ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	ДС_ФактическиеПлатежи.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД) И &ДатаОкончания
	|	И ДС_ФактическиеПлатежи.Регистратор ССЫЛКА Документ.ДС_РасчетФактическогоПлатежаМСФО
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_ФактическиеПлатежи.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДС_ГрафикПлатежей.FinanceCost * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)) КАК OtherIEFinanceCost,
	|	ДС_ГрафикПлатежей.Договор
	|ИЗ
	|	РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДС_ГрафикПлатежей.Договор.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|			И (НАЧАЛОПЕРИОДА(ДС_ГрафикПлатежей.ДатаПлатежа, ДЕНЬ) = НАЧАЛОПЕРИОДА(КурсыВалют.Период, ДЕНЬ))
	|ГДЕ
	|	ДС_ГрафикПлатежей.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД) И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_ГрафикПлатежей.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДС_КурсовыеРазницы.ForexGain > 0
	|				ТОГДА ДС_КурсовыеРазницы.ForexGain
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК OtherIEForexDt,
	|	СУММА(ВЫБОР
	|			КОГДА ДС_КурсовыеРазницы.ForexGain <= 0
	|				ТОГДА ДС_КурсовыеРазницы.ForexGain
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК OtherIEForexCt,
	|	ДС_КурсовыеРазницы.Договор
	|ИЗ
	|	РегистрСведений.ДС_КурсовыеРазницы КАК ДС_КурсовыеРазницы
	|ГДЕ
	|	ДС_КурсовыеРазницы.ПериодПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД) И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_КурсовыеРазницы.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДС_КурсовыеРазницы.ContingentRentRUB > 0
	|				ТОГДА ДС_КурсовыеРазницы.ContingentRentRUB
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ContingentRentDt,
	|	СУММА(ВЫБОР
	|			КОГДА ДС_КурсовыеРазницы.ContingentRentRUB <= 0
	|				ТОГДА ДС_КурсовыеРазницы.ContingentRentRUB
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ContingentRentCt,
	|	ДС_КурсовыеРазницы.Договор
	|ИЗ
	|	РегистрСведений.ДС_КурсовыеРазницы КАК ДС_КурсовыеРазницы
	|ГДЕ
	|	ДС_КурсовыеРазницы.ПериодПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД) И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_КурсовыеРазницы.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДС_РеклассификацияЗадолжностиЗадолжности.КраткосрочнаяЗадолжностьРуб) КАК FinanceLeasePayableST,
	|	ДС_РеклассификацияЗадолжностиЗадолжности.Договор
	|ИЗ
	|	Документ.ДС_РеклассификацияЗадолжности.Задолжности КАК ДС_РеклассификацияЗадолжностиЗадолжности
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДС_РеклассификацияЗадолжностиЗадолжности.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_РеклассификацияЗадолжностиЗадолжности.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДС_РеклассификацияЗадолжностиЗадолжности.ДолгосрочнаяЗадолжностьРуб) КАК FinanceLeasePayableLT,
	|	ДС_РеклассификацияЗадолжностиЗадолжности.Договор
	|ИЗ
	|	Документ.ДС_РеклассификацияЗадолжности.Задолжности КАК ДС_РеклассификацияЗадолжностиЗадолжности
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДС_РеклассификацияЗадолжностиЗадолжности.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_РеклассификацияЗадолжностиЗадолжности.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации, 0)) КАК REDepreciation,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД), Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ПО ДоговорыКонтрагентов.ДС_ОбъектДоговора = ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	НЕ ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДС_ФактическиеПлатежи.Договор.ДС_РаспределятьАванс
	|				ТОГДА ДС_ФактическиеПлатежи.LeasePaymentActualRaspred * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|			ИНАЧЕ ДС_ФактическиеПлатежи.LeasePaymentActual * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК RELeasePayments,
	|	ДС_ФактическиеПлатежи.Договор
	|ИЗ
	|	РегистрСведений.ДС_ФактическиеПлатежи КАК ДС_ФактическиеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (НАЧАЛОПЕРИОДА(ДС_ФактическиеПлатежи.ДатаПлатежа, ДЕНЬ) = НАЧАЛОПЕРИОДА(КурсыВалют.Период, ДЕНЬ))
	|			И ДС_ФактическиеПлатежи.Договор.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|ГДЕ
	|	ДС_ФактическиеПлатежи.ДатаПлатежа < НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД)
	|	И ДС_ФактическиеПлатежи.Регистратор ССЫЛКА Документ.ДС_РасчетФактическогоПлатежаМСФО
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_ФактическиеПлатежи.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДС_КурсовыеРазницы.ForexGain + ДС_КурсовыеРазницы.FinanceCostRUB + ДС_КурсовыеРазницы.ContingentRentRUB) КАК REFinanceCosts,
	|	ДС_КурсовыеРазницы.Договор
	|ИЗ
	|	РегистрСведений.ДС_КурсовыеРазницы КАК ДС_КурсовыеРазницы
	|ГДЕ
	|	ДС_КурсовыеРазницы.ПериодПлатежа < НАЧАЛОПЕРИОДА(&ДатаОкончания, ГОД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДС_КурсовыеРазницы.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ДС_ГрафикПлатежей.СуммаПлатежаБезНДС - ДС_ГрафикПлатежей.СуммаПлатежаБезНДС * МаксПериод.ПериодПлатежа / МаксПериод.Договор.ДС_СрокДействияДоговора, 0) * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1)) КАК AdvancesForCapitalConstruction,
	|	МаксПериод.Договор
	|ИЗ
	|	МаксПериод КАК МаксПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
	|		ПО МаксПериод.Договор = ДС_ГрафикПлатежей.Договор
	|			И (ДС_ГрафикПлатежей.ВидПлатежа = &ВидПлатежаПредоплата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО МаксПериод.Договор.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|			И (НАЧАЛОПЕРИОДА(МаксПериод.ДатаПлатежа, ДЕНЬ) = НАЧАЛОПЕРИОДА(КурсыВалют.Период, ДЕНЬ))
	|ГДЕ
	|	МаксПериод.Договор.ДС_РаспределятьАванс
	|	И МаксПериод.Договор.ВидВзаиморасчетов = &Оборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксПериод.Договор";
	
	Запрос.УстановитьПараметр("ВидПлатежаПредоплата", Перечисления.ДС_ВидыПлатежейМСФО.Предоплата);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	//{27.06.2016 Островерхий заявка №б/н 
	//Запрос.УстановитьПараметр("Организация", Справочники.Организации.НайтиПоНаименованию("ПРОГРЕСС")); 
	Запрос.УстановитьПараметр("Организация", ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Справочники.ПРГ_Служебный.ОрганизацияПоУмолчанию,"Объект"));
	//27.06.2016 Островерхий} 
	Запрос.УстановитьПараметр("Оборудование", Справочники.ВидыВзаиморасчетов.ЛизингОборудования);
	Запрос.УстановитьПараметр("Машины", Справочники.ВидыВзаиморасчетов.ЛизингМашин);
	
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка1 = МассивРезультатовЗапроса[1].Выбрать();
	Пока Выборка1.Следующий()Цикл
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка1.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FALeasedGBVMachinery;
		Движение.Сумма = Выборка1.FALeasedGBVEq;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка1.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FALeasedGBVVehicles;
		Движение.Сумма = Выборка1.FALeasedGBVVeh;
		Движение.Период = НачалоМесяца(Дата);
	КонецЦикла;	
	
	Выборка2 = МассивРезультатовЗапроса[2].Выбрать();
	Пока Выборка2.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка2.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FALeasedADMachinery;
		Движение.Сумма = -Выборка2.FALeasedADEq;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка2.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FALeasedADVehicles;
		Движение.Сумма = -Выборка2.FALeasedADVeh;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	Выборка3 = МассивРезультатовЗапроса[3].Выбрать();
	Пока Выборка3.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка3.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.COSDepreciation;
		Движение.Сумма = Выборка3.COSDepreciation;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка3.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.AdministrativeDepreciation;
		Движение.Сумма = Выборка3.COSDepreciation26;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка3.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.SellingDepreciation;
		Движение.Сумма = Выборка3.COSDepreciation44;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	Выборка4 = МассивРезультатовЗапроса[4].Выбрать();
	Пока Выборка4.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка4.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.COSLeasePayments;
		Движение.Сумма = -Выборка4.COSLeasePayments;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка4.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.AdministrativeLeasePayments;
		Движение.Сумма = -Выборка4.COSLeasePayments26;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка4.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.SellingLeasePayments;
		Движение.Сумма = -Выборка4.COSLeasePayments44;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;
	
	
	Выборка5 = МассивРезультатовЗапроса[5].Выбрать();
	Пока Выборка5.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка5.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.OtherIEFinanceCost;
		Движение.Сумма = Выборка5.OtherIEFinanceCost;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка6 = МассивРезультатовЗапроса[6].Выбрать();
	Пока Выборка6.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка6.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.OtherIEForexGainDt;
		Движение.Сумма = Выборка6.OtherIEForexDt;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка6.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.OtherIEForexGainCt;
		Движение.Сумма = Выборка6.OtherIEForexCt;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;
	
	Выборка7 = МассивРезультатовЗапроса[7].Выбрать();
	Пока Выборка7.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка7.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.ContingentRentDt;
		Движение.Сумма = Выборка7.ContingentRentDt;
		Движение.Период = НачалоМесяца(Дата);
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка7.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.ContingentRentCt;
		Движение.Сумма = Выборка7.ContingentRentCt;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка8 = МассивРезультатовЗапроса[8].Выбрать();
	Пока Выборка8.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка8.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FinanceLeasePayableSt;
		Движение.Сумма = -Выборка8.FinanceLeasePayableST;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка9 = МассивРезультатовЗапроса[9].Выбрать();
	Пока Выборка9.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка9.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.FinanceLeasePayableLt;
		Движение.Сумма = -Выборка9.FinanceLeasePayableLT;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка10 = МассивРезультатовЗапроса[10].Выбрать();
	Пока Выборка10.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка10.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.REDepreciation;
		Движение.Сумма = Выборка10.REDepreciation;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка11 = МассивРезультатовЗапроса[11].Выбрать();
	Пока Выборка11.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка11.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.RELeasePayments;
		Движение.Сумма = -Выборка11.RELeasePayments;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка12 = МассивРезультатовЗапроса[12].Выбрать();
	Пока Выборка12.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка12.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.REFinanceCost;
		Движение.Сумма = Выборка12.REFinanceCosts;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;	
	
	
	Выборка13 = МассивРезультатовЗапроса[13].Выбрать();
	Пока Выборка13.Следующий()Цикл
		
		Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
		Движение.Договор = Выборка13.Договор;
		Движение.Показатель = Перечисления.ДС_ПоказателиОтчетаLeasingSummary.AdvancesForCapitalConstruction;
		Движение.Сумма = -Выборка13.AdvancesForCapitalConstruction;
		Движение.Период = НачалоМесяца(Дата);
		
	КонецЦикла;
	
	//Выгружаем движения в ТЗ, очищаем набор записей, если были корректировки в прошлом месяце
	ТЗ = Движения.ДС_КорректировкиНачисленийПоЛизингу.Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Договор,
	|	НаборЗаписей.Показатель,
	|	НаборЗаписей.Сумма
	|ПОМЕСТИТЬ ДвиженияБезКорректировки
	|ИЗ
	|	&ТЗ КАК НаборЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияБезКорректировки.Договор,
	|	ДвиженияБезКорректировки.Показатель,
	|	ДвиженияБезКорректировки.Сумма + ЕСТЬNULL(ДС_КорректировкиНачисленийПоЛизингу.Сумма, 0) КАК Сумма,
	|	&Период
	|ИЗ
	|	ДвиженияБезКорректировки КАК ДвиженияБезКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДС_КорректировкиНачисленийПоЛизингу КАК ДС_КорректировкиНачисленийПоЛизингу
	|		ПО ДвиженияБезКорректировки.Договор = ДС_КорректировкиНачисленийПоЛизингу.Договор
	|			И ДвиженияБезКорректировки.Показатель = ДС_КорректировкиНачисленийПоЛизингу.Показатель
	|			И (ДС_КорректировкиНачисленийПоЛизингу.Корректировка)
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ДС_КорректировкиНачисленийПоЛизингу.Период, МЕСЯЦ) = &КонецПрошлогоМесяца";
	
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца", НачалоМесяца(Дата)-1);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	ТаблицаСКорректировками = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаСКорректировками.Количество() > 0 Тогда
		Движения.ДС_КорректировкиНачисленийПоЛизингу.Загрузить(ТаблицаСКорректировками);
	КонецЕсли;
	
КонецПроцедуры	

Процедура СформироватьДвиженияКорректировки()
	
	Для Каждого Строка Из Корректировки Цикл
		
		Если Не Строка.СуммаКорректировка = 0 Тогда
			Движение = Движения.ДС_КорректировкиНачисленийПоЛизингу.Добавить();
			Движение.Период = Дата;
			Движение.Показатель = Строка.Показатель;
			Движение.Сумма = Строка.СуммаКорректировка;
			Движение.Договор = Договор;
			Движение.Корректировка = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	