Функция ПолучитьСсылкиНаПлан(Рейс = Неопределено) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПТЛ_ПланДоставкиЗаданияНаПеревозку.ЗаданиеНаПеревозку.ЗаданиеНаПодбор
	               |ПОМЕСТИТЬ ТабЗадания
	               |ИЗ
	               |	Документ.ПТЛ_ПланДоставки.ЗаданияНаПеревозку КАК ПТЛ_ПланДоставкиЗаданияНаПеревозку
	               |ГДЕ
	               |	ПТЛ_ПланДоставкиЗаданияНаПеревозку.Ссылка = &Ссылка
				   //{07.08.2015 Островерхий заявка №б/н 
				   |	И НЕ ПТЛ_ПланДоставкиЗаданияНаПеревозку.ЗаданиеНаПеревозку.ЗаданиеНаПодбор = ЗНАЧЕНИЕ(Документ.СП_ЗаданиеНаПодбор.ПустаяСсылка)" 
				   //07.08.2015 Островерхий}  
				   + ?(Рейс = Неопределено,"","
	               |	И ПТЛ_ПланДоставкиЗаданияНаПеревозку.КлючСтроки = &КлючСтроки") + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ЗаданиеНаПодбор,
	               |	ВложенныйЗапрос.Журнал + ВложенныйЗапрос.РеализацияТоваровУслуг + ВложенныйЗапрос.ТребованиеНакладная + ВложенныйЗапрос.ПеремещениеТоваров КАК ЕстьСсылки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТабЗадания.ЗаданиеНаПеревозкуЗаданиеНаПодбор КАК ЗаданиеНаПодбор,
	               |		ВЫБОР
	               |			КОГДА ПТЛ_ЖурналУчетаВъездаВыездаАМЗаданияНаПодбор.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ КАК Журнал,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ КАК РеализацияТоваровУслуг,
	               |		ВЫБОР
	               |			КОГДА ТребованиеНакладная.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ КАК ТребованиеНакладная,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ КАК ПеремещениеТоваров
	               |	ИЗ
	               |		ТабЗадания КАК ТабЗадания
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПТЛ_ЖурналУчетаВъездаВыездаАМ.ЗаданияНаПодбор КАК ПТЛ_ЖурналУчетаВъездаВыездаАМЗаданияНаПодбор
	               |			ПО ТабЗадания.ЗаданиеНаПеревозкуЗаданиеНаПодбор.Ссылка = ПТЛ_ЖурналУчетаВъездаВыездаАМЗаданияНаПодбор.ЗаданиеНаПодбор.Ссылка
	               |				И (НЕ ПТЛ_ЖурналУчетаВъездаВыездаАМЗаданияНаПодбор.Ссылка.ПометкаУдаления)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |			ПО ТабЗадания.ЗаданиеНаПеревозкуЗаданиеНаПодбор = РеализацияТоваровУслуг.СП_ЗаданиеНаПодбор
	               |				И (РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная КАК ТребованиеНакладная
	               |			ПО ТабЗадания.ЗаданиеНаПеревозкуЗаданиеНаПодбор = ТребованиеНакладная.СП_ЗаданиеНаПодбор
	               |				И (ТребованиеНакладная.ПометкаУдаления = ЛОЖЬ)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |			ПО ТабЗадания.ЗаданиеНаПеревозкуЗаданиеНаПодбор = ПеремещениеТоваров.СП_ЗаданиеНаПодбор
	               |				И (ПеремещениеТоваров.ПометкаУдаления = ЛОЖЬ)) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТабЗадания";
				   
	Запрос.УстановитьПараметр("Ссылка", ПланДоставки);
	Запрос.УстановитьПараметр("КлючСтроки", Рейс);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Итог("ЕстьСсылки") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
