
Процедура СобратьДанныеДляПечати(Ссылка, ДанныеДляПечати, УчетнаяПолитика) Экспорт
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Корректировочный = Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
	
	Если Ссылка.СформированПриВводеНачальныхОстатковНДС Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрДокОснования Из Ссылка.ДокументыОснования Цикл
		// Получить экземпляр документа на печать
		
		Если НЕ ЗначениеЗаполнено(СтрДокОснования.ДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭкземплярДанныхДляПечати = Неопределено;
		ТипОснования = ТипЗнч(СтрДокОснования.ДокументОснование);

		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
			ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеСФнаАвансиСуммовуюРазницу(Ссылка);
		ИначеЕсли Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеСФНалоговогоАгента(Ссылка);
		ИначеЕсли ТипОснования      = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоОтчетКомитентуОПродажах(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоРеализацияТоваровУслуг(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоВозвратуТоваровПоставщику(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоВозвратуТоваровПоставщикуИзНТТ(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоРеализацияУслугПоПереработке(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоОтчетКомиссионераОПродажах(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоАкту(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПередачаОС") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоПередачеОС(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоПринятиеКУчетуОС(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.МодернизацияОС") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоМодернизацияОС(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеНДСпоСМРхозспособом") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоНачислениеНДСпоСМРхозспособом(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПередачаНМА") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоПередачеНМАОрганизаций(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоОтражениюРеализацииТоваровИУслуг(СтрДокОснования.ДокументОснование, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") 
			И ТипЗнч(СтрДокОснования.ДокументОснование.ДокументОтгрузки) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоРеализацияТоваровУслуг(СтрДокОснования.ДокументОснование.ДокументОтгрузки, Ссылка);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") 
			И ТипЗнч(СтрДокОснования.ДокументОснование.ДокументОтгрузки) = Тип("ДокументСсылка.ПередачаОС") Тогда
			ЭкземплярДанныхДляПечати = СобратьДанныеПоПередачеОС(СтрДокОснования.ДокументОснование.ДокументОтгрузки, Ссылка);
		//начало изменений
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
			ЭкземплярДанныхДляПечати = 	СобратьДанныеПоТребованиюНакладной(СтрДокОснования.ДокументОснование, Ссылка);
		//конец изменений 
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Если Корректировочный Тогда
				ЭкземплярДанныхДляПечати = СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(СтрДокОснования.ДокументОснование, Ссылка);
			Иначе
				ЭкземплярДанныхДляПечати = СобратьДанныеДляПечатиИсправленияСчетаФактуры(СтрДокОснования.ДокументОснование, Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭкземплярДанныхДляПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.Руководитель) И ЭкземплярДанныхДляПечати.Свойство("ФИОРуководителя") Тогда 
			ЭкземплярДанныхДляПечати.ФИОРуководителя = ОбщегоНазначения.ФамилияИнициалыФизЛица(Ссылка.Руководитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ГлавныйБухгалтер) И ЭкземплярДанныхДляПечати.Свойство("ФИОГлавногоБухгалтера") Тогда
			ЭкземплярДанныхДляПечати.ФИОГлавногоБухгалтера = ОбщегоНазначения.ФамилияИнициалыФизЛица(Ссылка.ГлавныйБухгалтер);
		КонецЕсли;
			
		// Пересчет из уе в рубли
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию
			И Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах 
			И Не ЭкземплярДанныхДляПечати.Валюта = мВалютаРегламентированногоУчета Тогда
			
			ВерсияПостановления = УчетНДС.ПолучитьВерсиюПостановления(Ссылка.Дата);
			Если ВерсияПостановления = 2 Тогда
				ФормироватьСчетФактуруПоУЕвРублях = Истина;
			Иначе
				Если УчетнаяПолитика = Неопределено тогда
					УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(Ссылка.Ссылка.Дата, Ссылка.Организация);
				КонецЕсли;
				ФормироватьСчетФактуруПоУЕвРублях = ЗначениеЗаполнено(УчетнаяПолитика) 
					И УчетнаяПолитика.Свойство("ФормироватьСчетФактуруПоУЕвРублях")
					И УчетнаяПолитика.ФормироватьСчетФактуруПоУЕвРублях;
			КонецЕсли;

			Если ФормироватьСчетФактуруПоУЕвРублях Тогда
				ПерезаполнитьСуммыПоУЕвРублях(ЭкземплярДанныхДляПечати, СтрДокОснования.ДокументОснование, Ссылка);
				ЭкземплярДанныхДляПечати.Валюта = мВалютаРегламентированногоУчета;
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполнение данных для печати
		Если ДанныеДляПечати = Неопределено Тогда
			ДанныеДляПечати = ЭкземплярДанныхДляПечати;
		Иначе
			
			Для каждого СтрДанных Из ЭкземплярДанныхДляПечати Цикл
				
				Если СтрДанных.Ключ = "ТабличнаяЧасть" Тогда
					СтараяТабЧасть = ДанныеДляПечати.ТабличнаяЧасть;
					НоваяТабЧасть  = СтрДанных.Значение;
					
					Для каждого НоваяСтрокаТабЧасти Из НоваяТабЧасть Цикл
						СтрокаТабЧасти = СтараяТабЧасть.Добавить();
						Для каждого ТекКол Из НоваяТабЧасть.Колонки Цикл
							Если СтараяТабЧасть.Колонки.Найти(ТекКол.Имя) <> Неопределено Тогда
								СтрокаТабЧасти[ТекКол.Имя] = НоваяСтрокаТабЧасти[ТекКол.Имя];
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
				ИначеЕсли НЕ ДанныеДляПечати.Свойство(СтрДанных.Ключ) Тогда
					// Если данный параметр для печати шапки документа еще не  определен - то определяем его
					ДанныеДляПечати.Вставить(СтрДанных.Ключ, СтрДанных.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	КонецЦикла;	
		
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Корректировочный Тогда
	
		ТаблицаДатОплат = Ссылка.ДатаНомерДокументовОплаты.Выгрузить();
		ТаблицаДатОплат.Свернуть("ДатаПлатежноРасчетногоДокумента, НомерПлатежноРасчетногоДокумента");
		СтрокиКУдалению = Новый Массив();
		Для Каждого СтрокаОплат Из ТаблицаДатОплат Цикл
			Если Не ЗначениеЗаполнено(СтрокаОплат.ДатаПлатежноРасчетногоДокумента) 
				И ПустаяСтрока(СтрокаОплат.НомерПлатежноРасчетногоДокумента) Тогда
				СтрокиКУдалению.Добавить(СтрокаОплат);
			КонецЕсли; 
		КонецЦикла; 
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ТаблицаДатОплат.Удалить(СтрокаКУдалению);
		КонецЦикла; 
		
		ДанныеДляПечати.Вставить("ТаблицаДатОплат", ТаблицаДатОплат);
		
	КонецЕсли;
	
	Если Корректировочный И ДанныеДляПечати <> Неопределено Тогда
		
		КолонкиГруппировок = ""
		+"Номенклатура,"
		+"НаименованиеТовара,"
		+"Серия,"
		+"Характеристика,"
		+"НаименованиеЕдиницыИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЦенаДоИзменения,"	
		+"ЦенаПослеИзменения,"
		+"СтавкаНДС";
		
		КолонкиСуммирования = ""
		+"СуммаНДСДоИзменения,"
		+"СуммаНДСПослеИзменения,"
		+"СтоимостьСНДСДоИзменения,"
		+"СтоимостьСНДСПослеИзменения,"
		+"РазницаБезНДСУвеличение,"
		+"РазницаБезНДСУменьшение,"
		+"РазницаНДСУвеличение,"
		+"РазницаНДСУменьшение,"
		+"РазницаСНДСУвеличение,"
		+"РазницаСНДСУменьшение,"
		+"СтоимостьБезНДСДоИзменения,"
		+"СтоимостьБезНДСПослеИзменения,"
		+"КоличествоДоИзменения,"
		+"КоличествоПослеИзменения";
		
		ДанныеДляПечати.ТабличнаяЧасть.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		
	КонецЕсли; 	

КонецПроцедуры

// Функция собирает данные по документу основанию ОтчетаКомитенту и 
// возвращает типизированную структуру с данными
// 
Функция СобратьДанныеПоОтчетКомитентуОПродажах(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организация,
	|	Организация   КАК Поставщик,
	|	Подразделение КАК Подразделение,
	|	Контрагент    КАК Покупатель,
	|	СуммаДокумента          КАК Сумма,
	|	СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ВалютаДокумента         КАК Валюта,
	|	Товары.(
	|		СУММА(СуммаВознаграждения) КАК Сумма
	|	)
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &ДокументОснование";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	
	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Истина);
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Если ВыборкаСтрокТовары.Следующий() Тогда
		Строчка = Товары.Добавить();
		Строчка.Товар               = "Комиссионное вознаграждение";
		Строчка.ТоварНаименование   = "Комиссионное вознаграждение";
		Строчка.СтранаПроисхождения = "";
		Строчка.СтранаПроисхожденияКод = "";
		Строчка.ПредставлениеСтраны = "";
		Строчка.НомерГТД            = "";
		Строчка.ПредставлениеГТД    = "";
		Строчка.Количество          = 0;
		Строчка.ЕдиницаИзмерения    = "";
		Строчка.ЕдиницаИзмеренияКод = "";
		Строчка.СтавкаНДС			= Шапка.СтавкаНДС;
		СуммаДляПечати    			= ?(ВыборкаСтрокТовары.Сумма = Null, 0, ВыборкаСтрокТовары.Сумма);
		Строчка.СуммаВключаетНДС 	= Истина;
		Строчка.СуммаНДС  			= УчетНДС.РассчитатьСуммуНДС(СуммаДляПечати, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(Шапка.СтавкаНДС));
		Строчка.Сумма     			= СуммаДляПечати;
		Строчка.Цена      			= СуммаДляПечати;
	КонецЕсли;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоОтчетКомитентуОПродажах()

// Функция собирает данные по документу основанию ОтчетаКомисиионера и 
// возвращает типизированную структуру с данными
// 
Функция СобратьДанныеПоОтчетКомиссионераОПродажах(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
 	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахПокупатели.КлючСтроки,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|ПОМЕСТИТЬ ВТДанныеОПокупателе
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.Ссылка = &ДокументОснование
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация,
	|	ОтчетКомиссионераОПродажах.Организация КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомиссионераОПродажах.Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же""
	|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВТДанныеОПокупателе.Покупатель КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомиссионераОПродажах.Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ВТДанныеОПокупателе.Покупатель
	|		ИНАЧЕ ОтчетКомиссионераОПродажах.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ОтчетКомиссионераОПродажах.Подразделение КАК Подразделение,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК Валюта,
	|	ОтчетКомиссионераОПродажах.УчитыватьНДС,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах,
	|	ВТДанныеОПокупателе КАК ВТДанныеОПокупателе
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.СтранаПроисхождения.НаименованиеПолное КАК ПредставлениеСтраны,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
	|	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения,
	|	ОтчетКомиссионераОПродажахТовары.Цена,
	|	ОтчетКомиссионераОПродажахТовары.Количество,
	|	ОтчетКомиссионераОПродажахТовары.Сумма,
	|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТовары.СуммаНДС,
	|	ОтчетКомиссионераОПродажахТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры КАК Серия,
	|	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод
	|ИЗ
	|	ВТДанныеОПокупателе КАК ДанныеОПокупателе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ПО ДанныеОПокупателе.КлючСтроки = ОтчетКомиссионераОПродажахТовары.КлючСтроки
	|ГДЕ
	|	ОтчетКомиссионераОПродажахТовары.Ссылка = &ДокументОснование
	|;";
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаШапка = Результат[1].Выгрузить();
	Шапка = ТаблицаШапка[0];
	Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
		ВыборкаСтрокТовары = Результат[2].Выбрать();
	КонецЕсли;
	
	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоОтчетКомиссионераОПродажах()

// Функция собирает данные по документу основанию реализации и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоРеализацияТоваровУслуг(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент",  Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация                       КАК Поставщик,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же"" 
	|		ИНАЧЕ Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Подразделение                     КАК Подразделение,
	|	Контрагент                        КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента                    КАК Сумма,
	|	ВалютаДокумента                   КАК Валюта,
	|	УчитыватьНДС                      КАК УчитыватьНДС,
	|	СуммаВключаетНДС                  КАК СуммаВключаетНДС,
	|	АдресДоставки КАК АдресДоставки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Товар,
	               |	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.Наименование КАК ПредставлениеСтраны,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок <> 0
	               |				ИЛИ РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки <> 0
	               |			ТОГДА 0
	               |		ИНАЧЕ РеализацияТоваровУслугТовары.Цена
	               |	КОНЕЦ КАК Цена,
	               |	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	               |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры КАК Серия,
	               |	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	               |	1 КАК НомерТЧ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &ДокументОснование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Номенклатура,
	               |	ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.Содержание КАК СТРОКА(200)),
	               |	"""",
	               |	"""",
	               |	NULL,
	               |	NULL,
	               |	"""",
	               |	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	               |	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков = &ПустаяЕдиница
	               |			ТОГДА 0
	               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Количество
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугУслуги.ПроцентАвтоматическихСкидок <> 0
	               |			ТОГДА 0
	               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Цена
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |	РеализацияТоваровУслугУслуги.СуммаНДС,
	               |	РеализацияТоваровУслугУслуги.Сумма,
	               |	NULL,
	               |	NULL,
	               |	РеализацияТоваровУслугУслуги.НомерСтроки,
	               |	2
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерТЧ,
	               |	НомерСтроки";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);
	ДанныеДляПечати.Вставить("АдресДоставки",	 УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Шапка.АдресДоставки));

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;
		Строчка.СтавкаНДС         = ?(Шапка.УчитыватьНДС, ВыборкаСтрокТовары.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоРеализацияТоваровУслуг()

// Функция собирает данные по документу основанию реализации и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоВозвратуТоваровПоставщику(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент",  Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация                       КАК Поставщик,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же"" 
	|		ИНАЧЕ Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Подразделение                     КАК Подразделение,
	|	Контрагент                        КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента                    КАК Сумма,
	|	ВалютаДокумента                   КАК Валюта,
	|	УчитыватьНДС                      КАК УчитыватьНДС,
	|	СуммаВключаетНДС                  КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения.Наименование КАК ПредставлениеСтраны,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	|	ВозвратТоваровПоставщикуТовары.Цена КАК Цена,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
	|	ВозвратТоваровПоставщикуТовары.Сумма КАК Сумма,
	|	ВозвратТоваровПоставщикуТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры КАК Серия,
	|	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	1 КАК НомерТЧ
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуОборудование.Номенклатура,
	|	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуОборудование.Номенклатура.НаименованиеПолное КАК СТРОКА(200)),
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры.СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры.СтранаПроисхождения.Код,
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры.СтранаПроисхождения.Наименование,
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры.НомерГТД,
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры.НомерГТД.Представление,
	|	ВозвратТоваровПоставщикуОборудование.ЕдиницаИзмерения.Представление,
	|	ВозвратТоваровПоставщикуОборудование.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код,
	|	ВозвратТоваровПоставщикуОборудование.Количество,
	|	ВозвратТоваровПоставщикуОборудование.Цена,
	|	ВозвратТоваровПоставщикуОборудование.СтавкаНДС,
	|	ВозвратТоваровПоставщикуОборудование.СуммаНДС,
	|	ВозвратТоваровПоставщикуОборудование.Сумма,
	|	ВозвратТоваровПоставщикуОборудование.ХарактеристикаНоменклатуры,
	|	ВозвратТоваровПоставщикуОборудование.СерияНоменклатуры,
	|	ВозвратТоваровПоставщикуОборудование.НомерСтроки,
	|	2
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Оборудование КАК ВозвратТоваровПоставщикуОборудование
	|ГДЕ
	|	ВозвратТоваровПоставщикуОборудование.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТЧ,
	|	НомерСтроки";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;
		Строчка.СтавкаНДС         = ?(Шапка.УчитыватьНДС, ВыборкаСтрокТовары.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоВозвратуТоваровПоставщику()

// Функция собирает данные по документу основанию реализации и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоВозвратуТоваровПоставщикуИзНТТ(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент",  Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация                       КАК Поставщик,
	|	""он же"" КАК Грузоотправитель,
	|	Подразделение                     КАК Подразделение,
	|	Контрагент                        КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента                    КАК Сумма,
	|	ВалютаДокумента                   КАК Валюта,
	|	УчитыватьНДС                      КАК УчитыватьНДС,
	|	СуммаВключаетНДС                  КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ КАК ВозвратТоваровПоставщику
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.СтранаПроисхождения.Наименование КАК ПредставлениеСтраны,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	|	ВозвратТоваровПоставщикуТовары.Цена КАК Цена,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
	|	ВозвратТоваровПоставщикуТовары.Сумма КАК Сумма,
	|	ВозвратТоваровПоставщикуТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры КАК Серия,
	|	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;
		Строчка.СтавкаНДС         = ?(Шапка.УчитыватьНДС, ВыборкаСтрокТовары.СтавкаНДС, Перечисления.СтавкиНДС.БезНДС);
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоВозвратуТоваровПоставщикуИзНТТ()

// Функция собирает данные по документу основанию реализации и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоРеализацияУслугПоПереработке(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация КАК Поставщик,
	|	Подразделение КАК Подразделение,
	|	Контрагент  КАК Покупатель,
	|	СуммаДокумента   КАК Сумма,
	|	ВалютаДокумента  КАК Валюта,
	|	УчитыватьНДС     КАК УчитыватьНДС,
	|	СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияУслугПоПереработке.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(РеализацияУслугПоПереработке.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	NULL КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	"""" КАК ПредставлениеСтраны,
	|	РеализацияУслугПоПереработке.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	РеализацияУслугПоПереработке.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	NULL КАК НомерГТД,
	|	NULL КАК ПредставлениеГТД,
	|	РеализацияУслугПоПереработке.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПоПереработке.ПроцентСкидкиНаценки <> 0
	|			ТОГДА 0
	|		ИНАЧЕ РеализацияУслугПоПереработке.Цена
	|	КОНЕЦ КАК Цена,
	|	РеализацияУслугПоПереработке.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияУслугПоПереработке.СуммаНДС КАК СуммаНДС,
	|	РеализацияУслугПоПереработке.Сумма КАК Сумма,
	|	РеализацияУслугПоПереработке.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияУслугПоПереработке.СерияНоменклатуры КАК Серия
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработке
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработке.Номенклатура,
	|	ВЫРАЗИТЬ(РеализацияУслугПоПереработке.Содержание КАК СТРОКА(200)),
	|	NULL,
	|	"""",
	|	"""",
	|	РеализацияУслугПоПереработке.Номенклатура.ЕдиницаХраненияОстатков.Представление,
	|	РеализацияУслугПоПереработке.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	NULL,
	|	"""",
	|	РеализацияУслугПоПереработке.Количество,
	|	РеализацияУслугПоПереработке.Цена,
	|	РеализацияУслугПоПереработке.СтавкаНДС,
	|	РеализацияУслугПоПереработке.СуммаНДС,
	|	РеализацияУслугПоПереработке.Сумма,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработке
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоРеализацияУслугПоПереработке()

Функция СобратьДанныеПоАкту(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	
	СтрокаВыборкиПоляСодержания = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("", "ТоварНаименование");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслуг.Организация,
	|	АктОбОказанииПроизводственныхУслуг.Организация КАК Поставщик,
	|	АктОбОказанииПроизводственныхУслуг.Подразделение КАК Подразделение,
	|	АктОбОказанииПроизводственныхУслуг.Контрагент КАК Покупатель,
	|	АктОбОказанииПроизводственныхУслуг.СуммаДокумента КАК Сумма,
	|	АктОбОказанииПроизводственныхУслуг.ВалютаДокумента КАК Валюта,
	|	АктОбОказанииПроизводственныхУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	АктОбОказанииПроизводственныхУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АктОбОказанииПроизводственныхУслуг.Услуги.(
	|		Ссылка,
	|		НомерСтроки,
	|		Количество,
	|		Номенклатура КАК Товар,
	|		ВесовойКоэффициент,
    |		ВЫБОР
    |			КОГДА ПроцентСкидкиНаценки <> 0
    |				ТОГДА 0
    |			ИНАЧЕ Цена
    |		КОНЕЦ КАК Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		НоменклатурнаяГруппа,
	|		" + СтрокаВыборкиПоляСодержания + ",
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	|		Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|		"""" КАК СтранаПроисхождения,
	|		"""" КАК СтранаПроисхожденияКод,
	|		"""" КАК ПредставлениеСтраны
	|	)
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Услуги.Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС = Шапка.СуммаВключаетНДС;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;


КонецФункции

// Функция собирает данные по документу основанию ПередачаОС и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоПередачеОС(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
    Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Организация,
	|	Организация КАК Поставщик,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же"" 
	|		ИНАЧЕ Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Подразделение КАК Подразделение,
	|	Контрагент  КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента   КАК Сумма,
	|	ВалютаДокумента  КАК Валюта,
	|	УчитыватьНДС     КАК УчитыватьНДС,
	|	СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|
	|ГДЕ
	|	ПередачаОС.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОС.ОсновноеСредство КАК Товар,
	               |	ВЫРАЗИТЬ(ТаблицаОС.ОсновноеСредство.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	ТаблицаОС.СтавкаНДС КАК СтавкаНДС,
	               |	ТаблицаОС.СуммаНДС КАК СуммаНДС,
	               |	ТаблицаОС.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПередачаОС.ОС КАК ТаблицаОС
	               |ГДЕ                                 	
	               |	ТаблицаОС.Ссылка = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Товар";
	
	
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();
                                                        
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.Количество          = 1;
		Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
		Строчка.Цена                = ВыборкаСтрокТовары.Сумма;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоПередачеОС()

// Функция собирает данные по документу основанию ПринятиеКУчетуОС и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоПринятиеКУчетуОС(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ВидСвязиОрг", Перечисления.ВидыСобственныхКонтрагентов.Организация);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОС.Организация,
	|	ПринятиеКУчетуОС.Организация              КАК Поставщик,
	|	ПринятиеКУчетуОС.Организация              КАК Грузоотправитель,
	|	ПринятиеКУчетуОС.ПодразделениеОрганизации КАК Подразделение,
	|	СобственныеКонтрагенты.Контрагент         КАК Покупатель,
	|	СобственныеКонтрагенты.Контрагент         КАК Грузополучатель,
	|	ПринятиеКУчетуОС.СтоимостьБУХоз           КАК СуммаДокумента,
	|	Константы.ВалютаРегламентированногоУчета  КАК ВалютаДокумента,
	|	ИСТИНА                                    КАК УчитыватьНДС,
	|	ЛОЖЬ                                      КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|		ПО 
	|			ПринятиеКУчетуОС.Организация = СобственныеКонтрагенты.Объект
	|			И СобственныеКонтрагенты.ВидСвязи = &ВидСвязиОрг,
	|	Константы КАК Константы
	|ГДЕ
	|	ПринятиеКУчетуОС.Ссылка = &ДокументОснование
	|";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(НДСНачисленный.СуммаБезНДС) КАК СуммаБезНДС,
	               |	СУММА(НДСНачисленный.НДС) КАК НДС,
	               |	НДСНачисленный.СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	               |ГДЕ
	               |	НДСНачисленный.Регистратор = &ДокументОснование
	               |	И НДСНачисленный.ВидЦенности = &ВидЦенностиСМРхозспособом
	               |	И НДСНачисленный.ВидНачисления = &ВидНачисленияКуплате
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДСНачисленный.СтавкаНДС";
	Запрос.УстановитьПараметр("ВидЦенностиСМРхозспособом", Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	Запрос.УстановитьПараметр("ВидНачисленияКуплате", Перечисления.НДСВидНачисления.НДСНачисленКУплате);
				   
	ЗапросОС = Новый Запрос;
	ЗапросОС.Текст = "ВЫБРАТЬ
	                 |	НДСпоОСиНМА.Объект,
	                 |	ВЫРАЗИТЬ(НДСпоОСиНМА.Объект.НаименованиеПолное КАК СТРОКА(200)) КАК ОбъектНаименование,
	                 |	СУММА(НДСпоОСиНМА.СуммаБезНДС + НДСпоОСиНМА.НДС) КАК Сумма
	                 |ИЗ
	                 |	РегистрНакопления.НДСпоОСиНМА КАК НДСпоОСиНМА
	                 |ГДЕ
	                 |	НДСпоОСиНМА.Регистратор = &ДокументОснование
	                 |	И НДСпоОСиНМА.ВидДвижения = &ВидДвиженияПриход
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	НДСпоОСиНМА.Объект,
	                 |	ВЫРАЗИТЬ(НДСпоОСиНМА.Объект.НаименованиеПолное КАК СТРОКА(200))";
	ЗапросОС.УстановитьПараметр("ДокументОснование", ДокОснование);
	ЗапросОС.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
					 
	
	РезультатЗапросаТовары = Запрос.Выполнить();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         "");
	ДанныеДляПечати.Вставить("ДатаПРД",          "");
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Подразделение",    Шапка.Подразделение);
	ДанныеДляПечати.Вставить("Покупатель",       ?(НЕ ЗначениеЗаполнено(Шапка.Покупатель), Шапка.Организация, Шапка.Покупатель));
	ДанныеДляПечати.Вставить("Грузополучатель",  ?(НЕ ЗначениеЗаполнено(Шапка.Грузополучатель), Шапка.Организация, Шапка.Грузополучатель));
	ДанныеДляПечати.Вставить("Сумма",            Шапка.СуммаДокумента);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.ВалютаДокумента);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	ТаблицаПоОС = ЗапросОС.Выполнить().Выгрузить();
	
	Если ТаблицаПоОС.Количество() = 0 Тогда
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	КолонкаРаспределения = ТаблицаПоОС.ВыгрузитьКолонку("Сумма");
	
	ВыборкаСтрокТовары = РезультатЗапросаТовары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		КолонкаСуммаБезНДС = 	ОбщегоНазначения.РаспределитьПропорционально(ВыборкаСтрокТовары.СуммаБезНДС, КолонкаРаспределения);
		КолонкаНДС = 			ОбщегоНазначения.РаспределитьПропорционально(ВыборкаСтрокТовары.НДС, КолонкаРаспределения);
		
		Если КолонкаСуммаБезНДС =  Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для К = 0 По КолонкаСуммаБезНДС.Количество() - 1 Цикл
			Строчка = Товары.Добавить();
			Строчка.Товар               = ТаблицаПоОС[К].Объект;
			Строчка.ТоварНаименование   = "Строительно-монтажные работы для собственного потребления: " + ?(ПустаяСтрока(ТаблицаПоОС[К].ОбъектНаименование), ТаблицаПоОС[К].Объект, СокрЛП(ТаблицаПоОС[К].ОбъектНаименование));
			Строчка.СтранаПроисхождения = "";
			Строчка.ПредставлениеСтраны = "";
			Строчка.НомерГТД            = "";
			Строчка.ПредставлениеГТД    = "";
			Строчка.Количество          = 0;
			Строчка.ЕдиницаИзмерения    = "";
			Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
			Строчка.Сумма               = КолонкаСуммаБезНДС[К];
			Если КолонкаНДС <> Неопределено Тогда
				Строчка.СуммаНДС            = КолонкаНДС[К];
			КонецЕсли;
			Строчка.СтавкаНДС           = ВыборкаСтрокТовары.СтавкаНДС;
		КонецЦикла;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоПринятиеКУчетуОС()

// Функция собирает данные по документу основанию МодернизацияОС и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоМодернизацияОС(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ВидСвязиОрг", Перечисления.ВидыСобственныхКонтрагентов.Организация);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МодернизацияОС.Организация,
	|	МодернизацияОС.Организация              	КАК Поставщик,
	|	СобственныеКонтрагенты.Контрагент	   		КАК Покупатель,
	|	МодернизацияОС.СтоимостьБУХоз           	КАК СуммаДокумента,
	|	Константы.ВалютаРегламентированногоУчета	КАК ВалютаДокумента,
	|	ИСТИНА                                   	КАК УчитыватьНДС,
	|	ЛОЖЬ                                      	КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.МодернизацияОС КАК МодернизацияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|		ПО 
	|			МодернизацияОС.Организация = СобственныеКонтрагенты.Объект
	|			И СобственныеКонтрагенты.ВидСвязи = &ВидСвязиОрг,
	|	Константы КАК Константы
	|ГДЕ
	|	МодернизацияОС.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(НДСНачисленный.СуммаБезНДС) КАК СуммаБезНДС,
	               |	СУММА(НДСНачисленный.НДС) КАК НДС,
	               |	НДСНачисленный.СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	               |ГДЕ
	               |	НДСНачисленный.Регистратор = &ДокументОснование
	               |	И НДСНачисленный.ВидЦенности = &ВидЦенностиСМРхозспособом
	               |	И НДСНачисленный.ВидНачисления = &ВидНачисленияКуплате
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДСНачисленный.СтавкаНДС";
	Запрос.УстановитьПараметр("ВидЦенностиСМРхозспособом", Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	Запрос.УстановитьПараметр("ВидНачисленияКуплате", Перечисления.НДСВидНачисления.НДСНачисленКУплате);
				   
	ЗапросОС = Новый Запрос;
	ЗапросОС.Текст = "ВЫБРАТЬ
	                 |	НДСпоОСиНМА.Объект,
	                 |	ВЫРАЗИТЬ(НДСпоОСиНМА.Объект.НаименованиеПолное КАК СТРОКА(200)) КАК ОбъектНаименование,
	                 |	СУММА(НДСпоОСиНМА.СуммаБезНДС + НДСпоОСиНМА.НДС) КАК Сумма
	                 |ИЗ
	                 |	РегистрНакопления.НДСпоОСиНМА КАК НДСпоОСиНМА
	                 |ГДЕ
	                 |	НДСпоОСиНМА.Регистратор = &ДокументОснование
	                 |	И НДСпоОСиНМА.ВидДвижения = &ВидДвиженияПриход
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	НДСпоОСиНМА.Объект,
	                 |	ВЫРАЗИТЬ(НДСпоОСиНМА.Объект.НаименованиеПолное КАК СТРОКА(200))";
	ЗапросОС.УстановитьПараметр("ДокументОснование", ДокОснование);
	ЗапросОС.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
					 
	
	РезультатЗапросаТовары = Запрос.Выполнить();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         "");
	ДанныеДляПечати.Вставить("ДатаПРД",          "");
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    "");
	ДанныеДляПечати.Вставить("Покупатель",       ?(НЕ ЗначениеЗаполнено(Шапка.Покупатель), Шапка.Организация, Шапка.Покупатель));
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.СуммаДокумента);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.ВалютаДокумента);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	ТаблицаПоОС = ЗапросОС.Выполнить().Выгрузить();
	
	Если ТаблицаПоОС.Количество() = 0 Тогда
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	КолонкаРаспределения = ТаблицаПоОС.ВыгрузитьКолонку("Сумма");
	
	ВыборкаСтрокТовары = РезультатЗапросаТовары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		КолонкаСуммаБезНДС = 	ОбщегоНазначения.РаспределитьПропорционально(ВыборкаСтрокТовары.СуммаБезНДС, КолонкаРаспределения);
		КолонкаНДС = 			ОбщегоНазначения.РаспределитьПропорционально(ВыборкаСтрокТовары.НДС, КолонкаРаспределения);
		
		Если КолонкаСуммаБезНДС =  Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для К = 0 По КолонкаСуммаБезНДС.Количество() - 1 Цикл
			Строчка = Товары.Добавить();
			Строчка.Товар               = ТаблицаПоОС[К].Объект;
			Строчка.ТоварНаименование   = "Строительно-монтажные работы для собственного потребления: " + ?(ПустаяСтрока(ТаблицаПоОС[К].ОбъектНаименование), ТаблицаПоОС[К].Объект, СокрЛП(ТаблицаПоОС[К].ОбъектНаименование));
			Строчка.СтранаПроисхождения = "";
			Строчка.ПредставлениеСтраны = "";
			Строчка.НомерГТД            = "";
			Строчка.ПредставлениеГТД    = "";
			Строчка.Количество          = 0;
			Строчка.ЕдиницаИзмерения    = "";
			Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
			Строчка.Сумма               = КолонкаСуммаБезНДС[К];
			Если КолонкаНДС <> Неопределено Тогда
				Строчка.СуммаНДС            = КолонкаНДС[К];
			КонецЕсли;
			Строчка.СтавкаНДС           = ВыборкаСтрокТовары.СтавкаНДС;
		КонецЦикла;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоМодернизацияОС()

// Функция собирает данные по документу основанию НачислениеНДСпоСМРхозспособом и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоНачислениеНДСпоСМРхозспособом(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ВидСвязиОрг", Перечисления.ВидыСобственныхКонтрагентов.Организация);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НачислениеНДСпоСМРхозспособом.Организация,
	|	НачислениеНДСпоСМРхозспособом.Организация              	КАК Поставщик,
	|	СобственныеКонтрагенты.Контрагент	   		КАК Покупатель,
	|	Константы.ВалютаРегламентированногоУчета	КАК ВалютаДокумента,
	|	ИСТИНА                                   	КАК УчитыватьНДС,
	|	ЛОЖЬ                                      	КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.НачислениеНДСпоСМРхозспособом КАК НачислениеНДСпоСМРхозспособом
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|		ПО 
	|			НачислениеНДСпоСМРхозспособом.Организация = СобственныеКонтрагенты.Объект
	|			И СобственныеКонтрагенты.ВидСвязи = &ВидСвязиОрг,
	|	Константы КАК Константы
	|ГДЕ
	|	НачислениеНДСпоСМРхозспособом.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос.Текст = "ВЫБРАТЬ
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.ОбъектСтроительства КАК Товар,
	               |	ВЫРАЗИТЬ(НачислениеНДСпоСМРхозспособомСМРхозспособом.ОбъектСтроительства.Наименование КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.СуммаБезНДС КАК Сумма,
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.СтавкаНДС,
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.НДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.НачислениеНДСпоСМРхозспособом.СМРхозспособом КАК НачислениеНДСпоСМРхозспособомСМРхозспособом
	               |ГДЕ
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.Ссылка = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НачислениеНДСпоСМРхозспособомСМРхозспособом.НомерСтроки";
	
	РезультатЗапросаТовары = Запрос.Выполнить();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         "");
	ДанныеДляПечати.Вставить("ДатаПРД",          "");
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    "");
	ДанныеДляПечати.Вставить("Покупатель",       ?(НЕ ЗначениеЗаполнено(Шапка.Покупатель), Шапка.Организация, Шапка.Покупатель));
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Валюта",           Шапка.ВалютаДокумента);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	ВыборкаСтрокТовары = РезультатЗапросаТовары.Выбрать();
	
	Если ВыборкаСтрокТовары.Количество() = 0 Тогда
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование   = "Строительно-монтажные работы для собственного потребления: " + ВыборкаСтрокТовары.ТоварНаименование;
		Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоМодернизацияОС()

// Функция собирает данные по документу основанию ПередачаНМАОрганизаций и возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоПередачеНМАОрганизаций(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ПередачаНМА.Организация,
	               |	ПередачаНМА.Организация КАК Поставщик,
	               |	ПередачаНМА.Контрагент КАК Покупатель,
	               |	ПередачаНМА.СуммаДокумента КАК СуммаДокумента,
	               |	ПередачаНМА.ВалютаДокумента КАК Валюта,
	               |	ПередачаНМА.УчитыватьНДС КАК УчитыватьНДС,
	               |	ПередачаНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ПередачаНМА.НематериальныйАктив КАК Товар,
	               |	ВЫРАЗИТЬ(ПередачаНМА.НематериальныйАктив.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	ПередачаНМА.СтавкаНДС КАК СтавкаНДС,
	               |	ПередачаНМА.СуммаНДС КАК СуммаНДС,
	               |	ПередачаНМА.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПередачаНМА КАК ПередачаНМА
	               |ГДЕ
	               |	ПередачаНМА.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    "");
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.СуммаДокумента);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Строчка = Товары.Добавить();
	Строчка.Товар               = Шапка.Товар;
	Строчка.ТоварНаименование   = Шапка.ТоварНаименование;
	Строчка.СтранаПроисхождения = "";
	Строчка.ПредставлениеСтраны = "";
	Строчка.НомерГТД            = "";
	Строчка.ПредставлениеГТД    = "";
	Строчка.Количество          = 1;
	Строчка.ЕдиницаИзмерения    = "";
	Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
	Строчка.Цена                = Шапка.Сумма;
	Строчка.Сумма               = Шапка.Сумма;
	Строчка.СуммаНДС            = Шапка.СуммаНДС;
	Строчка.СтавкаНДС           = Шапка.СтавкаНДС;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоПередачеОС()

// Функция собирает данные по документу основанию ОтражениеРеализацииТоваровИУслуг возвращает типизированную 
// структуру с данными
// 
Функция СобратьДанныеПоОтражениюРеализацииТоваровИУслуг(ДокОснование, Ссылка)


	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());

	Запрос.Текст = "ВЫБРАТЬ
	|	Организация,
	|	Организация   КАК Поставщик,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же"" 
	|		ИНАЧЕ Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	Контрагент    КАК Покупатель,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА Контрагент 
	|		ИНАЧЕ Грузополучатель 
	|	КОНЕЦ КАК Грузополучатель,
	|	СуммаДокумента	 КАК Сумма,
	|	""""			 КАК Валюта,
	|	Истина			 КАК УчитыватьНДС,
	|	СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
	|
	|ГДЕ
	|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	Запрос.УстановитьПараметр("ПустаяСтранаПроисхождения", Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойНомерГТД", Справочники.НомераГТД.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	ЕСТЬNULL(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СерияНоменклатуры.СтранаПроисхождения, &ПустаяСтранаПроисхождения) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СерияНоменклатуры.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СерияНоменклатуры.СтранаПроисхождения.Наименование, """") КАК ПредставлениеСтраны,
	|	ЕСТЬNULL(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СерияНоменклатуры.НомерГТД, &ПустойНомерГТД) КАК НомерГТД,
	|	ЕСТЬNULL(ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СерияНоменклатуры.НомерГТД.Представление, """") КАК ПредставлениеГТД,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Количество,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Цена,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СтавкаНДС,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.СуммаНДС,
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Сумма
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС.ТоварыИУслуги КАК ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги
	|ГДЕ
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.Ссылка = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтражениеРеализацииТоваровИУслугНДСТоварыИУслуги.НомерСтроки";
						
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         Ссылка.НомерПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("ДатаПРД",          Ссылка.ДатаПлатежноРасчетногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Шапка.Грузоотправитель);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            0);
	ДанныеДляПечати.Вставить("Валюта",           Константы.ВалютаРегламентированногоУчета.Получить());
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Истина);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;

	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоОтражениюРеализацииТоваровИУслуг()

Функция СобратьДанныеСФнаАвансИСуммовуюРазницу(Ссылка)
	
	Если Не (Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу) 
		Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	мНадписьПредоплата = ?(Ссылка.Дата >= '20060101', "Предварительная оплата", "Авансовый платеж");
	НадписьНаименование = ?(Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
							ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента, мНадписьПредоплата, "Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)");
	
	Запрос = Новый Запрос;
 	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Организация,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ КАК Дата,
	|	СчетФактураВыданный.Организация КАК Поставщик,
	|	СчетФактураВыданный.Контрагент КАК Покупатель,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	СчетФактураВыданный.Сумма КАК Сумма,
	|	СчетФактураВыданный.СуммаНДС КАК СуммаНДС,
	|	СчетФактураВыданный.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Шапка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Шапка.Дата);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Истина);
	ДанныеДляПечати.Вставить("СуммаВключаетНДС", Истина);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);
	
	Товары = ИнициализацияТаблицыСтрок();
	
	Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
	               |	СчетФактураВыданныйАвансы.Номенклатура КАК Товар,
	               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварНаименование,
	               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Содержание КАК СТРОКА(1000)) КАК Содержание,
	               |	СУММА(СчетФактураВыданныйАвансы.Сумма) КАК Сумма,
	               |	СУММА(СчетФактураВыданныйАвансы.СуммаНДС) КАК СуммаНДС,
	               |	СчетФактураВыданныйАвансы.СтавкаНДС
	               |ИЗ
	               |	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	               |ГДЕ
	               |	СчетФактураВыданныйАвансы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетФактураВыданныйАвансы.СтавкаНДС,
	               |	СчетФактураВыданныйАвансы.Номенклатура,
	               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)),
	               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Содержание КАК СТРОКА(1000))";
		ТаблицаПоАвансам = Запрос.Выполнить().Выгрузить();
				
		СоответствиеСтавок = Новый Соответствие();
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, Перечисления.СтавкиНДС.НДС10_110);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, Перечисления.СтавкиНДС.НДС18_118);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС20_120);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.БезНДС, Перечисления.СтавкиНДС.БезНДС);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.ПустаяСсылка(), Перечисления.СтавкиНДС.БезНДС);
		
		Для Каждого СтрокаТаблицы Из ТаблицаПоАвансам Цикл
		
			Строчка = Товары.Добавить();
			Строчка.Товар               = ?(ЗначениеЗаполнено(СтрокаТаблицы.Товар), СтрокаТаблицы.Товар, НадписьНаименование);
			Строчка.ТоварНаименование   = ?(ЗначениеЗаполнено(СокрЛП(СтрокаТаблицы.Содержание)), СокрЛП(СтрокаТаблицы.Содержание), 
											?(ЗначениеЗаполнено(СтрокаТаблицы.Товар), СокрЛП(СтрокаТаблицы.ТоварНаименование), НадписьНаименование));
			Строчка.СтранаПроисхождения = "";
			Строчка.ПредставлениеСтраны = "";
			Строчка.НомерГТД            = "";
			Строчка.ПредставлениеГТД    = "";
			Строчка.Количество          = 0;
			Строчка.ЕдиницаИзмерения    = "";
			Строчка.СуммаВключаетНДС    = Истина;
			Строчка.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
			Строчка.СуммаНДС  = СтрокаТаблицы.СуммаНДС;
			Строчка.Сумма     = СтрокаТаблицы.Сумма;
		
		КонецЦикла;
		
	Иначе

		Строчка = Товары.Добавить();
		Строчка.Товар               = НадписьНаименование;
		Строчка.ТоварНаименование   = НадписьНаименование;
		Строчка.СтранаПроисхождения = "";
		Строчка.ПредставлениеСтраны = "";
		Строчка.НомерГТД            = "";
		Строчка.ПредставлениеГТД    = "";
		Строчка.Количество          = 0;
		Строчка.ЕдиницаИзмерения    = "";
		Строчка.СуммаВключаетНДС	= Истина;

		Строчка.СтавкаНДС = Шапка.СтавкаНДС;
		Строчка.СуммаНДС  = Шапка.СуммаНДС;
		Строчка.Сумма     = Шапка.Сумма;

	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
	ДанныеДляПечати.Вставить("ТолькоУслуги",   Истина);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоСВП()

Функция СобратьДанныеСФНалоговогоАгента(Ссылка)
	
	Если Не Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
 	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Организация,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ КАК Дата,
	|	СчетФактураВыданный.Организация КАК Покупатель,
	|	СчетФактураВыданный.Контрагент КАК Поставщик,
	|	СчетФактураВыданный.ДоговорКонтрагента.ВидАгентскогоДоговора КАК ВидАгентскогоДоговора,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	СчетФактураВыданный.Сумма КАК Сумма,
	|	СчетФактураВыданный.СуммаНДС КАК СуммаНДС,
	|	СчетФактураВыданный.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

				   
	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Шапка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Шапка.Дата);
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Истина);
	ДанныеДляПечати.Вставить("СуммаВключаетНДС", Истина);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Организация), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);
	
	Товары = ИнициализацияТаблицыСтрок();
	
	Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	СчетФактураВыданныйАвансы.Номенклатура КАК Товар,
		               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварНаименование,
		               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Содержание КАК СТРОКА(1000)) КАК Содержание,
		               |	СУММА(СчетФактураВыданныйАвансы.Сумма) КАК Сумма,
		               |	СУММА(СчетФактураВыданныйАвансы.СуммаНДС) КАК СуммаНДС,
		               |	СчетФактураВыданныйАвансы.СтавкаНДС
		               |ИЗ
		               |	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		               |ГДЕ
		               |	СчетФактураВыданныйАвансы.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СчетФактураВыданныйАвансы.СтавкаНДС,
		               |	СчетФактураВыданныйАвансы.Номенклатура,
		               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)),
		               |	ВЫРАЗИТЬ(СчетФактураВыданныйАвансы.Содержание КАК СТРОКА(1000))";
		ТаблицаПоАвансам = Запрос.Выполнить().Выгрузить();
				
		СоответствиеСтавок = Новый Соответствие();
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС10, Перечисления.СтавкиНДС.НДС10_110);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС18, Перечисления.СтавкиНДС.НДС18_118);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС20_120);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.БезНДС, Перечисления.СтавкиНДС.БезНДС);
		СоответствиеСтавок.Вставить(Перечисления.СтавкиНДС.ПустаяСсылка(), Перечисления.СтавкиНДС.БезНДС);
		
		Для Каждого СтрокаТаблицы Из ТаблицаПоАвансам Цикл
			
			Строчка = Товары.Добавить();
			Строчка.Товар               = ?(ЗначениеЗаполнено(СтрокаТаблицы.Товар), СтрокаТаблицы.Товар, Шапка.ВидАгентскогоДоговора);
			Строчка.ТоварНаименование   = ?(ЗначениеЗаполнено(СокрЛП(СтрокаТаблицы.Содержание)), СокрЛП(СтрокаТаблицы.Содержание), 
											?(ЗначениеЗаполнено(СтрокаТаблицы.Товар), СокрЛП(СтрокаТаблицы.ТоварНаименование), Шапка.ВидАгентскогоДоговора));
			Строчка.СтранаПроисхождения = "";
			Строчка.ПредставлениеСтраны = "";
			Строчка.НомерГТД            = "";
			Строчка.ПредставлениеГТД    = "";
			Строчка.Количество          = 0;
			Строчка.ЕдиницаИзмерения    = "";
			Строчка.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
			Строчка.СуммаНДС  = СтрокаТаблицы.СуммаНДС;
			Строчка.Сумма     = СтрокаТаблицы.Сумма;
			Строчка.СуммаВключаетНДС	= Истина;
			
		КонецЦикла;
		
	Иначе

		Строчка = Товары.Добавить();
		Строчка.Товар               = Шапка.ВидАгентскогоДоговора;
		Строчка.ТоварНаименование   = Шапка.ВидАгентскогоДоговора;
		Строчка.СтранаПроисхождения = "";
		Строчка.ПредставлениеСтраны = "";
		Строчка.НомерГТД            = "";
		Строчка.ПредставлениеГТД    = "";
		Строчка.Количество          = 0;
		Строчка.ЕдиницаИзмерения    = "";

		Строчка.СтавкаНДС = Шапка.СтавкаНДС;
		Строчка.СуммаНДС  = Шапка.СуммаНДС;
		Строчка.Сумма     = Шапка.Сумма;
 		Строчка.СуммаВключаетНДС	= Истина;

	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
	ДанныеДляПечати.Вставить("ТолькоУслуги",   Истина);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоСВП()

Функция СобратьДанныеДляПечатиИсправленияСчетаФактуры(ТекущееОснование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ТекущееОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Организация,
	|	КорректировкаРеализации.Организация КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же""
	|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	КорректировкаРеализации.Контрагент КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА КорректировкаРеализации.Контрагент
	|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	КорректировкаРеализации.СуммаДокумента КАК Сумма,
	|	КорректировкаРеализации.ВалютаДокумента КАК Валюта,
	|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,		
	|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &ДокументОснование";

	ЗапросПоТоварам = Новый Запрос();
	ЗапросПоТоварам.УстановитьПараметр("ДокументОснование", ТекущееОснование);
	ЗапросПоТоварам.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПоТоварам.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПоТоварам.Номенклатура КАК Товар,
	|	ТаблицаПоТоварам.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаПоТоварам.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	ТаблицаПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ТаблицаПоТоварам.Количество) КАК Количество,
	|	ТаблицаПоТоварам.Цена КАК Цена,
	|	ТаблицаПоТоварам.Сумма КАК Сумма,
	|	ТаблицаПоТоварам.СуммаНДС КАК СуммаНДС,
	|	ТаблицаПоТоварам.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПоТоварам.СерияНоменклатуры КАК Серия,
	|	ТаблицаПоТоварам.ХарактеристикаНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаПоТоварам
	|ГДЕ
	|	ТаблицаПоТоварам.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПоТоварам.ЕдиницаИзмерения,
	|	ТаблицаПоТоварам.Номенклатура,
	|	ТаблицаПоТоварам.СтавкаНДС,
	|	ТаблицаПоТоварам.СерияНоменклатуры,
	|	ТаблицаПоТоварам.ХарактеристикаНоменклатуры,
	|	ТаблицаПоТоварам.НомерСтроки,
	|	ТаблицаПоТоварам.СерияНоменклатуры.СтранаПроисхождения,
	|	ТаблицаПоТоварам.СерияНоменклатуры.НомерГТД,
	|	ТаблицаПоТоварам.Цена,
	|	ТаблицаПоТоварам.Сумма,
	|	ТаблицаПоТоварам.СуммаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Товар,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Товар.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ТаблицаТовары.СтранаПроисхождения,
	|	ТаблицаТовары.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	ТаблицаТовары.СтранаПроисхождения.Наименование КАК ПредставлениеСтраны,
	|	ТаблицаТовары.НомерГТД,
	|	ТаблицаТовары.НомерГТД.Представление КАК ПредставлениеГТД,
	|	ТаблицаТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.Характеристика,
	|	""Товары"" КАК ВидПоступления
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаПоУслугам.НомерСтроки,
	|	ТаблицаПоУслугам.Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаПоУслугам.Содержание КАК СТРОКА(1000)),
	|	""Россия"",
	|	NULL,
	|	""Россия"",
	|	"""",
	|	"""",
	|	ТаблицаПоУслугам.Номенклатура.ЕдиницаХраненияОстатков,
	|	ТаблицаПоУслугам.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	ТаблицаПоУслугам.Количество,
	|	ТаблицаПоУслугам.Цена,
	|	ТаблицаПоУслугам.Сумма,
	|	ТаблицаПоУслугам.СуммаНДС,
	|	ТаблицаПоУслугам.СтавкаНДС,
	|	NULL,
	|	NULL,
	|	""Услуги""
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ТаблицаПоУслугам
	|ГДЕ
	|	ТаблицаПоУслугам.Ссылка = &ДокументОснование
	|	И ТаблицаПоУслугам.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	ВыборкаСтрокТовары = ЗапросПоТоварам.Выполнить().Выбрать();
    	
	Шапка.Следующий();
	
	ДанныеДляПечати = Новый Структура();
	
	Поставщик = Шапка.Поставщик;
	Грузоотправитель = Шапка.Грузоотправитель;
	Если ЗначениеЗаполнено(Поставщик.ГоловнаяОрганизация) Тогда 
		Грузоотправитель = Поставщик;
		Поставщик = Поставщик.ГоловнаяОрганизация;
	КонецЕсли;
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Дата,НомерИсходногоДокумента,ДатаИсходногоДокумента");
    	
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            РеквизитыСФ.НомерИсходногоДокумента);
	ДанныеДляПечати.Вставить("Дата",             РеквизитыСФ.ДатаИсходногоДокумента);
	ДанныеДляПечати.Вставить("Поставщик",        Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеДляПечати.Вставить("Покупатель",       Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",  Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("Сумма",            Шапка.Сумма);
	ДанныеДляПечати.Вставить("Валюта",           Шапка.Валюта);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);
	ДанныеДляПечати.Вставить("СуммаВключаетНДС", Шапка.СуммаВключаетНДС);
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, РеквизитыСФ.Дата);
	
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Организация), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	ЕстьТовары = Ложь;
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		ЕстьТовары = ЕстьТовары ИЛИ ВыборкаСтрокТовары.ВидПоступления = "Товары";
		
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		Строчка.ТоварНаименование = СокрЛП(ВыборкаСтрокТовары.ТоварНаименование) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(ВыборкаСтрокТовары);
		Строчка.СуммаВключаетНДС  = Шапка.СуммаВключаетНДС;

	КонецЦикла;

	Если НЕ ЕстьТовары Тогда
		ДанныеДляПечати.Грузоотправитель = "";
		ДанныеДляПечати.Грузополучатель = "";		
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;
		
КонецФункции	

Функция СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(ТекущееОснование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументОснование", ТекущееОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Организация,
	|	КорректировкаРеализации.Организация КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же""
	|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	КорректировкаРеализации.Контрагент КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА КорректировкаРеализации.Контрагент
	|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	КорректировкаРеализации.СуммаДокумента КАК Сумма,
	|	КорректировкаРеализации.ВалютаДокумента КАК Валюта,
	|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки
	|ПОМЕСТИТЬ ВТИсходныйДокумент
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИсходныйДокумент.Организация,
	|	ВТИсходныйДокумент.Покупатель,
	|	ВТИсходныйДокумент.Грузополучатель,
	|	ВТИсходныйДокумент.Поставщик,
	|	ВТИсходныйДокумент.Грузоотправитель,
	|	ВТИсходныйДокумент.Сумма,
	|	ВТИсходныйДокумент.Валюта,
	|	ВТИсходныйДокумент.УчитыватьНДС,
	|	ВТИсходныйДокумент.СуммаВключаетНДС
	|ИЗ
	|	ВТИсходныйДокумент КАК ВТИсходныйДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДанныеДляПечати = Новый Структура();
	
	Поставщик = Шапка.Поставщик;
	Если ЗначениеЗаполнено(Поставщик.ГоловнаяОрганизация) Тогда 
		Поставщик = Поставщик.ГоловнаяОрганизация;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Организация",       Шапка.Организация);
	ДанныеДляПечати.Вставить("Поставщик",         Поставщик);
	ДанныеДляПечати.Вставить("Валюта",			  Шапка.Валюта);
	ДанныеДляПечати.Вставить("Покупатель",        Шапка.Покупатель);
	ДанныеДляПечати.Вставить("СуммаВключаетНДС",  Шапка.СуммаВключаетНДС);
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Дата,Исправление");
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, РеквизитыСФ.Дата);
	
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Организация), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка,
	|	КорректировкаРеализацииТовары.НомерСтроки,
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	ВЫРАЗИТЬ(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеТовара,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры КАК Серия,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК НаименованиеЕдиницыИзмерения,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДСПослеИзменения,
	|	КорректировкаРеализацииТовары.СуммаНДСДоИзменения,
	|	КорректировкаРеализацииТовары.Количество КАК КоличествоПослеИзменения,
	|	КорректировкаРеализацииТовары.КоличествоДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|					ТОГДА (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) / КорректировкаРеализацииТовары.Количество
	|				ИНАЧЕ КорректировкаРеализацииТовары.Сумма / КорректировкаРеализацииТовары.Количество
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаПослеИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.КоличествоДоИзменения = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|					ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения) / КорректировкаРеализацииТовары.КоличествоДоИзменения
	|				ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения / КорректировкаРеализацииТовары.КоличествоДоИзменения
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаДоИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма
	|	КОНЕЦ КАК СтоимостьБезНДСПослеИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СтоимостьБезНДСДоИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС
	|	КОНЕЦ КАК СтоимостьСНДСПослеИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|	КОНЕЦ КАК СтоимостьСНДСДоИзменения,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС > 0
	|			ТОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС < 0
	|			ТОГДА (КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) > 0
	|						ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма > 0
	|					ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) < 0
	|						ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС)) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма < 0
	|					ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма > 0
	|						ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС) > 0
	|					ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма < 0
	|						ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС) < 0
	|					ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС)) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаСНДСУвеличение
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары,
	|	ВТИсходныйДокумент КАК ИсходныйДокумент
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ДокументОснование
	|	И (КорректировкаРеализацииТовары.Количество <> КорректировкаРеализацииТовары.КоличествоДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.Сумма <> КорректировкаРеализацииТовары.СуммаДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.СуммаНДС <> КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.Цена <> КорректировкаРеализацииТовары.ЦенаДоИзменения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	КорректировкаРеализацииУслуги.НомерСтроки,
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(КорректировкаРеализацииУслуги.Содержание КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	КорректировкаРеализацииУслуги.СтавкаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|					ТОГДА (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) / КорректировкаРеализацииУслуги.Количество
	|				ИНАЧЕ КорректировкаРеализацииУслуги.Сумма / КорректировкаРеализацииУслуги.Количество
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.КоличествоДоИзменения = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|					ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения) / КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|				ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения / КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС > 0
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС < 0
	|			ТОГДА (КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) > 0
	|						ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма > 0
	|					ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) < 0
	|						ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС)) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма < 0
	|					ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма > 0
	|						ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС) > 0
	|					ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма < 0
	|						ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС) < 0
	|					ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС)) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги,
	|	ВТИсходныйДокумент КАК ИсходныйДокумент
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка = &ДокументОснование
	|	И (КорректировкаРеализацииУслуги.Количество <> КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.Сумма <> КорректировкаРеализацииУслуги.СуммаДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.СуммаНДС <> КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.Цена <> КорректировкаРеализацииУслуги.ЦенаДоИзменения)";
	
	Если РеквизитыСФ.Исправление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоИзменения", "ДоКорректировки");
	КонецЕсли;
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		Колонка.Имя = СтрЗаменить(Колонка.Имя, "ДоКорректировки", "ДоИзменения");
	КонецЦикла;
	
	Для каждого Строчка Из ТаблицаРезультата Цикл
		Строчка.НаименованиеТовара = СокрЛП(Строчка.НаименованиеТовара) + ФормированиеПечатныхФормСервер.ПредставлениеСерий(Строчка);
	КонецЦикла;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ТаблицаРезультата); 
	
	Возврат ДанныеДляПечати;

КонецФункции	

// Процедура пересчитывает ДанныеДляПечати.ТабличнаяЧасть в рубли для договоров в у.е.
// Вызывается из процедуры «Печать»
Процедура ПерезаполнитьСуммыПоУЕвРублях(ДанныеДляПечати, ТекущееОснование, Ссылка)
	
	СтруктураШапкиДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Организация, Контрагент, ДоговорКонтрагента");
	
	СуммаВзаиморасчетов = УчетНДСФормированиеДвижений.ПолучитьСуммуВзаиморасчетов(Ссылка, ТекущееОснование, СтруктураШапкиДокумента);
	
	РасчетСуммыНДСПоСтавке = УчетНДС.РасчетНДСвРубляхПоСтавкеДокумента(ДанныеДляПечати.Дата);
	
	СтрокиСчетаФактуры = ДанныеДляПечати.ТабличнаяЧасть;
	СтрокиСчетаФактуры.Колонки.Добавить("СуммаБезНДС");
	МассивРаспределения = Новый Массив;
	Для Каждого СтрокаСчетаФактуры Из СтрокиСчетаФактуры Цикл
		СуммаСНДС = СтрокаСчетаФактуры.Сумма + ?(СтрокаСчетаФактуры.СуммаВключаетНДС, 0, СтрокаСчетаФактуры.СуммаНДС);
		СуммаБезНДС = СуммаСНДС - СтрокаСчетаФактуры.СуммаНДС;

		МассивРаспределения.Добавить(СуммаСНДС);
		СтрокаСчетаФактуры.СуммаБезНДС = СуммаБезНДС;
		
	КонецЦикла;
	
	СтрокиСчетаФактуры.Колонки.Добавить("СуммаРублевая");
	УчетНДС.РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаВзаиморасчетов, СтрокиСчетаФактуры, "СуммаРублевая");
	
	Для Каждого СтрокаСчетаФактуры Из СтрокиСчетаФактуры Цикл
		Если РасчетСуммыНДСПоСтавке Тогда
			//Выделение суммы НДС, Расчет суммы без НДС
			ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(СтрокаСчетаФактуры.СтавкаНДС);
			
			СтрокаСчетаФактуры.СуммаНДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаСчетаФактуры.СуммаРублевая * ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС),2));
			СтрокаСчетаФактуры.Сумма = СтрокаСчетаФактуры.СуммаРублевая - СтрокаСчетаФактуры.СуммаНДС;
			
		Иначе
			МассивРаспределения.Очистить();
			МассивРаспределения.Добавить(СтрокаСчетаФактуры.СуммаБезНДС);
			МассивРаспределения.Добавить(СтрокаСчетаФактуры.СуммаНДС);
			МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьПропорционально(СтрокаСчетаФактуры.СуммаРублевая, МассивРаспределения);
			Если МассивРаспределенныхСумм <> Неопределено Тогда
				СтрокаСчетаФактуры.Сумма = МассивРаспределенныхСумм[0];
				СтрокаСчетаФактуры.СуммаНДС = МассивРаспределенныхСумм[1];
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаСчетаФактуры.СуммаВключаетНДС Тогда
			СтрокаСчетаФактуры.Сумма = СтрокаСчетаФактуры.Сумма+СтрокаСчетаФактуры.СуммаНДС;
		КонецЕсли;

	КонецЦикла;
	СтрокиСчетаФактуры.Колонки.Удалить(СтрокиСчетаФактуры.Колонки.СуммаБезНДС);
	СтрокиСчетаФактуры.ЗаполнитьЗначения(0, "Цена");
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// проставляет прочерки в незаполненных полях печатной формы счета-фактуры
//
Процедура ПроставитьПрочеркиВПустыеПоля(ОбластьМакета)

	Для т = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(т);
		
		Если (Найти(ТекПараметр, "Продавец:") <> 0)
		   и (СокрЛП(ТекПараметр) = "Продавец:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Продавец: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Адрес:") <> 0)
			    и (СокрЛП(ТекПараметр) = "Адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер продавца (ИНН):") <> 0)
			    и (СокрЛП(ТекПараметр) = "Идентификационный номер продавца (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер продавца (ИНН): -");
			
		ИначеЕсли (Найти(ТекПараметр, "ИНН/КПП продавца:") <> 0)
			    и (СокрЛП(ТекПараметр) = "ИНН/КПП продавца:") Тогда
			ОбластьМакета.Параметры.Установить(т, "ИНН/КПП продавца: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузоотправитель и его адрес:") <> 0)
			    и (СокрЛП(ТекПараметр) = "Грузоотправитель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузоотправитель и его адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузополучатель и его адрес:") <> 0)
		   		и (СокрЛП(ТекПараметр) = "Грузополучатель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузополучатель и его адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "К платежно-расчетному документу №") <> 0)
		   		и (СокрЛП(ТекПараметр) = "К платежно-расчетному документу №  от") Тогда
			ОбластьМакета.Параметры.Установить(т, "К платежно-расчетному документу № -- от --");
			
		ИначеЕсли (Найти(ТекПараметр, "Покупатель:") <> 0)
		   		и (СокрЛП(ТекПараметр) = "Покупатель:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Покупатель: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер покупателя (ИНН):") <> 0)
			    и (СокрЛП(ТекПараметр) = "Идентификационный номер покупателя (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер покупателя (ИНН): --");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(т, "--");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроставитьПрочеркиВПустыеПоля()

// Финкция возвращает пустую таблицу значений под
// табличную часть документа основания.
// 
Функция ИнициализацияТаблицыСтрок()

	Товары = Новый ТаблицаЗначений();

	Товары.Колонки.Добавить("Товар");
	// <- Шевченков 20170921 #70497
	Товары.Колонки.Добавить("КодВидаТовара");
	// ->
	Товары.Колонки.Добавить("ТоварНаименование");
	Товары.Колонки.Добавить("СтранаПроисхождения");
	Товары.Колонки.Добавить("СтранаПроисхожденияКод");
	Товары.Колонки.Добавить("ПредставлениеСтраны");
	Товары.Колонки.Добавить("НомерГТД");
	Товары.Колонки.Добавить("ПредставлениеГТД");
	Товары.Колонки.Добавить("Количество");
	Товары.Колонки.Добавить("ЕдиницаИзмерения");
	Товары.Колонки.Добавить("ЕдиницаИзмеренияКод");
	Товары.Колонки.Добавить("СуммаВключаетНДС");
	Товары.Колонки.Добавить("Цена");
	Товары.Колонки.Добавить("СтавкаНДС");
	Товары.Колонки.Добавить("СуммаНДС");
	Товары.Колонки.Добавить("Сумма");

	Возврат Товары;

КонецФункции

Процедура ПечатьСчетаФактуры1137(Ссылка, ТабДокумент)

	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	мВыводитьКодТНВЭД = УчетНДС.ВыводитьКодТНВЭД(Ссылка.Дата);
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ПриНаличии",                ?(мВыводитьКодТНВЭД, "(при наличии)", ""));
	ДанныеДляПечати.Вставить("ИлиИноеУполномоченноеЛицо", ?(мВыводитьКодТНВЭД, "или иное уполномоченное лицо", ""));
	
	// <- Шевченков 40858
	попытка		
		Если ТипЗнч(Ссылка.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИндексПодразделения = Ссылка.ДокументОснование.ПР_Претензия.КП_Отделение.НомерОтделения;
			Если ЗначениеЗаполнено(ДанныеДляПечати.Организация.ГоловнаяОрганизация) Тогда
				ИндексПодразделения = ДанныеДляПечати.Организация.ЦифровойИндексОбособленногоПодразделения;
			КонецЕсли;
			Если Не ПустаяСтрока(ИндексПодразделения) Тогда
				ДанныеДляПечати.Номер = ДанныеДляПечати.Номер + "/" + ИндексПодразделения;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Ссылка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если Не ПустаяСтрока(ДанныеДляПечати.ИндексПодразделения) Тогда
				ДанныеДляПечати.Номер = СокрЛП(ДанныеДляПечати.Номер) + "/" + ДанныеДляПечати.ИндексПодразделения;
			КонецЕсли;
		КонецЕсли;
	исключение
	конецпопытки;
	// ->
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, 
		"Дата, ВидСчетаФактуры, Исправление, НомерИсправления, ДоговорКонтрагента, СчетФактураБезНДС, КППКонтрагента, СводныйКомиссионный");
	ДанныеДляПечати.Вставить("ДатаСчетФактуры", 	 	РеквизитыСФ.Дата);
	ДанныеДляПечати.Вставить("Ссылка",			 	 	Ссылка);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры", 		РеквизитыСФ.ВидСчетаФактуры);
	ДанныеДляПечати.Вставить("Исправление", 	 		РеквизитыСФ.Исправление);
	ДанныеДляПечати.Вставить("НомерИсправления", 		РеквизитыСФ.НомерИсправления);
	ДанныеДляПечати.Вставить("ДоговорКонтрагента", 		РеквизитыСФ.ДоговорКонтрагента);
	ДанныеДляПечати.Вставить("СчетФактураБезНДС", 		РеквизитыСФ.СчетФактураБезНДС);
	ДанныеДляПечати.Вставить("КППКонтрагента", 	 		РеквизитыСФ.КППКонтрагента);
	ДанныеДляПечати.Вставить("СводныйКомиссионный",     РеквизитыСФ.СводныйКомиссионный);
	ДанныеДляПечати.Вставить("ВидАгентскогоДоговора",   
	ОбщегоНазначения.ПолучитьЗначениеРеквизита(РеквизитыСФ.ДоговорКонтрагента, "ВидАгентскогоДоговора"));
	
	
	// <- Шевченков #67779  #70497
	Если мВыводитьКодТНВЭД Тогда
		ДопТекстПриложения = "(в ред. Постановлений Правительства РФ от 25.05.2017 № 625, от 19.08.2017 № 981)";
	ИначеЕсли Ссылка.Дата >= Дата('20170701') Тогда		
		ДопТекстПриложения = "(в ред. Постановлений Правительства РФ от 25.05.2017 № 625)";
	Иначе
		ДопТекстПриложения = "";
	КонецЕсли;	
	// ->
	// <- Шевченков #67779
	Если Ссылка.Дата >= Дата('20170701') Тогда
		ДанныеДляПечати.Вставить("ДопТекстПриложения", ДопТекстПриложения);		
	КонецЕсли;	
	// ->
	
	// Определяем макет
	Макет = ПолучитьОбщийМакет("СчетФактура1137");
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура1137";
			
	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);

КонецПроцедуры

Процедура ПечатьКорректировочногоСчетаФактуры1137(Ссылка, ТабДокумент) 

	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	мВыводитьКодТНВЭД = УчетНДС.ВыводитьКодТНВЭД(Ссылка.Дата);
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, 
		"Номер,Дата,
		|Исправление,НомерИсправления,
		|НомерИсправляемогоКорректировочногоДокумента,ДатаИсправляемогоКорректировочногоДокумента,
		|СчетФактураБезНДС, КППКонтрагента");
	
	ЗапросРеквизитовОснований = Новый Запрос();
	ЗапросРеквизитовОснований.Параметры.Вставить("Ссылка", Ссылка);
	ЗапросРеквизитовОснований.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента КАК НомерСчетаФактуры,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента КАК ДатаСчетаФактуры,
	|	СчетФактураВыданныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.НомерИсправленияИсходногоДокумента КАК НомерИсправления,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсправленияИсходногоДокумента КАК ДатаИсправления,
	|	МИНИМУМ(СчетФактураВыданныйДокументыОснования.НомерСтроки) КАК НомерСтроки,
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.НомерИсправленияИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсправленияИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	КорректируемыеСчетаФактуры = ЗапросРеквизитовОснований.Выполнить().Выгрузить();
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, РеквизитыСФ.Дата);
	
	СведенияОПодразделенииПокупателя = Неопределено;
	Если ТипЗнч(ДанныеДляПечати.Покупатель) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ДанныеДляПечати.Покупатель) Тогда
		РеквизитыПокупателя = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДанныеДляПечати.Покупатель, "ГоловнойКонтрагент, ОбособленноеПодразделение");
		Если РеквизитыПокупателя.ОбособленноеПодразделение И ЗначениеЗаполнено(РеквизитыПокупателя.ГоловнойКонтрагент) Тогда
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(РеквизитыПокупателя.ГоловнойКонтрагент, РеквизитыСФ.Дата);
			СведенияОПодразделенииПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);	
		КонецЕсли;
	КонецЕсли;
	
	// Определяем макет
	Если УчетНДС.ПрименяетсяПостановление952(РеквизитыСФ.Дата) Тогда
		Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура952");
	Иначе
		Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура1137");
	КонецЕсли;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_КорректировочныйСчетФактура1137";
	
	// Выводим шапку
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьКонтракт = Макет.ПолучитьОбласть("Контракт"); // Шевченков #66046
	
	ДанныеДляПечати.Вставить("ПриНаличии",                ?(мВыводитьКодТНВЭД, "(при наличии)", ""));
	ДанныеДляПечати.Вставить("ИлиИноеУполномоченноеЛицо", ?(мВыводитьКодТНВЭД, "или иное уполномоченное лицо", ""));
	
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	
	Если РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.Номер = РеквизитыСФ.НомерИсправляемогоКорректировочногоДокумента;
		ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.ДатаИсправляемогоКорректировочногоДокумента, "ДФ='дд ММММ гггг'") + " г.";
	Иначе
		ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
		ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	КонецЕсли;
		
	// <- Шевченков 40858
	Попытка
		Если ТипЗнч(Ссылка.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИндексПодразделения = Ссылка.ДокументОснование.ПР_Претензия.КП_Отделение.НомерОтделения;
			Если ЗначениеЗаполнено(ДанныеДляПечати.Организация.ГоловнаяОрганизация) Тогда
				ИндексПодразделения = ДанныеДляПечати.Организация.ЦифровойИндексОбособленногоПодразделения;
			КонецЕсли;
			Если Не ПустаяСтрока(ИндексПодразделения) И ДанныеДляПечати.Дата > '20161014' Тогда
				ОбластьМакета.Параметры.Номер = ДанныеДляПечати.Номер + "/" + ИндексПодразделения;
			КонецЕсли;
		КонецЕсли;
	исключение
	конецпопытки;
	// ->
    	
	РеквизитыОснований = "";
	Для Каждого РеквизитыСчетаФактуры Из КорректируемыеСчетаФактуры Цикл
		Если НЕ РеквизитыСчетаФактуры.УчитыватьИсправлениеИсходногоДокумента 
			ИЛИ РеквизитыСчетаФактуры.НомерИсправления = 0 Тогда
			НомерИсправленияСчетаФактуры = "--";
		Иначе
			НомерИсправленияСчетаФактуры = Формат(РеквизитыСчетаФактуры.НомерИсправления, "ЧЦ=3; ЧГ=0");
			
		КонецЕсли;
		
		// <- Шевченков 40858
		Попытка		
			Если ТипЗнч(РеквизитыСчетаФактуры.Ссылка.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				ИндексПодразделения = РеквизитыСчетаФактуры.Ссылка.ДокументОснование.ПР_Претензия.КП_Отделение.НомерОтделения;
				Если ЗначениеЗаполнено(РеквизитыСчетаФактуры.Ссылка.Организация.ГоловнаяОрганизация) Тогда
					ИндексПодразделения = ДанныеДляПечати.Организация.ЦифровойИндексОбособленногоПодразделения;
				КонецЕсли;
				Если Не ПустаяСтрока(ИндексПодразделения) Тогда
					РеквизитыСчетаФактуры.НомерСчетаФактуры = РеквизитыСчетаФактуры.НомерСчетаФактуры + "/" + ИндексПодразделения;
				КонецЕсли;
			КонецЕсли;
		исключение
		конецпопытки;		
		// -> 	
		
		РеквизитыОснований = РеквизитыОснований + ?(РеквизитыОснований = "", "", ", ") 
		+ "№ "+РеквизитыСчетаФактуры.НомерСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--")+", с учетом исправления № "
		+НомерИсправленияСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		
		// <- Шевченков 45926 20151112
		
		СТр = ПолучитьДокОснование(Ссылка);
		
		ИндексПодраздение1 = "";
		ДокОснование = СТр;
		НомерОтделения = СТр.СчетФактура.Ссылка.ДокументОснование.КП_Отделение.НомерОтделения;
		Если ТипЗнч(СТр.СчетФактура.Ссылка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И НЕ ПустаяСтрока(НомерОтделения) Тогда				
			ИндексПодраздение1 = "/" + СокрЛП(НомерОтделения);				
		КонецЕсли;
		
		РеквизитОснований1 = "№ "+СТр.НомерСчетаФактуры+ИндексПодраздение1+" от "+Формат(Стр.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--");
		
		ОбластьМакета.Параметры.РеквизитыОснований1 = "";
		ОбластьМакета.Параметры.РеквизитыОснований1 = РеквизитОснований1;
		
		//РеквизитыОснований1 = РеквизитыОснований1 + ?(РеквизитыОснований1 = "", "", ", ") 
		//+ "№ "+РеквизитыСчетаФактуры.НомерСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--")+", с учетом исправления № "
		//+НомерИсправленияСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		// ->		
		
	КонецЦикла;
	
	ОбластьМакета.Параметры.РеквизитыОснований = РеквизитыОснований;
	
	Если РеквизитыСФ.НомерИсправления = 0 
		ИЛИ НЕ РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = РеквизитыСФ.НомерИсправления;
	КонецЕсли;
	Если НЕ РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаименованиеПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПоставщике,  "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПоставщике,  "ЮридическийАдрес,");

	ОбластьМакета.Параметры.НаименованиеПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ЮридическийАдрес,");
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППродавца = ""
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
		
	Если ЗначениеЗаполнено(РеквизитыСФ.КППКонтрагента) Тогда
		КПП = РеквизитыСФ.КППКонтрагента;
	ИначеЕсли СведенияОПодразделенииПокупателя <> Неопределено Тогда
		КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПодразделенииПокупателя, "КПП,", Ложь);
	Иначе
		КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	
	ОбластьМакета.Параметры.Валюта = ?(ЗначениеЗаполнено(ДанныеДляПечати.Валюта), 
		"Валюта: наименование, код " + ДанныеДляПечати.Валюта.НаименованиеПолное + ", " + ДанныеДляПечати.Валюта.Код, 
		"Валюта: наименование, код");		
		
	// <- Шевченков #67779  #70497
	Если мВыводитьКодТНВЭД Тогда
		ОбластьМакета.Параметры.ДопТекстПриложения = "(в ред. Постановлений Правительства РФ от 25.05.2017 № 625, от 19.08.2017 № 981)";
	ИначеЕсли Ссылка.Дата >= Дата('20170701') Тогда		
		ОбластьМакета.Параметры.ДопТекстПриложения = "(в ред. Постановлений Правительства РФ от 25.05.2017 № 625)";
	Иначе
		ОбластьМакета.Параметры.ДопТекстПриложения = "";
	КонецЕсли;	
	// ->	
		
	//// <- Шевченков #67779
	//Если ДанныеДляПечати.Дата >= Дата('20170701') Тогда
	//	ОбластьМакета.Параметры.ДопТекстПриложения = "(в ред. Постановления Правительства РФ от 25.05.2017 N 625)";
	//КонецЕсли;	
	//// ->	
		
	ТабДокумент.Вывести(ОбластьМакета);
	
	// <- Шевченков #66046
	Если ДанныеДляПечати.Дата >= Дата('20170701') Тогда
		ОбластьКонтракт.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьКонтракт);
	КонецЕсли;	
	// ->
	
	//ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	// <- Шевченков 20170921 #70497
	Если мВыводитьКодТНВЭД Тогда
		ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы_ТНВЭД");
	Иначе
		ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	КонецЕсли;
	// ->
	
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

	//ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	// <- Шевченков 20170921 #70497
	Если мВыводитьКодТНВЭД Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Строка_ТНВЭД");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	КонецЕсли;
	// ->
		
	//ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
	// <- Шевченков 20170921 #70497
	Если мВыводитьКодТНВЭД Тогда
		ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого_ТНВЭД");
	Иначе
		ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
	КонецЕсли;
	// ->
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	
	КоличествоСтрок = ДанныеДляПечати.ТабличнаяЧасть.Количество();
	НомерСтроки = 0;
	
	Для каждого СтрокаТабличнойЧасти Из ДанныеДляПечати.ТабличнаяЧасть Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара;               
		Иначе
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;               
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоДоИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоПослеИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоПослеИзменения = "--";
		КонецЕсли;	
		       		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаДоИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаПослеИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаПослеИзменения = "--";
		КонецЕсли;	
		          		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСДоИзменения = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСПослеИзменения = "без НДС";
			ОбластьМакета.Параметры.РазницаНДСУвеличение = "--";
			ОбластьМакета.Параметры.РазницаНДСУменьшение = "--";
		КонецЕсли;
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
						
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
				
	КонецЦикла;	
		
		                                    
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУменьшение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУвеличение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУвеличение");
	Если РеквизитыСФ.СчетФактураБезНДС Тогда
		ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение = "без НДС";
		ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение = "без НДС";
	Иначе
		ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУменьшение");
		ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУвеличение");
	КонецЕсли;
    	
	ТабДокумент.Вывести(ОбластьМакетаИтого);
	
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);	
	ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,");
	ТабДокумент.Вывести(ОбластьМакетаПодвал);

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура283") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура283", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура84")  Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура84", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура575") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура575", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент", 
			"Универсальный передаточный документ", ПечатьУниверсальныхПередаточныхДокументов(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйКорректировочныйДокумент") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УниверсальныйКорректировочныйДокумент", 
			"Универсальный корректировочный документ", ПечатьУниверсальныхКорректировочныхДокументов(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати)

	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 13;
	ТабДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	ВыводитьКолонтитул = МассивОбъектов.Количество() = 1;
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		// <- Шевченков 48256 20160201
		ДокументОснование = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Ссылка,"ДокументОснование");
		Если Ссылка.Дата >= '20160201000000' И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") И Ссылка.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда			
			ВидСчетаФактуры = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Ссылка,"ВидСчетаФактуры");
			ВидОперации = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(ДокументОснование,"ВидОперации");
			Если (ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение 
				И ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.Корректировочный) ИЛИ 
				(ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки 
				И ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию) Тогда
				Сообщить("Указанный вид счета фактуры не соответствует виду операции документа основания");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// -> 
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Корректировочный    = Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
		ВерсияПостановления = УчетНДС.ПолучитьВерсиюПостановления(Ссылка.Дата);
		Если ВерсияПостановления = 1 Тогда
			Если Корректировочный Тогда
				ПечатьКорректировочногоСчетаФактуры(Ссылка, ТабДокумент);
			Иначе
				ПечатьСчетаФактуры914(Ссылка, ТабДокумент);
			КонецЕсли;
		Иначе
			Если Корректировочный Тогда
				ПечатьКорректировочногоСчетаФактуры1137(Ссылка, ТабДокумент);
			Иначе
				ПечатьСчетаФактуры1137(Ссылка, ТабДокумент);
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.ВерхнийКолонтитул.Выводить = ВыводитьКолонтитул;
		Если ВыводитьКолонтитул Тогда
			ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница     = 2;
			ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
			ЗаголовокДляПечати = ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка, "Счет-фактура") + " г.";
			ТабДокумент.ВерхнийКолонтитул.ТекстСлева  = ЗаголовокДляПечати;
			ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "Лист [&НомерСтраницы]";
		КонецЕсли;
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

Процедура ПечатьСчетаФактуры914(Ссылка, ТабДокумент)

	Если Ссылка.Дата < '20040216' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура575");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура575";
	ИначеЕсли Ссылка.Дата < '20060530' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура84");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура84";
	ИначеЕсли Ссылка.Дата < '20090609' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура283");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура283";
	Иначе
		Макет = ПолучитьОбщийМакет("СчетФактура451");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура451";
	КонецЕсли;

	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, Ссылка.Дата);
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, Ссылка.Дата);
	СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
		?(ДанныеДляПечати.Грузоотправитель = "он же", Неопределено, ДанныеДляПечати.Грузоотправитель), Ссылка.Дата);
	СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Грузополучатель, Ссылка.Дата);

	Если ДанныеДляПечати.Свойство("АдресДоставки") 
		И Не ПустаяСтрока(ДанныеДляПечати.АдресДоставки) Тогда
		ПредставлениеГрузополучателя = ?(Не ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), 
			ДанныеДляПечати.АдресДоставки,
			ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование") 
			+ ", " + ДанныеДляПечати.АдресДоставки);

	Иначе
		ПредставлениеГрузополучателя = ?(Не ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), 
			"",
			ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
				СведенияОГрузополучателе, "ПолноеНаименование, ФактическийАдрес,"));
	КонецЕсли;
	
	ВыборкаПоТоварам = ДанныеДляПечати.ТабличнаяЧасть.Скопировать();

	Если ВыборкаПоТоварам.Количество() > 0 Тогда
		ТолькоУслуги = Истина;
		Для Каждого СтрокаТовар Из ВыборкаПоТоварам Цикл
			Если (ТипЗнч(СтрокаТовар.Товар) = Тип("СправочникСсылка.Номенклатура")
			   И Не СтрокаТовар.Товар.Услуга)
			   ИЛИ ТипЗнч(СтрокаТовар.Товар) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				ТолькоУслуги = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТолькоУслуги = Ложь;
	КонецЕсли;

	ЗаголовокДляПечати = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДанныеДляПечати, "Счет-фактура") + " г.";
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	ОбластьМакета.Параметры.Номер = ЗаголовокДляПечати;
	
	ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре = глЗначениеПеременной("ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре");
	Если ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре <> '00010101'
		И ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре <= Ссылка.Дата 
		И Не Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " 
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,") 
			+ " (" + ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеСокращенное,") + ")";
	Иначе
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " 
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;

	ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
	
	Строка_ПоДокументу = "";
	Для Каждого ПараметрыДокументаОплаты Из ДанныеДляПечати.ТаблицаДатОплат Цикл
		Строка_ПоДокументу = Строка_ПоДокументу 
			+ ?(ПустаяСтрока(Строка_ПоДокументу), "К платежно-расчетному документу № ",", ")
			+ ПараметрыДокументаОплаты.НомерПлатежноРасчетногоДокумента 
			+ " от " + Формат(ПараметрыДокументаОплаты.ДатаПлатежноРасчетногоДокумента, "ДФ=dd.MM.yyyy");
	КонецЦикла; 
	Если ПустаяСтрока(Строка_ПоДокументу) Тогда
		Строка_ПоДокументу = "К платежно-расчетному документу № -- от --"
	КонецЕсли; 
	ОбластьМакета.Параметры.ПоДокументу = Строка_ПоДокументу;
	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
	
	Если ТолькоУслуги Тогда
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + "--";
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: "  + "--";
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " 
			+ ?(НЕ ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель), 
			"", 
			?(ДанныеДляПечати.Грузоотправитель = "он же", 
			ДанныеДляПечати.Грузоотправитель, 
			ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
				СведенияОГрузоотправителе,  "ПолноеНаименование,ФактическийАдрес,")));
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: " + ПредставлениеГрузополучателя;
	КонецЕсли;

	Если Ссылка.Дата < '20040216' Тогда
		ОбластьМакета.Параметры.ИННпоставщика = "Идентификационный номер продавца (ИНН): "
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике,  "ИНН,", Ложь); 
		ОбластьМакета.Параметры.ИННПокупателя = "Идентификационный номер покупателя (ИНН): " 
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь);
	Иначе
		КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННпоставщика = "ИНН/КПП продавца: "
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
		
		Если не ТолькоУслуги 
			и ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель) 
			и не ДанныеДляПечати.Грузополучатель = ДанныеДляПечати.Покупатель
			и ДанныеДляПечати.Грузополучатель.ГоловнойКонтрагент = ДанныеДляПечати.Покупатель
			Тогда
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "КПП,", Ложь);
			Если не ЗначениеЗаполнено(КПП) Тогда
				КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
			КонецЕсли;
		Иначе
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: "
			+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	КонецЕсли;

	ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод заголовка таблицы
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьМакетаЗаголовокТаблицы.Параметры.Заполнить(ДанныеДляПечати);
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

	// Вывод строк таблицы
	ОбластьМакета 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого 	= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");

	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;

	ВыборкаСтрокТовары = ДанныеДляПечати.ТабличнаяЧасть;
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаБезНДС");
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаСНДС");
	
	Для Каждого Строчка Из ВыборкаСтрокТовары Цикл
		
		Строчка.СуммаСНДС = Строчка.Сумма + ?(Строчка.СуммаВключаетНДС, 0, Строчка.СуммаНДС);
        Строчка.СуммаБезНДС = Строчка.СуммаСНДС - Строчка.СуммаНДС;
		
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию И 
			(Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
		 	ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
		 	ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110) Тогда
			Если (НЕ Строчка.СуммаВключаетНДС) ИЛИ Строчка.Цена = 0 Тогда
				Строчка.Цена = Окр(Строчка.СуммаСНДС / Строчка.Количество, 2);
			КонецЕсли;
		Иначе
			Если Строчка.СуммаВключаетНДС Тогда
				Строчка.Цена = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если Строчка.Цена = 0 Тогда
			Строчка.Цена = ?(Строчка.Количество = 0, 0, Строчка.СуммаБезНДС / Строчка.Количество);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаСтрокТовары.Свернуть("Товар, ТоварНаименование, СтранаПроисхождения, ПредставлениеСтраны,
		|НомерГТД, ПредставлениеГТД, ЕдиницаИзмерения, Цена, СтавкаНДС", 
		"Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаБезНДС");
		
	НомерСтроки     = 0;
	КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		
	Для Каждого Строчка Из ВыборкаСтрокТовары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(Строчка);

		Если Не ЗначениеЗаполнено(Строчка.ТоварНаименование) Тогда
			ОбластьМакета.Параметры.ТоварНаименование = Строчка.Товар;
		КонецЕсли;
		ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ОбластьМакета.Параметры.ТоварНаименование);
		
		Если Строка(Строчка.ПредставлениеСтраны) = "Россия" 
			Или Строка(Строчка.ПредставлениеСтраны) = "Российская Федерация"
			Или Строчка.СтранаПроисхождения = Справочники.КлассификаторСтранМира.РОССИЯ Тогда			
			ОбластьМакета.Параметры.ПредставлениеСтраны  = "--";
		КонецЕсли; 
	
		ОчищатьКоличество = Неопределено;
		ОчищатьКоличество = ?(ДанныеДляПечати.Свойство("ОчищатьКоличество", ОчищатьКоличество), 
			ОчищатьКоличество, Истина);
		
		Если ОчищатьКоличество И ТипЗнч(ОбластьМакета.Параметры.Товар) <> Тип("СправочникСсылка.ОсновныеСредства") 
			И (ОбластьМакета.Параметры.ЕдиницаИзмерения = "--" 
			Или Не ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения)) Тогда
			Строчка.Количество = 0;
		КонецЕсли;
		
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс 
			ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
			Или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу 
			Или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент
			Тогда
			Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
				ОбластьМакета.Параметры.Стоимость  = Строчка.СуммаБезНДС;
			Иначе
				// В счетах-фактурах на аванс колонка 5 не выводится
				ОбластьМакета.Параметры.Стоимость  = 0;
			КонецЕсли;
			ОбластьМакета.Параметры.Количество = 0;
			ОбластьМакета.Параметры.Цена       = 0;
		Иначе
			ОбластьМакета.Параметры.Стоимость  = Строчка.СуммаБезНДС;
			ОбластьМакета.Параметры.Цена   = Строчка.Цена;
		КонецЕсли;	
			
		ОбластьМакета.Параметры.Всего      = Строчка.СуммаСНДС;
		ОбластьМакета.Параметры.СтавкаНДС  = Строчка.СтавкаНДС;

		ИтогоСуммаНДС = ИтогоСуммаНДС + Строчка.СуммаНДС;
		ИтогоВсего    = ИтогоВсего    + Строчка.СуммаСНДС;

		ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
						
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	Если ВыборкаСтрокТовары.Количество()>0 Тогда
		ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	КонецЕсли; 

	// Вывод строки Итого
	ОбластьМакетаИтого.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
	ОбластьМакетаИтого.Параметры.ИтогоВсего    = ИтогоВСего;
	
	ПроставитьПрочеркиВПустыеПоля(ОбластьМакетаИтого);
	ТабДокумент.Вывести(ОбластьМакетаИтого);

	// Вывод подвала
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);
	Если не Ссылка.Дата < '20040216' Тогда
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
			ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
				СведенияОПокупателе, "Свидетельство,");
		Иначе
			ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
				СведенияОПоставщике, "Свидетельство,");
		КонецЕсли;
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);

КонецПроцедуры

Процедура ПечатьКорректировочногоСчетаФактуры(Ссылка, ТабДокумент)

	Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура");
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_КорректировочныйСчетФактура";

	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер,
	|	СчетФактураВыданный.Дата,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента, """") КАК НомерИсходногоДокумента,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента, """") КАК ДатаИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО СчетФактураВыданный.Ссылка = СчетФактураВыданныйДокументыОснования.Ссылка
	|			И (СчетФактураВыданныйДокументыОснования.НомерСтроки = 1)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	РеквизитыСФ = Новый Структура("Номер,Дата,НомерИсходногоДокумента,ДатаИсходногоДокумента");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСФ, Выборка);
	КонецЕсли;
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, РеквизитыСФ.Дата);
	
	// Выводим шапку
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	
	ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
	ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	
	ОбластьМакета.Параметры.НомерСчетаФактуры = РеквизитыСФ.НомерИсходногоДокумента;
	ОбластьМакета.Параметры.ДатаСчетаФактуры  = Формат(РеквизитыСФ.ДатаИсходногоДокумента, "ДФ='дд ММММ гггг'") + " г.";
	
	ОбластьМакета.Параметры.НаименованиеПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПоставщике,  "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПоставщике,  "ЮридическийАдрес,");

	ОбластьМакета.Параметры.НаименованиеПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ЮридическийАдрес,");
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППродавца = ""
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод заголовка таблицы
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

	// Вывод строк таблицы
	ОбластьМакета 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого 	= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	НомерСтроки     = 0;
	КоличествоСтрок = ДанныеДляПечати.ТабличнаяЧасть.Количество();
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеДляПечати.ТабличнаяЧасть Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара;               
		Иначе
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;               
		КонецЕсли;	
		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "Без налога (НДС)";
		КонецЕсли;
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
						
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;	
	
	// Вывод строки Итого
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУменьшение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУвеличение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение    = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение    = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУвеличение");
    	
	ТабДокумент.Вывести(ОбластьМакетаИтого);
	
	//Вывод подвала
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);
	ТабДокумент.Вывести(ОбластьМакетаПодвал);

КонецПроцедуры

Функция ПечатьУниверсальногоКорректировочногоДокумента(ДанныеДляПечати, ТабДокумент = Неопределено) Экспорт
	
	Таблица = ДанныеДляПечати.ТабличнаяЧасть;
	
	СуммаУменьшения = Таблица.Итог("РазницаБезНДСУменьшение") + Таблица.Итог("РазницаСНДСУменьшение") + Таблица.Итог("РазницаНДСУменьшение");
	СуммаУвеличения = Таблица.Итог("РазницаБезНДСУвеличение") + Таблица.Итог("РазницаСНДСУвеличение") + Таблица.Итог("РазницаНДСУвеличение");
	
	Если СуммаУменьшения = 0 И СуммаУвеличения = 0 Тогда
		ТекстСообщения = "Печать универсального корректировочного документа без изменения суммовых показателей не возможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда		
		ТабДокумент = Новый ТабличныйДокумент;
		
		// Устанавливаем параметры печати и колонтитулы
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху = 12;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент";
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("УниверсальныйКорректировочныйДокумент");
	
	УчетНДС.ВывестиКорректировочныйСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	УчетНДС.ВывестиПодвалУниверсальногоКорректировочногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	Возврат ТабДокумент;

КонецФункции

// Процедура формирует печатную форму универсального передаточного документа
//
Процедура ПечатьУниверсальногоПередаточногоДокумента(ДанныеДляПечати, ТабДокумент) Экспорт

	Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");

	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	УчетНДС.ВывестиПодвалУниверсальногоПередаточногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
		
КонецПроцедуры

Функция ПечатьУниверсальныхКорректировочныхДокументов(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Устанавливаем параметры печати и колонтитулы
	ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху 			= 12;
	ТабДокумент.ПолеСлева  			= 0;
	ТабДокумент.ПолеСнизу  			= 0;
	ТабДокумент.ПолеСправа 			= 0;
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент";
	
	ПервыйДокумент 		  = Истина;
	ВыводитьКолонтитул 	  = МассивОбъектов.Количество() = 1;
	НапечатеноДокументов  = 0;
	ТекстСообщения		  = "";
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
				
		РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "ПометкаУдаления, Дата, ВидСчетаФактуры");		
		
		Если РеквизитыСФ.Дата < '20130101' Тогда
			ТекстСообщения = "Применение формы универсального корректировочного документа возможно только с 01 января 2013 года";
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ПометкаУдаления Тогда
			ТекстСообщения = "Форма универсального корректировочного документа не предназначена для помеченных на удаление документов";
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
			ТекстСообщения = "Форма универсального корректировочного документа применяется только для корректировочных счетов-фактур";
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокумента(Ссылка);
		
		Если ДанныеДляПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;		

		ПечатьУниверсальногоКорректировочногоДокумента(ДанныеДляПечати,ТабДокумент);
		
		ТабДокумент.ВерхнийКолонтитул.Выводить = ВыводитьКолонтитул;
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
		НапечатеноДокументов = НапечатеноДокументов + 1;
		
	КонецЦикла;
	
	Если НапечатеноДокументов = 0 Тогда
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
		ОбластьМакета = Макет.ПолучитьОбласть("Ошибка");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьУниверсальныхПередаточныхДокументов(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Устанавливаем параметры печати и колонтитулы
	ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху 			= 12;
	ТабДокумент.ПолеСлева  			= 0;
	ТабДокумент.ПолеСнизу  			= 0;
	ТабДокумент.ПолеСправа 			= 0;
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	ПервыйДокумент 		  = Истина;
	ВыводитьКолонтитул 	  = МассивОбъектов.Количество() = 1;
	НапечатеноДокументов  = 0;
	ТекстСообщения		  = "";
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Ссылка, ПометкаУдаления, Дата, ВидСчетаФактуры, 
			|Исправление, НомерИсправления,	ДоговорКонтрагента, СчетФактураБезНДС, ДокументОснование, КППКонтрагента");
			
		Если РеквизитыСФ.Дата < '20130101' Тогда
			ТекстСообщения = НСтр("ru = 'Применение формы универсального передаточного документа возможно только с 01 января 2013 года'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ПометкаУдаления Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не предназначена для помеченных на удаление документов'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется для счетов-фактур на аванс";
			Продолжить;
		КонецЕсли;

		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при исполнении обязанностей налогового агента";
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не применяется для корректировочных счетов-фактур'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не применяется для счетов-фактур на суммовые разницы'");
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(РеквизитыСФ);
		Если ДанныеДляПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПечатьУниверсальногоПередаточногоДокумента(ДанныеДляПечати, ТабДокумент);
		
		ТабДокумент.ВерхнийКолонтитул.Выводить = ВыводитьКолонтитул;
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
		НапечатеноДокументов = НапечатеноДокументов + 1;
		
	КонецЦикла;
	
	Если НапечатеноДокументов = 0 Тогда
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
		ОбластьМакета = Макет.ПолучитьОбласть("Ошибка");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

// Процедура возвращает общие данные для печати универсального корректировочного документа
// по всем документам-основаниям
// 
Функция ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокумента(СчетФактура) Экспорт
	
	ДанныеДляПечати = ПодготовитьОбщиеДанныеДляПечатиКорректировочногоСчетаФактуры(СчетФактура,Истина);
	Если ДанныеДляПечати = Неопределено Тогда
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Основание", Строка(СчетФактура.ДоговорКонтрагента));
	ДанныеДляПечати.Вставить("СтатусУКД", 1);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

// Процедура возвращает общие данные для печати универсального передаточного документа
// по всем документам-основаниям
// 
Функция ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(ДанныеСчетФактуры) Экспорт
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
 	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(ДанныеСчетФактуры.Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат Неопределено;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ДатаСчетФактуры",			ДанныеСчетФактуры.Дата);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры", 		ДанныеСчетФактуры.ВидСчетаФактуры);
	ДанныеДляПечати.Вставить("Исправление", 	 		ДанныеСчетФактуры.Исправление);
	ДанныеДляПечати.Вставить("НомерИсправления", 		ДанныеСчетФактуры.НомерИсправления);
	ДанныеДляПечати.Вставить("ДоговорКонтрагента", 		ДанныеСчетФактуры.ДоговорКонтрагента);
	ДанныеДляПечати.Вставить("СчетФактураБезНДС", 		ДанныеСчетФактуры.СчетФактураБезНДС);
	ДанныеДляПечати.Вставить("КППКонтрагента", 	 		ДанныеСчетФактуры.КППКонтрагента);
	ДанныеДляПечати.Вставить("ДокументОснование", 	 	ДанныеСчетФактуры.ДокументОснование);
	ДанныеДляПечати.Вставить("ВидАгентскогоДоговора",   
		ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДанныеСчетФактуры.ДоговорКонтрагента, "ВидАгентскогоДоговора"));
	
	УчетНДС.СформироватьФИОКладовщикаДляПечатиУниверсальногоПередаточногоДокумента(ДанныеДляПечати);
	
	ТипОснования = ТипЗнч(ДанныеДляПечати.ДокументОснование);
	Если ДанныеСчетФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
		
		ТекстСообщения = "";
		
		Если ТипОснования = Тип("ДокументСсылка.НачислениеНДСпоСМРхозспособом") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при начисления НДС по СМР";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется для документа ""Отражение начисления НДС""";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при оформлении счетов-фактур по отчетам комиссионеров о продажах";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("СтатусУПД", 				1);
	
	Основание = Строка(ДанныеСчетФактуры.ДоговорКонтрагента);
	Если ДанныеСчетФактуры.Свойство("Доверенность") И ЗначениеЗаполнено(ДанныеСчетФактуры.Доверенность) Тогда
		ДанныеДляПечати.Вставить("Основание", Основание + ?(ПустаяСтрока(Основание), "", "; ") + ДанныеСчетФактуры.Доверенность);
	Иначе
		ДанныеДляПечати.Вставить("Основание", Основание);
	КонецЕсли;
	
	// Дата совершения факта хозяйственной жизни. Не может быть ранее даты составления УПД.
	ДанныеДляПечати.Вставить("ДатаОтгрузкиПередачи", 	ДанныеСчетФактуры.Дата);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

// Процедура возвращает общие данные для печати счета фактуры
// по всем документам-основаниям
// 
Функция ПодготовитьОбщиеДанныеДляПечатиКорректировочногоСчетаФактуры(СчетФактура,ЭтоПечатьУКД = Ложь)
	
	СписокОснований = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(СчетФактура.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"),Истина);
	
	ОбщиеДанныеДляПечати = Неопределено;
	
	ДанныеСчетаФактуры = Новый Структура();
	ДанныеСчетаФактуры.Вставить("Ссылка", 							СчетФактура.Ссылка);
	ДанныеСчетаФактуры.Вставить("Номер",  							ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура));
	ДанныеСчетаФактуры.Вставить("Дата",   							СчетФактура.Дата);
	ДанныеСчетаФактуры.Вставить("Организация",   					СчетФактура.Организация);
	ДанныеСчетаФактуры.Вставить("Контрагент",   					СчетФактура.Контрагент);
	ДанныеСчетаФактуры.Вставить("ДоговорКонтрагента",               СчетФактура.ДоговорКонтрагента);
	ДанныеСчетаФактуры.Вставить("ВидСчетаФактуры",                  СчетФактура.ВидСчетаФактуры);
	ДанныеСчетаФактуры.Вставить("Исправление",                      СчетФактура.Исправление);
	ДанныеСчетаФактуры.Вставить("НомерИсправления",                 СчетФактура.НомерИсправления);
	ДанныеСчетаФактуры.Вставить("НомерИсправляемогоКорректировочногоДокумента", СчетФактура.НомерИсправляемогоКорректировочногоДокумента);
	ДанныеСчетаФактуры.Вставить("ДатаИсправляемогоКорректировочногоДокумента",  СчетФактура.ДатаИсправляемогоКорректировочногоДокумента);
	ДанныеСчетаФактуры.Вставить("Продавец",                         СчетФактура.Контрагент);
	ДанныеСчетаФактуры.Вставить("КППКонтрагента",                   СчетФактура.КППКонтрагента);
	ДанныеСчетаФактуры.Вставить("СчетФактураБезНДС",                СчетФактура.СчетФактураБезНДС);
	ДанныеСчетаФактуры.Вставить("ДатаСчетФактуры",					СчетФактура.Дата);
	
	Для каждого ТекущееОснование из СписокОснований Цикл
		Если Не ЗначениеЗаполнено(ТекущееОснование) Тогда
			//Предупреждение("Не выбран документ-основание для данного счета-фактуры!");
			Продолжить;
		КонецЕсли; 
		
		ТипОснования = ТипЗнч(ТекущееОснование);
		ДанныеДляПечати = Неопределено;
		
		Если ТипОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ДанныеДляПечати = УчетНДС.СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(ТекущееОснование, ДанныеСчетаФактуры.Ссылка);
		КонецЕсли;
		
		Если ДанныеДляПечати = Неопределено или ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщиеДанныеДляПечати = Неопределено Тогда
			ОбщиеДанныеДляПечати = ДанныеДляПечати;
		Иначе
			Для Каждого СтрДанных Из ДанныеДляПечати Цикл
				
				Если СтрДанных.Ключ = "ТабличнаяЧасть" Тогда
					ОбщаяТабЧасть = ОбщиеДанныеДляПечати.ТабличнаяЧасть;
					ТекущаяТабЧасть = СтрДанных.Значение;
					
					Для Каждого СтрокаТекущейТабЧасть Из ТекущаяТабЧасть Цикл
						СтрокаТабЧасти = ОбщаяТабЧасть.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТекущейТабЧасть);
					КонецЦикла;
				Иначе
					Если Не ОбщиеДанныеДляПечати.Свойство(СтрДанных.Ключ) Тогда
						// Если данный параметр для печати шапки документа еще не  определен - то определяем его
						ОбщиеДанныеДляПечати.Вставить(СтрДанных.Ключ, СтрДанных.Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщиеДанныеДляПечати <> Неопределено Тогда
		
		КорректируемыеСчетаФактуры = Новый ТаблицаЗначений;
		КорректируемыеСчетаФактуры.Колонки.Добавить("НомерСчетаФактуры");
		КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаСчетаФактуры");
		КорректируемыеСчетаФактуры.Колонки.Добавить("УчитыватьИсправлениеИсходногоДокумента");
		КорректируемыеСчетаФактуры.Колонки.Добавить("НомерИсправления");
		КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаИсправления");
		
		
		РеквизитыПередаточныхДокументов = ""; 
		
		Для Каждого ТекущееОснование ИЗ СчетФактура.ДокументыОснования Цикл
			РеквизитыСчетаФактуры = КорректируемыеСчетаФактуры.Добавить();
			РеквизитыСчетаФактуры.НомерСчетаФактуры = ТекущееОснование.НомерИсходногоДокумента;
			РеквизитыСчетаФактуры.ДатаСчетаФактуры  = ТекущееОснование.ДатаИсходногоДокумента;
			РеквизитыСчетаФактуры.УчитыватьИсправлениеИсходногоДокумента = ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента;
			РеквизитыСчетаФактуры.НомерИсправления  = ?(ТекущееОснование.НомерИсправленияИсходногоДокумента = 0 ИЛИ НЕ ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента,
														"--", ТекущееОснование.НомерИсправленияИсходногоДокумента);
			РеквизитыСчетаФактуры.ДатаИсправления   = ?(Не ЗначениеЗаполнено(ТекущееОснование.ДатаИсправленияИсходногоДокумента) ИЛИ НЕ ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента,
														'00010101', ТекущееОснование.ДатаИсправленияИсходногоДокумента);
			ИсправляемыйДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(ТекущееОснование.ДокументОснование, Истина);
			РеквизитыПередаточныхДокументов = РеквизитыПередаточныхДокументов + ?(РеквизитыПередаточныхДокументов = "", "", ", ")
				+ ?(ЭтоПечатьУКД,"Универсальный передаточный документ " + НалоговыйУчетУСН.РеквизитыПервичногоДокумента(ИсправляемыйДокументРеализации),
							НалоговыйУчетУСН.РеквизитыПервичногоДокумента(ИсправляемыйДокументРеализации,,,Истина));
		КонецЦикла;
		
		ДанныеДляПечати.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов);
		
		КорректируемыеСчетаФактуры.Свернуть("НомерСчетаФактуры, ДатаСчетаФактуры, УчитыватьИсправлениеИсходногоДокумента, НомерИсправления, ДатаИсправления");
		ОбщиеДанныеДляПечати.Вставить("КорректируемыеСчетаФактуры", КорректируемыеСчетаФактуры);
		
		Если ЗначениеЗаполнено(СчетФактура.Руководитель) Тогда
			Если ОбщиеДанныеДляПечати.Свойство("ФИОРуководителя") Тогда 
				ОбщиеДанныеДляПечати.ФИОРуководителя = ОбщегоНазначения.ФамилияИнициалыФизЛица(СчетФактура.Руководитель);
			ИначеЕсли ОбщиеДанныеДляПечати.Свойство("ФИОПБОЮЛ") Тогда
				ОбщиеДанныеДляПечати.ФИОПБОЮЛ = ОбщегоНазначения.ФамилияИнициалыФизЛица(СчетФактура.Руководитель);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СчетФактура.ГлавныйБухгалтер) И ОбщиеДанныеДляПечати.Свойство("ФИОГлавногоБухгалтера") Тогда
			ОбщиеДанныеДляПечати.ФИОГлавногоБухгалтера = ОбщегоНазначения.ФамилияИнициалыФизЛица(СчетФактура.ГлавныйБухгалтер);
		КонецЕсли;
		
		ОбщиеДанныеДляПечати.Вставить("КППКонтрагента",  	СчетФактура.КППКонтрагента);
		
		КолонкиГруппировок = ""
		+"Номенклатура,"
		+"ТоварКод,"
		+"ТоварАртикул,"
		+"НаименованиеТовара,"
		+"НаименованиеЕдиницыИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЦенаДоИзменения,"	
		+"ЦенаПослеИзменения,"
		+"СтавкаНДС,"
		+"СуммаВключаетНДС";
		
		КолонкиСуммирования = ""
		+"СуммаНДСДоИзменения,"
		+"СуммаНДСПослеИзменения,"
		+"СтоимостьСНДСДоИзменения,"
		+"СтоимостьСНДСПослеИзменения,"
		+"РазницаБезНДСУвеличение,"
		+"РазницаБезНДСУменьшение,"
		+"РазницаНДСУвеличение,"
		+"РазницаНДСУменьшение,"
		+"РазницаСНДСУвеличение,"
		+"РазницаСНДСУменьшение,"
		+"СтоимостьБезНДСДоИзменения,"
		+"СтоимостьБезНДСПослеИзменения,"
		+"КоличествоДоИзменения,"
		+"КоличествоПослеИзменения";
		
		ОбщиеДанныеДляПечати.ТабличнаяЧасть.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		
		ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 0));
		НомерСтроки = 0;
		Для Каждого Строчка Из ОбщиеДанныеДляПечати.ТабличнаяЧасть Цикл
			НомерСтроки = НомерСтроки + 1;
			Строчка.НомерСтроки = НомерСтроки;
		КонецЦикла;		
		
		// заполнение колонок код и артикул
		ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить Тогда
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.ЗаполнитьЗначения("", "ТоварКод");
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварКод");
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.ТоварАртикул.Имя = "ТоварКод";
		Иначе
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");
		КонецЕсли;
		
		ОбщиеДанныеДляПечати.Вставить("ДокументыОснования", СписокОснований);
		
	КонецЕсли;
	
	Возврат ОбщиеДанныеДляПечати;

КонецФункции

//Функция возвращает данные номеров документов оплаты для формирования движений по РН НДСЗаписиКнигиПродаж
//
Функция СформироватьТаблицуНомеровДокументовОплаты(СтруктураПараметров) Экспорт
	
	Если УчетНДС.ВерсияПостановленияНДС1137(СтруктураПараметров.Период) <> 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НДСНачисленный.Организация,
	|	НДСНачисленный.СчетФактура,
	|	НДСНачисленный.Покупатель,
	|	&Ссылка КАК СчетФактураДокумент,
	|	НДСНачисленный.СтавкаНДС,
	|	НДСНачисленный.ВидЦенности,
	|	НДСНачисленный.ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПредварительная
	|ИЗ
	|	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|ГДЕ
	|	НДСНачисленный.СчетФактура = &ДокументОснование
	|	И НДСНачисленный.Активность
	|	И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленный.Организация,
	|	НДСНачисленный.СчетФактура,
	|	НДСНачисленный.Покупатель,
	|	НДСНачисленный.СчетФактура,
	|	НДСНачисленный.СтавкаНДС,
	|	НДСНачисленный.ВидЦенности,
	|	НДСНачисленный.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|ГДЕ
	|	НДСНачисленный.СчетФактура = &Ссылка
	|	И НДСНачисленный.Активность
	|	И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ЗаписиКнигиПродажПредварительная.Организация,
	|	ВТ_ЗаписиКнигиПродажПредварительная.СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПредварительная.Покупатель,
	|	ВТ_ЗаписиКнигиПродажПредварительная.СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПредварительная.СтавкаНДС,
	|	ВТ_ЗаписиКнигиПродажПредварительная.ВидЦенности,
	|	ВТ_ЗаписиКнигиПродажПредварительная.ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродаж
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПредварительная КАК ВТ_ЗаписиКнигиПродажПредварительная
	|ГДЕ
	|	ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента КАК ДатаДокументаОплаты,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента КАК НомерДокументаОплаты,
	|	ВТ_ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ВТ_ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	&Период КАК Период,
	|	ВТ_ЗаписиКнигиПродаж.Покупатель КАК Покупатель,
	|	ВТ_ЗаписиКнигиПродаж.СтавкаНДС,
	|	ВТ_ЗаписиКнигиПродаж.ВидЦенности,
	|	ВТ_ЗаписиКнигиПродаж.ДоговорКонтрагента
	|ИЗ
	|	ВТ_ЗаписиКнигиПродаж КАК ВТ_ЗаписиКнигиПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДатаНомерДокументовОплаты КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|		ПО ВТ_ЗаписиКнигиПродаж.СчетФактураДокумент = СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка
	|ГДЕ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка = &Ссылка
	|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)";
	
	
	Если СтруктураПараметров.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ СтруктураПараметров.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
									"ГДЕ
									|	ИСТИНА",
									"ГДЕ
									|	ВТ_ЗаписиКнигиПродажПредварительная.ДоговорКонтрагента = &ДоговорКонтрагента");
		Запрос.УстановитьПараметр("ДоговорКонтрагента",СтруктураПараметров.ДоговорКонтрагента);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.Ссылка);
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.Период);
	Запрос.УстановитьПараметр("ДокументОснование", СтруктураПараметров.ДокументОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Обработчик обновления
//
// Устанавливает новый код вида операции для сводных счетов-фактур по комиссии
Процедура УстановитьКодВидаОперацииСводныйКомиссионный() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура КАК СчетФактура,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_СводныеСгенерированныеПредварительная
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомиссионераОПродажахПокупатели.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СводныеСгенерированныеПредварительная.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СводныеСгенерированные
	|ИЗ
	|	ВТ_СводныеСгенерированныеПредварительная КАК ВТ_СводныеСгенерированныеПредварительная
	|ГДЕ
	|	ВТ_СводныеСгенерированныеПредварительная.Количество > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	""27"" КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.КодВидаОперации = ""27""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодУстановлен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	(СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|			ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный))
	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураВыданный.СводныйКомиссионный = ИСТИНА
	|	И СчетФактураВыданный.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СводныеСгенерированные.СчетФактура
	|			ИЗ
	|				ВТ_СводныеСгенерированные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	""28"",
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.КодВидаОперации = ""28""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	(СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|			ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента))
	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураВыданный.СводныйКомиссионный = ИСТИНА
	|ИТОГИ
	|	СУММА(КодУстановлен)
	|ПО
	|	ОБЩИЕ";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий()
		И ВыборкаИтоги.КодУстановлен = 0 Тогда
		ВыборкаДокументы = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДокументы.Следующий() Цикл
			СчетФактураДокумент = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			СчетФактураДокумент.КодВидаОПерации = ВыборкаДокументы.КодВидаОперации;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

//начало изменений БП 04
Функция СобратьДанныеПоТребованиюНакладной(ДокОснование, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Запрос.УстановитьПараметр("ВидСвязиОрг", Перечисления.ВидыСобственныхКонтрагентов.Организация);

	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетФактураВыданный.Организация,
	               |	СчетФактураВыданный.Организация КАК Поставщик,
	               |	Константы.ВалютаРегламентированногоУчета КАК ВалютаДокумента,
	               |	ИСТИНА КАК УчитыватьНДС,
	               |	ЛОЖЬ КАК СуммаВключаетНДС,
	               |	СчетФактураВыданный.Контрагент КАК Покупатель
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный,
	               |	Константы КАК Константы
	               |ГДЕ
	               |	СчетФактураВыданный.Ссылка = &ДокументОснование";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос.Текст = "ВЫБРАТЬ
	               |	НДСНачисленный.Номенклатура КАК Товар,
	               |	ВЫРАЗИТЬ(НДСНачисленный.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	               |	НДСНачисленный.СуммаБезНДС КАК Сумма,
	               |	НДСНачисленный.СтавкаНДС,
	               |	НДСНачисленный.НДС КАК СуммаНДС,
	               |	НДСНачисленный.ПРГ_Количество КАК Количество,
	               |	НДСНачисленный.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	               |	НДСНачисленный.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	               |	НДСНачисленный.СуммаБезНДС / ВЫБОР
	               |		КОГДА НДСНачисленный.ПРГ_Количество = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ НДСНачисленный.ПРГ_Количество
	               |	КОНЕЦ КАК Цена
	               |ИЗ
	               |	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	               |ГДЕ
	               |	НДСНачисленный.Регистратор = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НДСНачисленный.НомерСтроки";
				   
	Запрос.УстановитьПараметр("ДокументОснование",ДокОснование);				   
	РезультатЗапросаТовары = Запрос.Выполнить();
	

	ДанныеДляПечати = Новый Структура();
	ДанныеДляПечати.Вставить("Организация",      Шапка.Организация);
	ДанныеДляПечати.Вставить("Номер",            Ссылка.Номер);
	ДанныеДляПечати.Вставить("Дата",             Ссылка.Дата);
	ДанныеДляПечати.Вставить("НомерПРД",         "");
	ДанныеДляПечати.Вставить("ДатаПРД",          "");
	ДанныеДляПечати.Вставить("Поставщик",        Шапка.Поставщик);
	ДанныеДляПечати.Вставить("Грузоотправитель", );
	ДанныеДляПечати.Вставить("Подразделение",    "");
	ДанныеДляПечати.Вставить("Покупатель",       ?(НЕ ЗначениеЗаполнено(Шапка.Покупатель), Шапка.Организация, Шапка.Покупатель));
	ДанныеДляПечати.Вставить("Грузополучатель",  );
	ДанныеДляПечати.Вставить("Валюта",           Шапка.ВалютаДокумента);
	ДанныеДляПечати.Вставить("УчитыватьНДС",     Шапка.УчитыватьНДС);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Организация, Ссылка.Дата,);
	ДанныеДляПечати.Вставить(?(РегламентированнаяОтчетность.ЭтоПБОЮЛ(Шапка.Поставщик), "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);

	Товары = ИнициализацияТаблицыСтрок();

	ВыборкаСтрокТовары = РезультатЗапросаТовары.Выбрать();
	
	Если ВыборкаСтрокТовары.Количество() = 0 Тогда
		ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Строчка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строчка, ВыборкаСтрокТовары);
		//Строчка.ТоварНаименование   = "Строительно-монтажные работы для собственного потребления: " + ВыборкаСтрокТовары.ТоварНаименование;
		Строчка.СуммаВключаетНДС	= Шапка.СуммаВключаетНДС;
	КонецЦикла;

	ДанныеДляПечати.Вставить("ТабличнаяЧасть", Товары);

	Возврат ДанныеДляПечати;

КонецФункции // СобратьДанныеПоМодернизацияОС()


//конец изменений БП 04 

// <- Шевченков 45487 20151030
Функция ПолучитьДокОснование(ТекДок)
	
	Если ЗначениеЗаполнено(ТекДок) Тогда
		ДокументОснование = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(ТекДок,"ДокументОснование");
		Пока ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
			ДокументРеализация = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(ДокументОснование,"ДокументРеализации");
            СтруктураСФ = УчетНДС.ПолучитьРеквизитыСчетаФактурыВыданного(ДокументРеализация);
			// Не удалось определить СФ
			Если ЗначениеЗаполнено(СтруктураСФ) Тогда
				СФ = СтруктураСФ.СчетФактура;			
				ДокументОснование = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(СФ,"ДокументОснование");
			Иначе
				// Если это корректировка реализации без СФ
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					ДокументОснование = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(ДокументРеализация,"ДокументРеализации");
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СтруктураСФ = УчетНДС.ПолучитьРеквизитыСчетаФактурыВыданного(ДокументОснование);
			Возврат СтруктураСФ;
		КонецЕсли;		
	КонецЕсли;	
	Возврат Неопределено;
	
КонецФункции
// ->

// Обработчик обновления. Заполняет новый реквизит "КодВидаОперацииНаУменьшение" 
// для корректировочных счетов-фактур дата которых больше или равна 1 января 2015 года
Процедура УстановитьКодВидаОперацииНаУменьшение() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|	И СчетФактураВыданный.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|	И СчетФактураВыданный.КодВидаОперацииНаУменьшение = """"";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбрабатываемыйСчетФактура = Выборка.Ссылка;
			СчетФактураДокумент = ОбрабатываемыйСчетФактура.ПолучитьОбъект();
			
			СчетФактураДокумент.КодВидаОперацииНаУменьшение = "18";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры