//m.ionov@a-prof.ru 26/11/2013
//Добавили реквизит  Спецификация тип ДокументСсылка.УсловияПоставокПоДоговорам
//Вынесли его на форму списка и выбора
//Заполняется в ручную пользователем или при вводе на основании заказа поставщику
//Цены берутся из указанной спецификации, если она указана 

//m.ionov@a-prof.ru 18.12.2013
//На закладку "Дополнительно" добавил а/м. Добавил на форму списка и выбора

//m.ionov@a-prof.ru 27.12.2013
//Добавил "Дата и время пребытия".

//m.ionov@a-prof.ru 03.01.2014
//ДОбавил "Дата и время окончания разгрузки"

//Вынес на форму (и форма списка и выбора)
//---  m.ionov@a-prof.ru

//m.ionov@a-prof.ru 19.02.2014
//Добавлен вид операции - Поступление услуг по счетам-фактурам
//В табличную часть Услуги добавлен "ДоговорКонтрагента"

//m_ionov@mail.ru 23.09.2016
//Перенес из формы документа
Перем ПРГ_ИспользоватьКолонкиПоНакл Экспорт;
//------- m_ionov@mail.ru -------

//В табличную часть Услуги добавлено НомерСФ, ДатаСФ, Счет Фактура - для возможности построчного создания счет фактур
Перем мУдалятьДвижения;

Перем мИспользоватьТару Экспорт;
Перем мВалютаРегламентированногоУчета Экспорт;
Перем КодОперацииПартииТоваров;
Перем УчетнаяПолитикаРегл;
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мУказаниеПроектовВТабличнойЧастиДокументов Экспорт;

Перем мСтруктураПараметровВзаиморасчетов Экспорт;

Перем мУказаниеСкладовВТЧ Экспорт;

// Хранит структуру, содержащую параметры для определения договора, доступного в данном документе:
//    список допустимых видов договоров;
//    список допустимых способов ведения взаиморасчетов.
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

//начало изменений
Перем мСтруктураПараметровВзаиморасчетовНДФЛ;
//конец изменений 


/// Кунов О.В., 06.11.2014 - 
Перем мТабличнаяЧастьМодифицирована Экспорт;
///
//начало изменений Ожиганов проведение с 0 количество   
Перем ПРГ_ДоступенСтатусДокумента;
Перем ПРГ_СчитатьОтКоличестваНакладной;
//конец изменений 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция осуществляет печать этикеток для позиций ТЧ
//
// Параметры
//  Нет
//
Процедура ПечататьЭтикетки()

	УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка);

КонецПроцедуры // ПечататьЭтикетки()

// Функция печатает ценники.
//
Функция ПечатьЦенников()

	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК Печать,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	0 КАК Цена,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Док
	|");

	Запрос.УстановитьПараметр("Док", Ссылка);

	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаполнитьЦены", Истина);

	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Параметр = СтруктураПараметров;
	ФормаПечатьЦенников.Открыть();

КонецФункции // ПечатьЦенников()

// Функция формирует табличный документ унифицированной формы ОС-14
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ по форме ОС-14 (приходный ордер).
//
Функция ПечатьОС14(ПечатьПоДаннымУпрУчета = Истина)
	
	Макет       = ПолучитьМакет("ОС14");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_ОС14";
	
	Если ПечатьПоДаннымУпрУчета тогда
		ВалютаПечати = глЗначениеПеременной("ВалютаУправленческогоУчета");
	Иначе
		ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;	
	
	СтруктураВалютыПечати = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПечати, Дата);
	КурсВалютыПечати	  = СтруктураВалютыПечати.Курс;
	КратностьВалютыПечати = СтруктураВалютыПечати.Кратность;
	
	СтруктураВалютыДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	КурсВалютыДокумента		 = СтруктураВалютыДокумента.Курс;
	КратностьВалютыДокумента = СтруктураВалютыДокумента.Кратность;
	
	Коэф1 = КурсВалютыПечати * КратностьВалютыДокумента;
	
	Если Коэф1<>0 тогда
		КоэффициентПересчетаВалюты = (КурсВалютыДокумента * КратностьВалютыПечати) / (Коэф1);
	Иначе
		КоэффициентПересчетаВалюты = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"                    , Ссылка);
	Запрос.УстановитьПараметр("Телефон"                 , Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТелефонОрганизации"   	, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	Запрос.УстановитьПараметр("ТелефонКонтрагента"   	, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Запрос.УстановитьПараметр("ПустойБанковскийСчет" 	, Справочники.БанковскиеСчета.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Дата КАК ДатаДокумента,
	|	ПоступлениеТоваровУслуг.Номер КАК НомерДокумента,
	|	ПоступлениеТоваровУслуг.Организация КАК ОрганизацияПолучатель,
	|	ПоступлениеТоваровУслуг.СкладОрдер КАК МестоПриема,
	|	ПоступлениеТоваровУслуг.СкладОрдер.Представление КАК МестоПриемаНаименование,
	|	ВЫБОР КОГДА ТелефонОрганизации.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонОрганизации.Представление КОНЕЦ ОрганизацияПолучательТелефоны,
	|	ВЫБОР КОГДА ТелефонКонтрагента.Представление ЕСТЬ NULL ТОГДА """" ИНАЧЕ ТелефонКонтрагента.Представление КОНЕЦ ОрганизацияПоставщикТелефоны,
	|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
	|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
	|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
	|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
	|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Организация.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПолучательБанковскиеРеквизиты,
	|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
	|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
	|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
	|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
	|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияПоставщикБанковскиеРеквизиты,
	|	ВЫБОР КОГДА ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет = &ПустойБанковскийСчет ТОГДА """" ИНАЧЕ
	|	(""" + "Банк: " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование+""" + ", " + """+
	|	 """ + "расч.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета+""" + ", " + """+
	|	 """ + "корр.сч. " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет+""" + ", " + """+
	|	 """ + "БИК " + """+ПоступлениеТоваровУслуг.Контрагент.ОсновнойБанковскийСчет.Банк.Код) КОНЕЦ КАК ОрганизацияГрузоотправительБанковскиеРеквизиты,
	|	ПоступлениеТоваровУслуг.УчитыватьНДС,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ПоступлениеТоваровУслуг.НДСВключенВСтоимость,
	|	ПоступлениеТоваровУслуг.СуммаДокумента,
	|	ПоступлениеТоваровУслуг.Контрагент КАК ОрганизацияПоставщик,
	|	ПоступлениеТоваровУслуг.Контрагент КАК ОрганизацияГрузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента КАК ОснованиеНомер,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ОснованиеДата,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации КАК Подразделение,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации КАК ПодразделениеНаименование
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
	|		ПО (ТелефонОрганизации.Объект = ПоступлениеТоваровУслуг.Организация)
	|			И (ТелефонОрганизации.Тип = &Телефон)
	|			И (ТелефонОрганизации.Вид = &ТелефонОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	|		ПО (ТелефонКонтрагента.Объект = ПоступлениеТоваровУслуг.Контрагент)
	|			И (ТелефонКонтрагента.Тип = &Телефон)
	|			И (ТелефонКонтрагента.Вид = &ТелефонКонтрагента)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	
	Если ПечатьПоДаннымУпрУчета Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПодразделениеОрганизации", "Подразделение");
	КонецЕсли;
	
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	Шапка         = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Подвал        = Макет.ПолучитьОбласть("Подвал");
	
	ОрганизацияПолучательНаименование       = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПолучатель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
	ОрганизацияПоставщикНаименование        = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПоставщик, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
	ОрганизацияГрузоотправительНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияГрузоотправитель, ВыборкаПоШапке.ДатаДокумента), "ПолноеНаименование,");
	
	Шапка.Параметры.Заполнить(ВыборкаПоШапке);
	Шапка.Параметры.ОрганизацияПолучательНаименование       = ОрганизацияПолучательНаименование;
	Шапка.Параметры.ОрганизацияПоставщикНаименование        = ОрганизацияПоставщикНаименование;
	Шапка.Параметры.ОрганизацияГрузоотправительНаименование = ОрганизацияГрузоотправительНаименование;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ВыборкаПоШапке.ОрганизацияПолучатель, ВыборкаПоШапке.ДатаДокумента,);
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоШапке.ОрганизацияПолучатель, ВыборкаПоШапке.ДатаДокумента);
	
	Шапка.Параметры.ОрганизацияПолучательКодПоОКПО        = СведенияОПокупателе.КодПоОКПО;
	
	Шапка.Параметры.РуководительНаименование = Руководители.Руководитель;
	Шапка.Параметры.РуководительДолжность    = Руководители.РуководительДолжность;
	Шапка.Параметры.Основание                = ВыборкаПоШапке.ДоговорКонтрагента;
	
	ТабДокумент.Вывести(Шапка);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ШапкаТаблицы.Параметры.Валюта = ВалютаПечати.Наименование;
	ТабДокумент.Вывести(ШапкаТаблицы);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"                    , Ссылка);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВалюты", КоэффициентПересчетаВалюты);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	ПоступлениеТоваровУслуг.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслуг.Номенклатура КАК Оборудование,
	|	ПоступлениеТоваровУслуг.Номенклатура.НаименованиеПолное КАК ОборудованиеНаименование,
	|	ПоступлениеТоваровУслуг.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	ПоступлениеТоваровУслуг.Коэффициент,
	|	ПоступлениеТоваровУслуг.СтавкаНДС,
	|	ПоступлениеТоваровУслуг.Количество,
	|	ПоступлениеТоваровУслуг.Количество КАК ФактическиКоличество,
	|	ПоступлениеТоваровУслуг.Цена * &КоэффициентПересчетаВалюты КАК СтоимостьЗаЕдиницу,
	|	ПоступлениеТоваровУслуг.Сумма * &КоэффициентПересчетаВалюты КАК Сумма,
	|	ПоступлениеТоваровУслуг.СуммаНДС * &КоэффициентПересчетаВалюты КАК СуммаНДС
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	
	ВыборкаПоОборудованию = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоОборудованию.Следующий() Цикл
		
		СтрокаТаблицы.Параметры.Заполнить(ВыборкаПоОборудованию);
		
		Если ВыборкаПоШапке.УчитыватьНДС Тогда
			Если ВыборкаПоШапке.СуммаВключаетНДС И НЕ ВыборкаПоШапке.НДСВключенВСтоимость Тогда
				СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС;
				СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ?(ВыборкаПоОборудованию.Количество > 0,
				(ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС) / ВыборкаПоОборудованию.Количество,
				ВыборкаПоОборудованию.Сумма - ВыборкаПоОборудованию.СуммаНДС);
			ИначеЕсли НЕ ВыборкаПоШапке.СуммаВключаетНДС И ВыборкаПоШапке.НДСВключенВСтоимость Тогда
				СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма + ВыборкаПоОборудованию.СуммаНДС;
				СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ?(ВыборкаПоОборудованию.Количество > 0,
				(ВыборкаПоОборудованию.Сумма + ВыборкаПоОборудованию.СуммаНДС) / ВыборкаПоОборудованию.Количество,
				ВыборкаПоОборудованию.Сумма + ВыборкаПоОборудованию.СуммаНДС);
			Иначе
				СтрокаТаблицы.Параметры.СтоимостьВсего     = ВыборкаПоОборудованию.Сумма;
				СтрокаТаблицы.Параметры.СтоимостьЗаЕдиницу = ВыборкаПоОборудованию.СтоимостьЗаЕдиницу;
			КонецЕсли;
		Иначе
			СтрокаТаблицы.Параметры.СтоимостьВсего = ВыборкаПоОборудованию.Сумма;
		КонецЕсли;
			
		ТабДокумент.Вывести(СтрокаТаблицы);
		
	КонецЦикла;
	
	Подвал.Параметры.ГлавныйБухгалтерНаименование	= Руководители.ГлавныйБухгалтер;
	
	ТабДокумент.Вывести(Подвал);
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСнизу = 0;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьОС14()

// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
//
// Параметры:
//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьБланк(НаПринтер)

	Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, , , НаПринтер);

	Возврат Неопределено;

КонецФункции // ПечатьБланк()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОС14упр" тогда

		// Унифицированная форма М-4 (Акт о приеме оборудования) по данным упручета
		ТабДокумент = ПечатьОС14();

	ИначеЕсли ИмяМакета = "ОС14бух" тогда
		
		// Унифицированная форма М-4 (Акт о приеме оборудования) по данным бухучета
		ТабДокумент = ПечатьОС14(Ложь);

	ИначеЕсли ИмяМакета = "СправкаРасчетВал" тогда

		// Справка-расчет формирования рублевой суммы документа в валюте
		БухгалтерскийУчетРасчетовСКонтрагентами.НапечататьСправкуРасчетРублеваяСуммаДокументаВВалюте(Ссылка);
		Возврат;
	ИначеЕсли ИмяМакета = "Бланк" Тогда

		ТабДокумент = ПечатьБланк(НаПринтер);
	ИначеЕсли ИмяМакета = "Ценники" Тогда
		ТабДокумент = ПечатьЦенников();
	ИначеЕсли ИмяМакета = "Этикетки" Тогда
		ПечататьЭтикетки();
		Возврат;
	ИначеЕсли ИмяМакета = "СерийныеНомера" Тогда
	
		ТабДокумент = УчетСерийныхНомеров.ПечатьСерийныхНомеров(Ссылка, "Товары");
	
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		//Формы Накладная, ТОРГ4, М4, ТОРГ12 печатаются из модуля менеджера
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Ссылка);
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.ПоступлениеТоваровУслуг", ИмяМакета, 
										ПараметрКоманды, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПоступлениеТоваровУслуг", ИмяМакета, 
										ПараметрКоманды, Неопределено, Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;

	Если НЕ (ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства) тогда

		СтруктураМакетов.Вставить("ТОРГ12",          "ТОРГ-12 (Товарная накладная за поставщика с услугами)");
		СтруктураМакетов.Вставить("ТОРГ12_БезУслуг", "ТОРГ-12 (Товарная накладная за поставщика)");
		СтруктураМакетов.Вставить("ТОРГ4",           "ТОРГ-4 (Акт о приемке товара без счета поставщика)");
		СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");

		Если  ОтражатьВУправленческомУчете тогда 
			СтруктураМакетов.Вставить("ОС14упр",     "ОС-14 (Акт о приеме оборудования) (упр. учет)");
		КонецЕсли;
		Если  ОтражатьВБухгалтерскомУчете тогда 
			СтруктураМакетов.Вставить("ОС14бух",     "ОС-14 (Акт о приеме оборудования) (бух. учет)");
		КонецЕсли;

		СтруктураМакетов.Вставить("Бланк",           "Бланк товарного наполнения");
	КонецЕсли;

	Если  ОтражатьВБухгалтерскомУчете тогда 
		СтруктураМакетов.Вставить( "СправкаРасчетВал", "Справка-расчет ""Рублевая сумма документа в валюте""");
	КонецЕсли;
		
	СтруктураМакетов.Вставить("Накладная",           "Приходная накладная");
	СтруктураМакетов.Вставить("Ценники", "Ценники на товары");
	СтруктураМакетов.Вставить("Этикетки",        "Этикетки");
	СтруктураМакетов.Вставить("СерийныеНомера",      "Список серийных номеров");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

// Очищает ненужные строки табличных частей
//
Процедура ОчиститьНенужныеТабличныеЧасти() Экспорт

	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		Оборудование.Очистить();
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		ОбъектыСтроительства.Очистить();
	Иначе
		Товары.Очистить();
		ВозвратнаяТара.Очистить();
	КонецЕсли;
	
	// Если договор с комитентом, то надо почистить закладку "Услуги".
	Если Услуги.Количество() > 0
	   И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

		Услуги.Очистить();

	КонецЕсли;
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Услуги.Очистить();
		ВозвратнаяТара.Очистить();
	КонецЕсли;
	
	//m.ionov@a-prof.ru 21.02.2014
	Если УЗ_НесколькоСФ Тогда
		Оборудование.Очистить();
        ОбъектыСтроительства.Очистить();
		Товары.Очистить();
		ВозвратнаяТара.Очистить();
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	

КонецПроцедуры // ОчиститьНенужныеТабличныеЧасти()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьОборудование(ДокументОснование = Неопределено) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуТовары.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуТовары.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуТовары.ЕдиницаИзмерения,
	|	СчетНаОплатуТовары.Количество,
	|	СчетНаОплатуТовары.Коэффициент,
	|	СчетНаОплатуТовары.Номенклатура,
	|	СчетНаОплатуТовары.СтавкаНДС,
	|	СчетНаОплатуТовары.Сумма,
	|	СчетНаОплатуТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Оборудование КАК СчетНаОплатуТовары
	|
	|ГДЕ
	|	СчетНаОплатуТовары.Ссылка = &Счет";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Оборудование.Добавить();

		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;

		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
										МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
												   Выборка.КурсДокумента, Курс,
												   Выборка.КратностьДокумента, Кратность),
										Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
										Выборка.СуммаВключаетНДС,
										УчитыватьНДС,
										СуммаВключаетНДС,
										УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Оборудование");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;		
		СтрокаТабличнойЧасти.ЗаказПоставщику 			= ДокументОснованиеЗаказПоставщику;
		СтрокаТабличнойЧасти.Склад 						= ДокументОснованиеСклад;
		
	КонецЦикла;

КонецПроцедуры // СкопироватьОборудование()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьТовары(ДокументОснование = Неопределено) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуТовары.Ссылка.ВалютаДокумента = СчетНаОплатуТовары.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуТовары.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуТовары.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуТовары.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуТовары.ЕдиницаИзмерения,
	|	СчетНаОплатуТовары.ЕдиницаИзмеренияМест,
	|	СчетНаОплатуТовары.Количество,
	|	СчетНаОплатуТовары.КоличествоМест,
	|	СчетНаОплатуТовары.Коэффициент,
	|	СчетНаОплатуТовары.Номенклатура,
	|	СчетНаОплатуТовары.СтавкаНДС,
	|	СчетНаОплатуТовары.Сумма,
	|	СчетНаОплатуТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуТовары
	|
	|ГДЕ
	|	СчетНаОплатуТовары.Ссылка = &Счет";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Товары.Добавить();

		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.КоличествоМест       = Выборка.КоличествоМест;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмеренияМест;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;

		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
										МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
												   Выборка.КурсДокумента, Курс,
												   Выборка.КратностьДокумента, Кратность),
										Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
										Выборка.СуммаВключаетНДС,
										УчитыватьНДС,
										СуммаВключаетНДС,
										УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.ЗаказПоставщику 			= ДокументОснованиеЗаказПоставщику;
		СтрокаТабличнойЧасти.Склад 						= ДокументОснованиеСклад;
		
	КонецЦикла;

КонецПроцедуры // СкопироватьТовары()

// Процедура выполняет копирование возвратной тары заказа поставщику в документ.
//
Процедура СкопироватьВозвратнуюТару(ДокументОснование = Неопределено) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка.ВалютаДокумента                          КАК ВалютаДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуВозвратнаяТара.Ссылка.ВалютаДокумента = СчетНаОплатуВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуВозвратнаяТара.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуВозвратнаяТара.Ссылка.ВалютаДокумента = СчетНаОплатуВозвратнаяТара.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуВозвратнаяТара.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуВозвратнаяТара.Количество,
	|	СчетНаОплатуВозвратнаяТара.Номенклатура,
	|	СчетНаОплатуВозвратнаяТара.Сумма
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.ВозвратнаяТара КАК СчетНаОплатуВозвратнаяТара
	|
	|ГДЕ
	|	СчетНаОплатуВозвратнаяТара.Ссылка = &Счет";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	ДокументОснованиеСклад = ДокументОснование.Склад;
	
	Пока Выборка.Следующий() Цикл

		СтрокаВозвратнойТары = ВозвратнаяТара.Добавить();

		СтрокаВозвратнойТары.Номенклатура     = Выборка.Номенклатура;
		СтрокаВозвратнойТары.Количество       = Выборка.Количество;

		СтрокаВозвратнойТары.Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		                                        Выборка.ВалютаДокумента, 
		                                        ВалютаДокумента,
		                                        Выборка.КурсДокумента, Курс,
												Выборка.КратностьДокумента, Кратность);

		ОбработкаТабличныхЧастей.ПриИзмененииВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);
		СтрокаВозвратнойТары.ЗаказПоставщику  = ДокументОснованиеЗаказПоставщику;
		СтрокаВозвратнойТары.Склад 			  = ДокументОснованиеСклад;
		
	КонецЦикла;

КонецПроцедуры // СкопироватьВозвратнуюТару()

// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьУслуги(ДокументОснование = Неопределено) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Сделка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА СчетНаОплатуУслуги.Ссылка.ВалютаДокумента = СчетНаОплатуУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуУслуги.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА СчетНаОплатуУслуги.Ссылка.ВалютаДокумента = СчетНаОплатуУслуги.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		СчетНаОплатуУслуги.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	СчетНаОплатуУслуги.Ссылка.ВалютаДокумента       КАК ВалютаДокумента,
	|	СчетНаОплатуУслуги.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	СчетНаОплатуУслуги.Содержание,
	|	СчетНаОплатуУслуги.Количество,
	|	СчетНаОплатуУслуги.Номенклатура,
	|	СчетНаОплатуУслуги.СтавкаНДС,
	|	СчетНаОплатуУслуги.Сумма
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Услуги КАК СчетНаОплатуУслуги
	|
	|ГДЕ
	|	СчетНаОплатуУслуги.Ссылка = &Счет";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	ДокументОснованиеЗаказПоставщику = ДокументОснование.ДокументОснование;
	Если ТипЗнч(ДокументОснованиеЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснованиеЗаказПоставщику = Неопределено;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Услуги.Добавить();

		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество       = Выборка.Количество;
		СтрокаТабличнойЧасти.Содержание       = Выборка.Содержание;
		СтрокаТабличнойЧасти.СтавкаНДС        = Выборка.СтавкаНДС;
		
		СтрокаТабличнойЧасти.СтатьяЗатрат 		  = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
		СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;

		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
										МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
												   Выборка.КурсДокумента, Курс,
												   Выборка.КратностьДокумента, Кратность),
										Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
										Выборка.СуммаВключаетНДС,
										УчитыватьНДС,
										СуммаВключаетНДС,
										УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Услуги");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		СтрокаТабличнойЧасти.ЗаказПоставщику = ДокументОснованиеЗаказПоставщику;
		
	КонецЦикла;

КонецПроцедуры // СкопироватьУслуги()

// Заполняет регл. реквизиты после упр. заполнения
Процедура ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,Выборка)

		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);

КонецПроцедуры // ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл()	

// Процедура выполняет заполниение табличной части неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьТоварыПоОстаткамУпр(СтатусПартииСтр = "Купленный") Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров[СтатусПартииСтр]);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Товар",        Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	Запрос.УстановитьПараметр("ТипЦен",       ТипЦен);
	Запрос.УстановитьПараметр("ПустойТипЦен", Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу) КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению) КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение КАК Размещение,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ТЧЗаказа.Номенклатура ЕСТЬ NULL 
	|			ТОГДА 99999999
	|		ИНАЧЕ МИНИМУМ(ТЧЗаказа.НомерСтрокиЗаказа)
	|	КОНЕЦ КАК НомерСтрокиЗаказа,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ТЧЗаказа.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		Остатки.Цена КАК Цена,
	|		Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Остатки.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|		Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу,
	|		0 КАК КоличествоПоРазмещению,
	|		НЕОПРЕДЕЛЕНО КАК Размещение,
	|		Остатки.СтавкаНДС КАК СтавкаНДС
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				&ДатаОстатков,
	|				ДоговорКонтрагента = &Договор
	|					И ЗаказПоставщику = &Сделка
	|					И СтатусПартии = &СтатусПартии) КАК Остатки
	|	ГДЕ
	|		(НЕ Остатки.Номенклатура.Услуга)
	|		И Остатки.КоличествоОстаток <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Размещение.Номенклатура,
	|		Размещение.ХарактеристикаНоменклатуры,
	|		0,
	|		ВЫБОР
	|			КОГДА &ТипЦен = &ПустойТипЦен
	|				ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL 
	|						ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков
	|					ИНАЧЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ТипЦен = &ПустойТипЦен
	|				ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения ЕСТЬ NULL 
	|						ТОГДА Размещение.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|					ИНАЧЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения.Коэффициент
	|				КОНЕЦ
	|		КОНЕЦ,
	|		0,
	|		Размещение.КоличествоОстаток,
	|		Размещение.ЗаказПокупателя,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|				&ДатаОстатков,
	|				ЗаказПоставщику = &Сделка
	|					И ТоварТара = &Товар) КАК Размещение
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|			ПО Размещение.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|				И Размещение.ХарактеристикаНоменклатуры = ЦеныНоменклатурыКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры
	|	ГДЕ
	|		(НЕ Размещение.Номенклатура.Услуга)
	|		И Размещение.КоличествоОстаток > 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|			ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			МИНИМУМ(ЗаказПоставщикуТовары.НомерСтроки) КАК НомерСтрокиЗаказа,
	|			ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ГДЕ
	|			ЗаказПоставщикуТовары.Ссылка = &Сделка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуТовары.Номенклатура,
	|			ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры,
	|			ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест) КАК ТЧЗаказа
	|		ПО ВложенныйЗапрос.Номенклатура = ТЧЗаказа.Номенклатура
	|			И ВложенныйЗапрос.ХарактеристикаНоменклатуры = ТЧЗаказа.ХарактеристикаНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Коэффициент,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ТЧЗаказа.Номенклатура,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ТЧЗаказа.ЕдиницаИзмеренияМест";

	Запрос.УстановитьПараметр("Период", МоментВремени());
	РезультатЗапроса = Запрос.Выполнить();

	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	ТаблицаПоЗаказу.Сортировать("НомерСтрокиЗаказа возр");
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "КоличествоОстатокПоЗаказу");

	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;

		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               СтрокаБезЦен.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаБезЦен.ХарактеристикаНоменклатуры);

		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);

		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;

			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;

			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;

				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;

				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				
				Если СписатьПоРазмещению<=0  Тогда 
					Продолжить; 
				КонецЕсли;

				
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано    + СписатьПоРазмещению;
				
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.СтавкаНДС                  = СтрокаЗаказа.СтавкаНДС;
				СтрокаТабличнойЧасти.Заказ			            = СтрокаРазмещения.Размещение;
				СтрокаТабличнойЧасти.Количество                 = СписатьПоРазмещению * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
																  /СтрокаЗаказа.Коэффициент;
																  
				Если ЗначениеЗаполнено(СтрокаЗаказа.ЕдиницаИзмеренияМест) Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = СтрокаЗаказа.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				Иначе
					ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				КонецЕсли;													  

				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
											МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
											Сделка.ВалютаДокумента, ВалютаДокумента,
											ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
											ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность),
											Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
											Сделка.СуммаВключаетНДС,
											УчитыватьНДС,
											СуммаВключаетНДС,
											УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

				СтрокаТабличнойЧасти.Сумма  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;

				ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти,    ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,   ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

				СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
					
				СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
					
				ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,СтрокаЗаказа);
			КонецЦикла;

			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано    + СписатьПоЗаказу;

			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = СтрокаЗаказа.ХарактеристикаНоменклатуры;
				СтрокаТабличнойЧасти.ЕдиницаИзмерения           = СтрокаЗаказа.ЕдиницаИзмерения;
				СтрокаТабличнойЧасти.Коэффициент                = СтрокаЗаказа.Коэффициент;
				СтрокаТабличнойЧасти.СтавкаНДС                  = СтрокаЗаказа.СтавкаНДС;
				СтрокаТабличнойЧасти.Заказ			            = Неопределено;
				СтрокаТабличнойЧасти.Количество                 = СписатьПоЗаказу * СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
																  /СтрокаЗаказа.Коэффициент;
																  
				Если ЗначениеЗаполнено(СтрокаЗаказа.ЕдиницаИзмеренияМест) Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = СтрокаЗаказа.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				Иначе
					ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				КонецЕсли;

				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				                            МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				                            Сделка.ВалютаДокумента, ВалютаДокумента,
				                            ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
				                            ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность),
				                            Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов,
				                            Сделка.СуммаВключаетНДС,
				                            УчитыватьНДС,
				                            СуммаВключаетНДС,
				                            УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

				СтрокаТабличнойЧасти.Сумма  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;

				ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти,    ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,   ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				
				СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
				
			КонецЕсли;

			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;

			ЗаполнитьДопРеквизитыТоваровПриЗаполненииПоОстаткамРегл(СтрокаТабличнойЧасти,СтрокаЗаказа);
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьТоварыПоОстаткамУпр()

// Заполняет регл. реквизиты после упр. заполнения
// Процедура выполняет заполниение возвратной тары неполученными ТМЦ по заказу поставщику.
//
Процедура ЗаполнитьВозвратнуюТаруПоОстаткамУпр() Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос;
	ИмяТЧ  = "ЗаказПоставщику.ВозвратнаяТара";

	Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	Запрос.УстановитьПараметр("Договор",      ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",       Сделка);
	Запрос.УстановитьПараметр("Тара",         Перечисления.ТоварТара.Тара);
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	СУММА(ВложенныйЗапрос.КоличествоОстатокПоЗаказу) КАК КоличествоОстатокПоЗаказу,
	|	СУММА(ВложенныйЗапрос.КоличествоПоРазмещению) КАК КоличествоПоРазмещению,
	|	ВложенныйЗапрос.Размещение КАК Размещение,
	|	ВЫБОР
	|		КОГДА ТЧЗаказа.Номенклатура ЕСТЬ NULL 
	|			ТОГДА 99999999
	|		ИНАЧЕ МИНИМУМ(ТЧЗаказа.НомерСтрокиЗаказа)
	|	КОНЕЦ КАК НомерСтрокиЗаказа
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.Цена КАК Цена,
	|		Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу,
	|		0 КАК КоличествоПоРазмещению,
	|		НЕОПРЕДЕЛЕНО КАК Размещение
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОстатков
	|			,
	|			ДоговорКонтрагента = &Договор
	|			    И ЗаказПоставщику = &Сделка
	|			    И СтатусПартии = &СтатусПартии) КАК Остатки
	|	ГДЕ
	|		(НЕ Остатки.Номенклатура.Услуга)
	|		И Остатки.КоличествоОстаток <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Размещение.Номенклатура,
	|		0,
	|		0,
	|		Размещение.КоличествоОстаток,
	|		Размещение.ЗаказПокупателя
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&ДатаОстатков
	|			,
	|			ЗаказПоставщику = &Сделка
	|				И ТоварТара = &Тара) КАК Размещение
	|	ГДЕ
	|		(НЕ Размещение.Номенклатура.Услуга)
	|		И Размещение.КоличествоОстаток > 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|			МИНИМУМ(ЗаказПоставщикуТовары.НомерСтроки) КАК НомерСтрокиЗаказа
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ГДЕ
	|			ЗаказПоставщикуТовары.Ссылка = &Сделка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуТовары.Номенклатура) КАК ТЧЗаказа
	|		ПО ВложенныйЗапрос.Номенклатура = ТЧЗаказа.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Размещение,
	|	ВложенныйЗапрос.Цена,
	|	ТЧЗаказа.Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	// Таблица остатков по размещению покупателям
	ТаблицаПоРазмещению = РезультатЗапроса.Выгрузить();
	Сч = 0;
	Пока Сч < ТаблицаПоРазмещению.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоРазмещению.Получить(Сч);
		Если СтрокаТаблицы.КоличествоПоРазмещению <= 0 Тогда
			ТаблицаПоРазмещению.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Таблица остатков по заказу поставщику
	ТаблицаПоЗаказу = РезультатЗапроса.Выгрузить();
	ТаблицаПоЗаказу.Сортировать("НомерСтрокиЗаказа возр");
	Сч = 0;
	Пока Сч < ТаблицаПоЗаказу.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоЗаказу.Получить(Сч);
		Если СтрокаТаблицы.КоличествоОстатокПоЗаказу = 0 Тогда
			ТаблицаПоЗаказу.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;

	// Нам надо знать сколько на самом деле осталось номенклатуры
	ТаблицаБезЦен = ТаблицаПоЗаказу.Скопировать();
	ТаблицаБезЦен.Свернуть("Номенклатура", "КоличествоОстатокПоЗаказу");

	Для каждого СтрокаБезЦен ИЗ ТаблицаБезЦен Цикл
		ВсегоПоЗаказу = СтрокаБезЦен.КоличествоОстатокПоЗаказу;
		ВсегоСписано  = 0;

		Если ВсегоСписано >= ВсегоПоЗаказу Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаБезЦен.Номенклатура);

		СтрокиПоРазмещению = ТаблицаПоРазмещению.НайтиСтроки(СтруктураПоиска);
		СтрокиПоЗаказу     = ТаблицаПоЗаказу.НайтиСтроки(СтруктураПоиска);

		Для Каждого СтрокаЗаказа Из СтрокиПоЗаказу Цикл
			КолвоПоЗаказу       = СтрокаЗаказа.КоличествоОстатокПоЗаказу;
			СписатьПоРазмещению = 0;
			СписатьПоЗаказу     = 0;
			СписаноПоСтроке     = 0;

			Если КолвоПоЗаказу <= 0 Тогда
				Продолжить;
			КонецЕсли;

			// Cписываем по размещению
			Для Каждого СтрокаРазмещения Из СтрокиПоРазмещению Цикл
				КолвоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению;

				Если КолвоПоРазмещению <= 0 Тогда
					Продолжить;
				КонецЕсли;

				СписатьПоРазмещению = Мин(КолвоПоРазмещению, Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано));
				СписаноПоСтроке     = СписаноПоСтроке + СписатьПоРазмещению;
				ВсегоСписано        = ВсегоСписано + СписатьПоРазмещению;

				Если КолвоПоРазмещению > 0 Тогда
					СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
					СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
					СтрокаТабличнойЧасти.Заказ			 = СтрокаРазмещения.Размещение;
					СтрокаТабличнойЧасти.Количество      = СписатьПоРазмещению;

					СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
					                            Сделка.ВалютаДокумента, ВалютаДокумента,
					                            ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
					                            ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность);

					ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
					ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);

					СтрокаРазмещения.КоличествоПоРазмещению = СтрокаРазмещения.КоличествоПоРазмещению - СписатьПоРазмещению;
					
					СтрокаТабличнойЧасти.ЗаказПоставщику    = Сделка;
				КонецЕсли;
			КонецЦикла;

			// Cписываем без размещения
			СписатьПоЗаказу = Мин(КолвоПоЗаказу - СписаноПоСтроке, ВсегоПоЗаказу - ВсегоСписано);
			СписаноПоСтроке = СписаноПоСтроке + СписатьПоЗаказу;
			ВсегоСписано    = ВсегоСписано    + СписатьПоЗаказу;

			Если СписатьПоЗаказу > 0 Тогда
				СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();
				СтрокаТабличнойЧасти.Номенклатура    = СтрокаЗаказа.Номенклатура;
				СтрокаТабличнойЧасти.Заказ			 = Неопределено;
				СтрокаТабличнойЧасти.Количество      = СписатьПоЗаказу;

				СтрокаТабличнойЧасти.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЗаказа.Цена,
				                            Сделка.ВалютаДокумента, ВалютаДокумента,
				                            ЗаполнениеДокументов.КурсДокумента(Сделка, мВалютаРегламентированногоУчета), Курс,
				                            ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета), Кратность);

				ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
				ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
				
				СтрокаТабличнойЧасти.ЗаказПоставщику = Сделка;
				
			КонецЕсли;

			СтрокаЗаказа.КоличествоОстатокПоЗаказу = СтрокаЗаказа.КоличествоОстатокПоЗаказу - СписаноПоСтроке;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьВозвратнуюТаруПоОстаткамУпр()

// Процедура выполняет заполниение услуг неполученными услугами по заказу поставщику.
//
Процедура ЗаполнитьУслугиПоОстаткамУпр() Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Товар",   Перечисления.ТоварТара.Товар);
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Сделка",  Сделка);
	Запрос.УстановитьПараметр("ВозвратнаяТара", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
	
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.СтавкаНДС КАК СтавкаНДС,
	|	Остатки.Цена,
	|	Остатки.КоличествоОстаток КАК КоличествоОстатокПоЗаказу
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОстатков
	|		,
	|		ДоговорКонтрагента = &Договор
	|			И ЗаказПоставщику = &Сделка
	|			И СтатусПартии <> &ВозвратнаяТара) КАК Остатки
	|ГДЕ
	|	Остатки.Номенклатура.Услуга
	|	И Остатки.КоличествоОстаток>0";

	РезультатЗапроса = Запрос.Выполнить();
	
	ЗапросСодержаний = Новый Запрос;
	ЗапросСодержаний.УстановитьПараметр("Сделка",  Сделка);
	ЗапросСодержаний.Текст = 
	"ВЫБРАТЬ
	|	Док.Номенклатура,
	|	Док.Содержание
	|ИЗ
	|	Документ.ЗаказПоставщику.Услуги КАК Док
	|ГДЕ
	|	Док.Ссылка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";
	
	ТабСодержаний = ЗапросСодержаний.Выполнить().Выгрузить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаУслуг = Услуги.Добавить();
		СтрокаУслуг.Номенклатура = Выборка.Номенклатура;
		СтрокаУслуг.Количество   = Выборка.КоличествоОстатокПоЗаказу;
		СтрокаУслуг.СтавкаНДС    = Выборка.СтавкаНДС;
		
		СтрокаСодержания = ТабСодержаний.Найти(Выборка.Номенклатура, "Номенклатура");

		Если СтрокаСодержания = Неопределено Тогда
			ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(СтрокаУслуг, ЭтотОбъект);
		Иначе
			СтрокаУслуг.Содержание = СтрокаСодержания.Содержание;
		КонецЕсли;

		СтрокаУслуг.СтатьяЗатрат         = СтрокаУслуг.Номенклатура.СтатьяЗатрат;
		СтрокаУслуг.НоменклатурнаяГруппа = СтрокаУслуг.Номенклатура.НоменклатурнаяГруппаЗатрат;

		СтрокаУслуг.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена,
		                   Сделка.ВалютаДокумента, ВалютаДокумента,
		                   ЗаполнениеДокументов.КурсДокумента(Сделка,     мВалютаРегламентированногоУчета),
		                   Курс,
		                   ЗаполнениеДокументов.КратностьДокумента(Сделка, мВалютаРегламентированногоУчета),
		                   Кратность);

		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаУслуг, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаУслуг, ЭтотОбъект);
        СтрокаУслуг.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		
		СтрокаУслуг.ЗаказПоставщику = Сделка;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьУслугиПоОстаткамУпр()

// Процедура выполняет заполниение услуг неполученными услугами по заказу поставщику.
//
Процедура ЗаполнитьОборудованиеПоОстаткамУпр() Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Если ЭтоНовый() Тогда
		ДатаОстатков = Дата('00010101');
	Иначе
		ДатаОстатков = Дата;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить( "УчитыватьНДС",     Сделка.УчитыватьНДС);
	ДопПараметры.Вставить( "СуммаВключаетНДС", Сделка.СуммаВключаетНДС);
	
	УправлениеЗаказами.ЗаполнитьТабЧастьОборудованиеПоЗаказуПоставщику(Сделка, Оборудование, УправлениеЗаказами.ОстаткиОборудованияПоЗаказуПоставщику  ( Сделка, Сделка.ДоговорКонтрагента, ДатаОстатков), ДопПараметры);
	Для каждого Строка из Оборудование Цикл
		Строка.ЗаказПоставщику = Сделка;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьУслугиПоОстаткамУпр()

// Заполняет счета БУ и НУ в строке табличной части
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт
	
	Если ИмяТабЧасти = "ОбъектыСтроительства" Тогда
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТЧ, ЗаполнятьБУ, ЗаполнятьНУ);
	Иначе
		СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти(ИмяТабЧасти, СтрокаТЧ, ЭтотОбъект, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

// Заполняет счета БУ и НУ в табличной части документа
//
Процедура ЗаполнитьСчетаУчетаВТабЧасти(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Если ИмяТабЧасти = "ОбъектыСтроительства" Тогда
		ЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства(ОбъектыСтроительства, ЗаполнятьБУ, ЗаполнятьНУ);
	Иначе
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(ТабличнаяЧасть, ИмяТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабЧасти()

// Возвращает структуру со значениями по-умолчанию счетов учета шапки.
//
Функция ЗаполнитьСтруктуруСчетовУчетаШапки(ЗаполнятьБУ=Истина, ЗаполнятьНУ=Истина) Экспорт
 
	СтруктураСчетов = Новый Структура();
	
	Если ЗаполнятьБУ и ОтражатьВБухгалтерскомУчете Тогда
	
		СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, ДоговорКонтрагента);
		
		Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтруктураСчетов.Вставить("СчетУчетаРасчетовСКонтрагентом",	СчетаУчета.СчетРасчетовСКомитентом);
		Иначе
			СтруктураСчетов.Вставить("СчетУчетаРасчетовСКонтрагентом",	СчетаУчета.СчетРасчетов);
		КонецЕсли;
		СтруктураСчетов.Вставить("СчетУчетаРасчетовПоАвансам",		СчетаУчета.СчетАвансов);
		СтруктураСчетов.Вставить("СчетУчетаРасчетовПоТаре",			СчетаУчета.СчетУчетаТары);
		
	КонецЕсли;
		
	Возврат СтруктураСчетов;
	
КонецФункции

// Заполняет счета БУ и НУ в строке табличной части "Объекты строительства"
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	СчетаУчета = УправлениеВнеоборотнымиАктивами.ПолучитьСчетаУчетаОбъектовСтроительства(Организация, СтрокаТабЧасти.ОбъектСтроительства);

	Если ЗаполнятьБУ = Истина Тогда
		СтрокаТабЧасти.СчетУчетаБУ  = СчетаУчета.СчетУчетаБУ;
		СтрокаТабЧасти.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		СтрокаТабЧасти.СчетУчетаБУ  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СтрокаТабЧасти.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;

	Если ЗаполнятьНУ = Истина Тогда
		СтрокаТабЧасти.СчетУчетаНУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ", СтрокаТабЧасти.СчетУчетаБУ));
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		СтрокаТабЧасти.СчетУчетаНУ = ПланыСчетов.Налоговый.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства()

// Заполняет счета БУ и НУ в табличной части "Объекты строительства"
//
Процедура ЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства(ТабличнаяЧасть, ЗаполнятьБУ, ЗаполнятьНУ) Экспорт

	Для каждого СтрокаТабЧасти Из ТабличнаяЧасть Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиОбъектовСтроительства(СтрокаТабЧасти, ЗаполнятьБУ, ЗаполнятьНУ);
	КонецЦикла;

КонецПроцедуры // обЗаполнитьСчетаУчетаВТабЧастиПоОбъектамСтроительства()

// Процедура выполняет заполнение табличной части по приходному ордеру товаров.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание (приходный ордер товаров).
//
Процедура ЗаполнитьТоварыПоОснованиюУпр(ДокументОснование, ТабличнаяЧасть) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Если ТабличнаяЧасть = ВозвратнаяТара Тогда
		ИмяТабличнойЧасти = "ВозвратнаяТара";
	Иначе
		ИмяТабличнойЧасти = "Товары";
	КонецЕсли;
	
	ДополнительныеРеглПоляОбщ		= "";
	ДополнительныеРеглПоляТовары 	= "";
	
	Запрос.УстановитьПараметр("Склад",        ДокументОснование.Склад);
	Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	
	СкладыВТабличнойЧасти = мУказаниеСкладовВТЧ Или ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
							 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
	|	ДокТовары.Номенклатура,
	|	ДокТовары.Номенклатура.СтавкаНДС                            КАК СтавкаНДС,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков             КАК ЕдиницаХранения,
	|	ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения," +
		ДополнительныеРеглПоляОбщ +"
	|	СУММА(ДокТовары.Количество)                        КАК КоличествоПоДокументу,
	|	NULL                                               КАК ЦенаВРознице, " + 
	?(ТабличнаяЧасть = Товары, "
	|	ДокТовары.СерияНоменклатуры," +
		ДополнительныеРеглПоляТовары +"
	|	ДокТовары.ХарактеристикаНоменклатуры, ", "") +
	?(СкладыВТабличнойЧасти, "
	|	Остатки.Склад                                      КАК Склад,", "") + " 
	|	СУММА(ДокТовары.Количество" +
	?(ТабличнаяЧасть = Товары, " * ДокТовары.Коэффициент 
	|	  / ДокТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "") + ") КАК КоличествоПоСерии,  
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                КАК КоличествоОстатокКомпании,
	|	МАКСИМУМ("+
	?(ТабличнаяЧасть = Товары, "
    |       ДокТовары.ЕдиницаИзмерения ","
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков ")+"
	|)                                                   КАК ЕдиницаИзмерения,
	|   МАКСИМУМ("+
	?(ТабличнаяЧасть = Товары, "
    |		ДокТовары.ЕдиницаИзмерения.Коэффициент ","
	|       Остатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент ")+"
	|)                                                   КАК Коэффициент
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары." + ИмяТабличнойЧасти + " КАК ДокТовары
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(&ДатаОстатков, ДокументПолучения = &ДокументОснование" +
	?(СкладыВТабличнойЧасти, "", "
	|                                                       И Склад = &Склад") + ") КАК Остатки
	|ПО
	|	ДокТовары.Номенклатура = Остатки.Номенклатура" + 
	?(ТабличнаяЧасть = Товары, "
	| И ДокТовары.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	| И ДокТовары.СерияНоменклатуры          = Остатки.СерияНоменклатуры	", "") + " 
	|
	|ГДЕ
	|	ДокТовары.Ссылка = &ДокументОснование
	|	И Остатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТовары.Номенклатура" +
	?(ТабличнаяЧасть = Товары, ",
	|   ДокТовары.ЕдиницаИзмерения,
	|	ДокТовары.СерияНоменклатуры,
	|	ДокТовары.ХарактеристикаНоменклатуры", "") + 
	?(СкладыВТабличнойЧасти, ",
	|	Остатки.Склад", "") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";


	РезультатЗапроса = Запрос.Выполнить();

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ТабличнаяЧасть = Товары Тогда

			СтрокаТабличнойЧасти = Товары.Добавить();

			СтрокаТабличнойЧасти.Номенклатура               = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество                 = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии)
			                                                  *Выборка.КоэффициентЕдиницыХранения / Выборка.Коэффициент;
			СтрокаТабличнойЧасти.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент                = Выборка.Коэффициент;
			СтрокаТабличнойЧасти.СтавкаНДС                  = Выборка.СтавкаНДС;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;

			ОбработкаТабличныхЧастей.ЗаполнитьЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
		Иначе

			СтрокаТабличнойЧасти = ВозвратнаяТара.Добавить();

			СтрокаТабличнойЧасти.Номенклатура = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.Количество   = Мин(Выборка.КоличествоОстатокКомпании, Выборка.КоличествоПоСерии);

			ОбработкаТабличныхЧастей.ЗаполнитьЦенуВозвратнойТарыТабЧастиПоступление(СтрокаТабличнойЧасти, ЭтотОбъект, мВалютаРегламентированногоУчета);
			ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаТабличнойЧасти , ЭтотОбъект);
		КонецЕсли;

		СтрокаТабличнойЧасти.ПриходныйОрдер = ДокументОснование;
		Если СкладыВТабличнойЧасти Тогда
			СтрокаТабличнойЧасти.Склад          = Выборка.Склад;
		Иначе
			СтрокаТабличнойЧасти.Склад          = ДокументОснование.Склад;
		КонецЕсли;
		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);

	КонецЦикла; // Выборка.Следующий()

КонецПроцедуры // ЗаполнитьТоварыПоОснованию()

Процедура СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ)

	НоваяСтрока.СчетУчетаБУ      = СтрокаТЧ.СчетУчетаБУ;
	НоваяСтрока.СчетУчетаНУ      = СтрокаТЧ.СчетУчетаНУ;
	Если ЭтоТовары Тогда
		НоваяСтрока.СчетУчетаНДС        = СтрокаТЧ.СчетУчетаНДС;
	КонецЕсли;

КонецПроцедуры

// Заполняет табличную часть при оперативном проведении
//
Процедура ЗаполнитьТабличныеЧастиПередПроведениемУпр() Экспорт
    Перем ИспользоватьЗаказыНаПроизводство;
	
	КопияТовары = Товары.Выгрузить();
	КопияТовары.Свернуть("Номенклатура",);
	
	КопияВозвратнаяТара = ВозвратнаяТара.Выгрузить();
	КопияВозвратнаяТара.Свернуть("Номенклатура",);
	
	// Сформируем массив номенклатуры по товарам и таре для фильтров запросов.
	МассивНоменклатуры 	   = КопияТовары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатурыТара = КопияВозвратнаяТара.ВыгрузитьКолонку("Номенклатура");
	
	Для Каждого ЭлементТара Из МассивНоменклатурыТара Цикл
		МассивНоменклатуры.Добавить(ЭлементТара);
	КонецЦикла; 
	
	КопияТовары = Товары.Выгрузить();
	КопияТовары.Свернуть("ЗаказПоставщику",);
	
	КопияВозвратнаяТара = ВозвратнаяТара.Выгрузить();
	КопияВозвратнаяТара.Свернуть("ЗаказПоставщику",);
	
	// Сформируем массив заказов покупателей по товарам и таре для фильтров запросов.
	МассивЗаказов 	  = КопияТовары.ВыгрузитьКолонку("ЗаказПоставщику");
	МассивЗаказовТара = КопияВозвратнаяТара.ВыгрузитьКолонку("ЗаказПоставщику");
	
	Для Каждого ЭлементТара Из МассивЗаказовТара Цикл
		МассивЗаказов.Добавить(ЭлементТара);
	КонецЦикла; 
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Ссылка",    			Ссылка);
	Запрос.УстановитьПараметр("Сделка", 			Сделка);
    Запрос.УстановитьПараметр("Купленный", 			Перечисления.СтатусыПартийТоваров.Купленный);
	Запрос.УстановитьПараметр("ДатаОстатков", 		ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект));
	Запрос.УстановитьПараметр("МассивЗаказов", 		МассивЗаказов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	ИспользоватьЗаказыНаПроизводство = УправлениеЗаказами.ИспользоватьЗаказыНаПроизводство();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателей.Номенклатура,
	|	РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры,
	|	ВЫБОР КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя ИЛИ
	|		РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ВнутреннийЗаказ Тогда
	|		ЗаказыПокупателейОстатки.СтатусПартии
	|	ИНАЧЕ &Купленный 
	|	КОНЕЦ КАК СтатусПартии,
	|	РазмещениеЗаказовПокупателей.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателей.ЗаказПоставщику,
	|	ВЫБОР КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя Тогда
	|		Естьnull(ЗаказыПокупателейОстатки.КоличествоОстаток,0)
	|	КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ВнутреннийЗаказ ТОГДА
	|		Естьnull(ВнутренниеЗаказыОстатки.КоличествоОстаток,0)"
	+ ?(ИспользоватьЗаказыНаПроизводство, "
	|	КОГДА РазмещениеЗаказовПокупателей.ЗаказПокупателя ССЫЛКА Документ.ЗаказНаПроизводство ТОГДА
	|		Естьnull(ПотребностиЗаказовНаПроизводствоОстатки.КоличествоОстаток,0)",
		"")
	+ "
	|	ИНАЧЕ 0 КОНЕЦ КАК Количество,
	|	РазмещениеЗаказовПокупателей.КоличествоОстаток КАК Размещение,
	|   Естьnull(ОстаткиРезерв.КоличествоОстаток,0)  КАК Резерв
	|ИЗ  РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 И ЗаказПоставщику В (&МассивЗаказов)) КАК РазмещениеЗаказовПокупателей
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиРезерв
	|	ПО ОстаткиРезерв.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ОстаткиРезерв.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ОстаткиРезерв.ДокументРезерва = РазмещениеЗаказовПокупателей.ЗаказПокупателя
    |ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ЗаказыПокупателейОстатки
	|	ПО ЗаказыПокупателейОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ЗаказыПокупателейОстатки.ЗаказПокупателя = РазмещениеЗаказовПокупателей.ЗаказПокупателя
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ВнутренниеЗаказыОстатки
	|	ПО ВнутренниеЗаказыОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ВнутренниеЗаказыОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ВнутренниеЗаказыОстатки.ВнутреннийЗаказ = РазмещениеЗаказовПокупателей.ЗаказПокупателя "
	+ ?(ИспользоватьЗаказыНаПроизводство, "
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПотребностиЗаказовНаПроизводство.Остатки(&ДатаОстатков,Номенклатура В (&МассивНоменклатуры)
	|			 ) КАК ПотребностиЗаказовНаПроизводствоОстатки
	|	ПО ПотребностиЗаказовНаПроизводствоОстатки.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура 
	|	И  ПотребностиЗаказовНаПроизводствоОстатки.ХарактеристикаНоменклатуры = РазмещениеЗаказовПокупателей.ХарактеристикаНоменклатуры
	|	И  ПотребностиЗаказовНаПроизводствоОстатки.ЗаказНаПроизводство = РазмещениеЗаказовПокупателей.ЗаказПокупателя",
		"");
	
	Таблица = Запрос.Выполнить().Выгрузить();

	Для Каждого Строка Из Таблица Цикл
		ПотребностьЗаказа = Макс(Строка.Количество - Строка.Резерв,0);
		Строка.Количество = Мин(ПотребностьЗаказа, Строка.Размещение);
	КонецЦикла;
	
	// Заполним массив, хранящий две таблицы значений, в которых задано распределение по
	// заказам покупателей для товаров и возвратной тары
	МассивТаблицСтрок = Новый Массив(2);

	Для Сч = 0 По 1 Цикл

		Если Сч = 0 Тогда
			ТабличнаяЧасть = Товары;
			ЭтоТовары = Истина;
		Иначе
			ТабличнаяЧасть = ВозвратнаяТара;
			ЭтоТовары = Ложь;
		КонецЕсли;

		ТаблицаТЧ = ТабличнаяЧасть.Выгрузить();
		ТаблицаТЧ.Колонки.Добавить("КоличествоЕдиницХранения");

		МассивТаблицСтрок[Сч] = ТабличнаяЧасть.Выгрузить();
		МассивТаблицСтрок[Сч].Очистить();
		МассивТаблицСтрок[Сч].Колонки.Добавить("ИндексИсходнойСтроки");
		МассивТаблицСтрок[Сч].Колонки.Добавить("СкладРозничный");

		Для Каждого СтрокаТЧ Из ТаблицаТЧ Цикл

			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗаказПоставщику) Тогда
				Продолжить;
			КонецЕсли; 

			// Пересчитаем в единицы хранения
			Если ЭтоТовары Тогда
				СтрокаТЧ.КоличествоЕдиницХранения =
					Окр(СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент / СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 3);
			Иначе
				СтрокаТЧ.КоличествоЕдиницХранения = СтрокаТЧ.Количество;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", 	СтрокаТЧ.Номенклатура);
            СтруктураПоиска.Вставить("ЗаказПоставщику", СтрокаТЧ.ЗаказПоставщику);

			Если ЭтоТовары Тогда
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТЧ.ХарактеристикаНоменклатуры);
			Иначе
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			КонецЕсли; 

			НайденныеСтроки = Таблица.НайтиСтроки(СтруктураПоиска);

			// Погашаем количество в таблице
			КоличествоОсталосьПогасить = СтрокаТЧ.КоличествоЕдиницХранения;
			СуммаОсталосьПогасить      = СтрокаТЧ.Сумма;

			// Погашаем количество в таблице, записывая способ списания
			Для Каждого Строка Из НайденныеСтроки Цикл

				Если КоличествоОсталосьПогасить <= 0 Тогда
					Прервать;
				КонецЕсли;

				Если Строка.Количество <= 0 Тогда
					Продолжить;
				КонецЕсли;

				Если Строка.Количество >= КоличествоОсталосьПогасить Тогда
					КоэффСписания = КоличествоОсталосьПогасить / Строка.Количество ;
				Иначе
					КоэффСписания = 1;
				КонецЕсли;

				СписанноеКоличество = Окр(Строка.Количество  * КоэффСписания, 3, РежимОкругления.Окр15как20);
				Если ЭтоТовары Тогда
                	СписанноеКоличество_ВЕдиницахДокумента = Окр(СписанноеКоличество * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент,3);
				Иначе
					СписанноеКоличество_ВЕдиницахДокумента = СписанноеКоличество;
				КонецЕсли;
				
				// Добавляем строку с данными о распределенном количестве
				НоваяСтрока = МассивТаблицСтрок[Сч].Добавить();
				
				НоваяСтрока.ИндексИсходнойСтроки = ТаблицаТЧ.Индекс(СтрокаТЧ);
				НоваяСтрока.Номенклатура     	 = СтрокаТЧ.Номенклатура;
				НоваяСтрока.Количество 			 = СписанноеКоличество_ВЕдиницахДокумента;
				
				Если ЭтоТовары Тогда
					НоваяСтрока.ЕдиницаИзмерения 			= СтрокаТЧ.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент 				= СтрокаТЧ.Коэффициент;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТЧ.ХарактеристикаНоменклатуры;
					НоваяСтрока.СерияНоменклатуры 			= СтрокаТЧ.СерияНоменклатуры;
					НоваяСтрока.СтавкаНДС           		= СтрокаТЧ.СтавкаНДС;
					НоваяСтрока.КоличествоМест 				=
						?(СтрокаТЧ.Коэффициент <> 0,
							СписанноеКоличество * НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент,
							0);
				КонецЕсли;
				
				СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ);
				
				КоэффПогашения 				= СписанноеКоличество / КоличествоОсталосьПогасить;
				
				НоваяСтрока.Цена 			= СтрокаТЧ.Цена;
				НоваяСтрока.Сумма 			= Окр(СуммаОсталосьПогасить * КоэффПогашения, 2, 1);
				НоваяСтрока.Заказ 			= Строка.ЗаказПокупателя;
                НоваяСтрока.ЗаказПоставщику = Строка.ЗаказПоставщику;

				КоличествоОсталосьПогасить 	= КоличествоОсталосьПогасить - СписанноеКоличество;
				СуммаОсталосьПогасить 		= СуммаОсталосьПогасить - НоваяСтрока.Сумма;

				// Уменьшаем количество в исходной строке
				Если ЭтоТовары Тогда
					СтрокаТЧ.Количество = Окр((СтрокаТЧ.КоличествоЕдиницХранения - СписанноеКоличество) * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / СтрокаТЧ.Коэффициент,3);
				Иначе
					СтрокаТЧ.Количество = СтрокаТЧ.КоличествоЕдиницХранения - СписанноеКоличество;
				КонецЕсли;
				
				// Уменьшаем количество в строке остатков
				Строка.Количество = Строка.Количество - СписанноеКоличество;

			КонецЦикла;
			
			Если КоличествоОсталосьПогасить > 0 Тогда

				// Добавляем строку с данными о распределенном количестве
				НоваяСтрока = МассивТаблицСтрок[Сч].Добавить();
				
				НоваяСтрока.ИндексИсходнойСтроки = ТаблицаТЧ.Индекс(СтрокаТЧ);
				НоваяСтрока.Номенклатура 		 = СтрокаТЧ.Номенклатура;
				НоваяСтрока.Количество 			 = КоличествоОсталосьПогасить;

				Если ЭтоТовары Тогда
					НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТЧ.ХарактеристикаНоменклатуры;
					НоваяСтрока.СерияНоменклатуры 			= СтрокаТЧ.СерияНоменклатуры;
					НоваяСтрока.СтавкаНДС           		= СтрокаТЧ.СтавкаНДС;
					НоваяСтрока.ЕдиницаИзмерения    		= СтрокаТЧ.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент         		= СтрокаТЧ.Коэффициент;
					НоваяСтрока.Количество 					= Окр(НоваяСтрока.Количество * СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / НоваяСтрока.Коэффициент ,3);
				КонецЕсли;
				
				СкопироватьРеквизитыРегл(ЭтоТовары, НоваяСтрока, СтрокаТЧ);
				
				НоваяСтрока.Цена 			= СтрокаТЧ.Цена;
				НоваяСтрока.СкладРозничный  = Ложь;
				НоваяСтрока.Сумма 			= Окр(СуммаОсталосьПогасить, 2, 1);
				НоваяСтрока.ЗаказПОставщику = СтрокаТЧ.ЗаказПоставщику;

			КонецЕсли; 

		КонецЦикла; // по строкам
		
	КонецЦикла; // по табличным частям

	// Изменяем табличную часть
	Для Сч = 0 По 1 Цикл
		
		Если Сч = 0 Тогда
			ТабличнаяЧасть = Товары;
			ЭтоТовары = Истина;
		Иначе
			ТабличнаяЧасть = ВозвратнаяТара;
			ЭтоТовары = Ложь;
		КонецЕсли;

		ТекПользователь 	= глЗначениеПеременной("глТекущийПользователь");
		ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
		
		ЕстьРеквизитПроцентСкидкиНаценки 		= Ложь;
		ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
		
		// Серийные номера используются только для товаров.
		СтруктДанныеСерНомера 	= ?(Сч = 0, УчетСерийныхНомеров.СформироватьИсходнуюТаблицуСерийныйНомеров(Товары, СерийныеНомера), Неопределено);
		ТекИндексИсходнойСтроки = Неопределено;
		
		Для Каждого Строка Из МассивТаблицСтрок[Сч] Цикл

			// Если строка с таким индексом уже обрабатывалась, то добавляем новую
			Если ТекИндексИсходнойСтроки = Строка.ИндексИсходнойСтроки Тогда
				
				Стр 				= ТабличнаяЧасть[Строка.ИндексИсходнойСтроки];
				РедактируемаяСтрока = ТабличнаяЧасть.Добавить();
				
				РедактируемаяСтрока.Номенклатура = Стр.Номенклатура;
				
				Если ЭтоТовары Тогда
					
					РедактируемаяСтрока.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры;
					РедактируемаяСтрока.СерияНоменклатуры		   = Стр.СерияНоменклатуры;
					РедактируемаяСтрока.СтавкаНДС 				   = Стр.СтавкаНДС;
					
					УчетСерийныхНомеров.КорректироватьТабЧастьСерийныеНомера(СтруктДанныеСерНомера, Строка.ИндексИсходнойСтроки, Стр.Количество, РедактируемаяСтрока, Строка.Количество);
					
				КонецЕсли;
				
			Иначе
				
				РедактируемаяСтрока = ТабличнаяЧасть[Строка.ИндексИсходнойСтроки];
				
			КонецЕсли; 
			
			РедактируемаяСтрока.Заказ 			= Строка.Заказ;
			РедактируемаяСтрока.ЗаказПоставщику = Строка.ЗаказПоставщику;
			
			Если РедактируемаяСтрока.Количество = Строка.Количество Тогда
				Продолжить;
			КонецЕсли;

			РедактируемаяСтрока.Количество = Строка.Количество;

			Если ЭтоТовары Тогда
				
				РедактируемаяСтрока.СтавкаНДС = Строка.СтавкаНДС;
				
				Если Строка.СкладРозничный = Истина Тогда
					РедактируемаяСтрока.Цена = Строка.Цена;
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(РедактируемаяСтрока, ЭтотОбъект);
				Иначе
					РедактируемаяСтрока.Сумма = Строка.Сумма;
					ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(РедактируемаяСтрока, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
				КонецЕсли; 
				
				РедактируемаяСтрока.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
				РедактируемаяСтрока.Коэффициент      = Строка.Коэффициент;
				
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(РедактируемаяСтрока, ЭтотОбъект);
				
			Иначе
				
				РедактируемаяСтрока.Сумма = Строка.Сумма;
				РедактируемаяСтрока.Цена  =
					?(РедактируемаяСтрока.Количество <> 0, РедактируемаяСтрока.Сумма/РедактируемаяСтрока.Количество, 0);
				
			КонецЕсли;

			ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерТабЧасти(РедактируемаяСтрока, ЭтотОбъект);

			СкопироватьРеквизитыРегл(ЭтоТовары, РедактируемаяСтрока, Строка);

			ТекИндексИсходнойСтроки = Строка.ИндексИсходнойСтроки;

		КонецЦикла; // по строкам 
		
	КонецЦикла; // по табличным частям
	
    Товары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,Цена,СтавкаНДС,Заказ,Склад,ПриходныйОрдер,ЗаказПоставщику,КлючСвязи,ОтражениеВУСН,СчетУчетаБУ,СчетУчетаНДС, СчетУчетаНУ","Количество,КоличествоМест,Сумма,СуммаНДС");
	ВозвратнаяТара.Свернуть("Номенклатура,Цена,Заказ,Склад,ПриходныйОрдер,ЗаказПоставщику, СчетУчетаБУ,СчетУчетаНУ","Количество,Сумма");

	УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	
КонецПроцедуры // ЗаполнитьТабличныеЧастиПередПроведениемУпр()

// Процедура выполняет заполнение ТЧ "Товары" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьТоварыПоОснованиюРеализация(ДокументОснование) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КурсВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьДокумента,
	|	Док.Ссылка.УчитыватьНДС,
	|	Док.Ссылка.СуммаВключаетНДС,
	|	Док.Номенклатура,
	|	Док.ЕдиницаИзмерения,
	|	Док.ЕдиницаИзмеренияМест,
	|	Док.Коэффициент,
	|	Док.СтавкаНДС,
	|	Док.Количество,
	|	Док.КоличествоМест,
	|	Док.Сумма,
	|	Док.ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|	И (НЕ Док.Номенклатура.Услуга)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Товары.Добавить();

		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.КоличествоМест       = Выборка.КоличествоМест;
		СтрокаТабличнойЧасти.ЕдиницаИзмерения     = Выборка.ЕдиницаИзмерения;
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмеренияМест;
		СтрокаТабличнойЧасти.Коэффициент          = Выборка.Коэффициент;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;

		// Т.к. в Реализации могла быть скидка. то цену рассчитываем от суммы
		СтрокаТабличнойЧасти.Сумма                = Выборка.Сумма;

		// Пересчитаем сумму в валюту документа (может отличаться от валюты основания).
		Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента, 
		                   Выборка.КурсДокумента, Курс,
		                   Выборка.КратностьДокумента, Кратность);

		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Сумма,
		                                 Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
		                                 Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
		                                 УчитыватьНДС,
		                                 СуммаВключаетНДС,
		                                 УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Товары");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		СтрокаТабличнойЧасти.СерияНоменклатуры          = Выборка.СерияНоменклатуры;
        СтрокаТабличнойЧасти.ОтражениеВУСН 				= Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТоварыПоОснованиюРеализация()

// Процедура выполняет заполнение ТЧ "Услуги" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьУслугиПоОснованиюРеализация(ДокументОснование) Экспорт
    Курс = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	Кратность = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КурсВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсДокумента,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВалютаДокумента = Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			ТОГДА Док.Ссылка.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьДокумента,
	|	Док.Ссылка.УчитыватьНДС,
	|	Док.Ссылка.СуммаВключаетНДС,
	|	Док.Номенклатура,
	|	Док.Содержание,
	|	Док.СтавкаНДС,
	|	Док.Количество,
	|	Док.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|	И Док.Номенклатура.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.НомерСтроки";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЕстьРеквизитПроцентСкидкиНаценки = Ложь;
	ПересчитыватьСкидку = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку");
	ЕстьРеквизитПроцентАвтоматическихСкидок = Ложь;	
	
	Пока Выборка.Следующий() Цикл

		СтрокаТабличнойЧасти = Услуги.Добавить();

		СтрокаТабличнойЧасти.Номенклатура         = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.Содержание           = Выборка.Содержание;
		СтрокаТабличнойЧасти.Количество           = Выборка.Количество;
		СтрокаТабличнойЧасти.СтавкаНДС            = Выборка.СтавкаНДС;

		// Т.к. в Реализации могла быть скидка. то цену рассчитываем от суммы
		СтрокаТабличнойЧасти.Сумма                = Выборка.Сумма;

		// Пересчитаем сумму в валюту документа (может отличаться от валюты основания).
		Сумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента, 
		                   Выборка.КурсДокумента, Курс,
		                   Выборка.КратностьДокумента, Кратность);

		СтрокаТабличнойЧасти.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Сумма,
		                                 Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
		                                 Выборка.УчитыватьНДС И Выборка.СуммаВключаетНДС,
		                                 УчитыватьНДС,
		                                 СуммаВключаетНДС,
		                                 УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));

		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ТекПользователь,,ЕстьРеквизитПроцентСкидкиНаценки,ПересчитыватьСкидку,ЕстьРеквизитПроцентАвтоматическихСкидок,"Услуги");
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);

        СтрокаТабличнойЧасти.ОтражениеВУСН 				= Перечисления.ОтражениеВУСН.Принимаются;
		
		СтрокаТабличнойЧасти.СтатьяЗатрат = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
	
		СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;

		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьУслугиПоОснованиюРеализация()

// Процедура выполняет заполнение ТЧ "Возвратная тара" по документу-основанию Реализация.
// При заполнении копируется состав документа.
//
// Параметры:
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьВозвратнуюТаруПоОснованиюРеализация(ДокументОснование) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Док.Ссылка.КурсВзаиморасчетов,
	|	Док.Ссылка.КратностьВзаиморасчетов,
	|	Док.Номенклатура,
	|	Док.Количество,
	|	Док.Цена
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК Док
	|ГДЕ
	|	Док.Ссылка = &ДокументОснование
	|";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаВозвратнойТары = ВозвратнаяТара.Добавить();

		СтрокаВозвратнойТары.Номенклатура     = Выборка.Номенклатура;
		СтрокаВозвратнойТары.Количество       = Выборка.Количество;
		СтрокаВозвратнойТары.Цена             = Выборка.Цена;

		// Пересчитаем цену в валюту взаиморасчетов (в документах договоры могут отличаться).
		Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаВозвратнойТары.Цена, 
		                  Выборка.ВалютаВзаиморасчетов, ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                  Выборка.КурсВзаиморасчетов, КурсВзаиморасчетов,
		                  Выборка.КратностьВзаиморасчетов, КратностьВзаиморасчетов);

		ОбработкаТабличныхЧастей.РассчитатьСуммуВозвратнойТарыТабЧасти(СтрокаВозвратнойТары, ЭтотОбъект);

	КонецЦикла;

КонецПроцедуры // ЗаполнитьТоварыПоОснованиюРеализация()

// Процедура очищает розничный/НТТ склад в шапке и таб. части "Оборудование", при виде операции "Оборудование".
// Поступление оборудования возможно только на оптовый склад.
//
//	Параметры:
//		ТолькоПроверка - если Ложь, то выполняется очистка неверно указанного склада,
//						 иначе только выдача сообщения.
//	Возврат:
//		Истина - были обнаружены ошибки, иначе - Ложь.
//
Функция ОчиститьСкладПриВидеОперацииОборудование(ТолькоПроверка = Истина) Экспорт

	// Оборудование может поступать только на оптовый склад
	ФлагСообщали = Ложь;
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		Возврат ФлагСообщали;
	КонецЕсли;
	
	Если ВидПоступления <> Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		Если НЕ ФлагСообщали Тогда
			Сообщить("При виде операции ""Оборудование"" вид поступления может быть только на склад.", СтатусСообщения.ОченьВажное);
			ФлагСообщали = Истина;
		КонецЕсли;
		Если НЕ ТолькоПроверка Тогда
			ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		КонецЕсли;
	КонецЕсли;
	
	ТекстСообщения = "При виде операции ""Оборудование"" поступление возможно только на оптовый склад!"
		+ ?(ТолькоПроверка, "", Символы.ПС + "Склад будет очищен!");
		
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И ЗначениеЗаполнено(СкладОрдер)
	   И (ТипЗнч(СкладОрдер) <> Тип("СправочникСсылка.Склады")
	   ИЛИ СкладОрдер.ВидСклада <> Перечисления.ВидыСкладов.Оптовый) Тогда
		Если НЕ ФлагСообщали Тогда
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
			ФлагСообщали = Истина;
		КонецЕсли;
		Если НЕ ТолькоПроверка Тогда
			СкладОрдер = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
		
	// Заполнить склад в табличных частях
	Если мУказаниеСкладовВТЧ Тогда
		Для Каждого СтрокаТЧ Из Оборудование Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Склад)
				  И СтрокаТЧ.Склад.ВидСклада <> Перечисления.ВидыСкладов.Оптовый Тогда
				Если НЕ ТолькоПроверка Тогда
					СтрокаТЧ.Склад = Справочники.Склады.ПустаяСсылка();
				КонецЕсли;
				Если НЕ ФлагСообщали Тогда
					Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
					ФлагСообщали = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ФлагСообщали;
	
КонецФункции // ОчиститьСкладПриВидеОперацииОборудование()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	//начало изменений БП 04 
	Если РезультатЗапросаПоТоварам = Неопределено Тогда
		возврат Новый ТаблицаЗначений;
	ИначеЕсли ТипЗнч(РезультатЗапросаПоТоварам) = Тип("РезультатЗапроса") Тогда
		ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();	
	Иначе	
		ТаблицаТоваров  = РезультатЗапросаПоТоварам.Скопировать();
	КонецЕсли;	
	//конец изменений БП 04 	
	//ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	// Создаем колонку "Стоимость" и копируем в нее колонку "Сумма"
	ТаблицаТоваров.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Сумма") , "Стоимость");
	
	//m.ionov@a-prof.ru 16.02.2014
	Если Не ТаблицаТоваров.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("УЗ_СтоимостьРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("УЗ_СуммаРегл") , "УЗ_СтоимостьРегл");	
		
		ТаблицаТоваров.Колонки.Добавить("УЗ_СуммаБезНДСРегл",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ТаблицаТоваров.Колонки.Добавить("УЗ_СуммаБезНДСВал",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	ТаблицаТоваров.Колонки.Добавить("КоличествоМинус", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	//m.ionov@a-prof.ru 18.12.2013
	//Добавим в таблицу по товарам Качество
	ТаблицаТоваров.Колонки.Добавить("Качество");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УЗ_УстановкаКачестваНоменклатуры.Качество,
	               |	УЗ_УстановкаКачестваНоменклатуры.ВидНоменклатуры
	               |ИЗ
	               |	РегистрСведений.УЗ_УстановкаКачестваНоменклатуры КАК УЗ_УстановкаКачестваНоменклатуры
	               |ГДЕ
	               |	УЗ_УстановкаКачестваНоменклатуры.ВидНоменклатуры В(&ВидНоменклатуры)";
//конец изменений 				   
	//----m.ionov@a-prof.ru---
//начало изменений Ожиганов 31.05.2015 немножко оптимизируем 
ПРГПодменятьКачество  = (ТаблицаТоваров.Количество() > 0) и (ТаблицаТоваров.Колонки.Найти("ВидНоменклатуры")<>Неопределено);
//конец изменений 
Если ПРГПодменятьКачество Тогда
	Запрос.УстановитьПараметр("ВидНоменклатуры",ТаблицаТоваров.ВыгрузитьКОлонку("ВидНоменклатуры"));
	ТаблКачеств = Запрос.Выполнить().Выгрузить();
	ТаблКачеств.Индексы.Добавить("ВидНоменклатуры");
КонецЕсли;	

	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			СтрокаТаблицы.КоличествоМинус = - СтрокаТаблицы.Количество;
		КонецЕсли;
		
//Бирюков Качество для складов с отметкой "Склад копекера" заполняется автоматически
		//начало изменений Ожиганов 31.05.2015 немножко оптимизируем 
		//Если ЗначениеЗаполнено(СкладОрдер) И (СкладОрдер.ПРГ_СкладКопекера) Тогда 
		Если ЗначениеЗаполнено(СкладОрдер) И (СтруктураШапкиДокумента.ПРГ_СкладКопекера) Тогда 
			СтрокаТаблицы.Качество = Справочники.Качество.Новый;
		//конец изменений 	
		Иначе
			//m.ionov@a-prof.ru 18.12.2013
			//начало изменений Ожиганов 31.05.2015 немножко оптимизируем 
			Если ПРГПодменятьКачество Тогда
				Результат = ТаблКачеств.Найти(СтрокаТаблицы.ВидНоменклатуры,"ВидНоменклатуры");
			//Запрос.УстановитьПараметр("ВидНоменклатуры", СтрокаТаблицы.Номенклатура.ВидНоменклатуры);
			//Результат = Запрос.Выполнить().Выбрать();
			//Если Результат.Следующий() Тогда
			//конец изменений 	
				Если Результат <> Неопределено Тогда
					СтрокаТаблицы.Качество = Результат.Качество;
				Иначе 
					СтрокаТаблицы.Качество = Справочники.Качество.Новый;
				КонецЕсли;	
			Иначе
				СтрокаТаблицы.Качество = Справочники.Качество.Новый;
			КонецЕсли;
		//----m.ionov@a-prof.ru---
		КонецЕсли;
	
	    //m.ionov@a-prof.ru 20.02.2014
		Если УЗ_НесколькоСФ и Не ТаблицаТоваров.Колонки.Найти("СчетФактура") = Неопределено Тогда
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетФактура) Тогда
				СтрокаТаблицы.СчетФактура = Ссылка;
			КонецЕсли;
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		
	КонецЦикла;
	

	// Порядок вызова в данном случае важен
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуОбъектовСтроительства(РезультатЗапросаПоОбъектамСтроительства, СтруктураШапкиДокумента)

	ТаблицаОбъектовСтроительства = РезультатЗапросаПоОбъектамСтроительства.Выгрузить();
	
	ТаблицаОбъектовСтроительства.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаОбъектовСтроительства.ЗагрузитьКолонку(ТаблицаОбъектовСтроительства.ВыгрузитьКолонку("Сумма") , "Стоимость");
	ТаблицаОбъектовСтроительства.Колонки.Добавить("КоличествоМинус", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаОбъектовСтроительства.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаОбъектовСтроительства.ЗаполнитьЗначения(1, "Количество");

	ТаблицаОбъектовСтроительства.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого СтрокаТаблицы из ТаблицаОбъектовСтроительства Цикл
		СтрокаТаблицы.Цена  = СтрокаТаблицы.Сумма;
	КонецЦикла;
	
	ПодготовитьТаблицуТоваровРегл(ТаблицаОбъектовСтроительства, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаОбъектовСтроительства,  СтруктураШапкиДокумента);

	Возврат ТаблицаОбъектовСтроительства;

КонецФункции // ПодготовитьТаблицуОбъектовСтроительства()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)

	ЕстьЦена = ТаблицаТоваров.Колонки.Найти("Цена") <> Неопределено;

	ТаблицаТоваров.Колонки.Добавить("СуммаПродажная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТоваров, "Склад", "ВидСкладаРазмещения");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
		                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам, "ВидСкладаРазмещения");
	КонецЕсли;

	ТаблицаТоваров.Колонки.Добавить("ЦенаВВалютеЗаказа"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТоваров.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаУпр"           , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("НДСУпр"             , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	// Надо рассчитать стоимость без НДС.
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл

		// Считаем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;
		
		//m.ionov@a-prof.ru 16.02.2014
		Если УЗ_ПоказыватьСуммыВРублях и Не ТаблицаТоваров.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
			
			СтоимостьСНДС  = СтрокаТаблицы.УЗ_СтоимостьРегл + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.УЗ_НДСРегл, 0);
			
			СтоимостьСНДСВал  = СтрокаТаблицы.Стоимость + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.УЗ_НДСВал, 0);
			
			Если СтруктураШапкиДокумента.НеВключатьНДСВСтоимостьПартий 
				И НЕ (СтруктураШапкиДокумента.НДСВключенВСтоимость) 
				И НЕ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				СтрокаТаблицы.Стоимость = СтрокаТаблицы.УЗ_СтоимостьРегл - ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.УЗ_НДСРегл, 0);
			Иначе
				СтрокаТаблицы.Стоимость = СтоимостьСНДС;
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.УчетАгентскогоНДС Тогда
				СтоимостьДляВзаиморасчетов = СтоимостьСНДС - СтрокаТаблицы.УЗ_НДСРегл;
				СтоимостьДляВзаиморасчетовВал = СтоимостьСНДСВал - СтрокаТаблицы.УЗ_НДСВал;
			Иначе
				СтоимостьДляВзаиморасчетов = СтоимостьСНДС;
				СтоимостьДляВзаиморасчетовВал = СтоимостьСНДСВал;
			КонецЕсли;
			
			СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьДляВзаиморасчетовВал, ВалютаДокумента, 
				СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
				КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
			
			// Суммы пересчитаем в валюту упр. учета
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьДляВзаиморасчетов, мВалютаРегламентированногоУчета,
				СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 1, 
				СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
				1, 
				СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.УЗ_НДСРегл, мВалютаРегламентированногоУчета,
				СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 1, 
				СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
				1, 
				СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, мВалютаРегламентированногоУчета,
				СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
				1,
				СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
				1,
				СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
		Иначе
		//----m.ionov@a-prof.ru---	
			/// Кунов О.В., 28.11.2014 - 33563
			СтоимостьВВалютеВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента, 
				СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
				КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
			НДСВВалютеВзаиморасчетов = ?(УчитыватьНДС И Не СуммаВключаетНДС, МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, ВалютаДокумента, 
				СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
				КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов),
			0);
			///
			
			СтоимостьСНДС  = СтрокаТаблицы.Стоимость + ?(УчитыватьНДС И Не СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
			
			Если СтруктураШапкиДокумента.НеВключатьНДСВСтоимостьПартий 
				И НЕ (СтруктураШапкиДокумента.НДСВключенВСтоимость) 
				И НЕ СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				СтрокаТаблицы.Стоимость = СтрокаТаблицы.Стоимость - ?(УчитыватьНДС И СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
			Иначе
				СтрокаТаблицы.Стоимость = СтоимостьСНДС;
			КонецЕсли;
			
			/// Кунов О.В., 28.11.2014 - 33563
			Если СтруктураШапкиДокумента.УчетАгентскогоНДС Тогда
				СтоимостьДляВзаиморасчетов = СтоимостьСНДС - СтрокаТаблицы.НДС;
				СтрокаТаблицы.СуммаВзаиморасчетов = СтоимостьВВалютеВзаиморасчетов;
			Иначе
				СтоимостьДляВзаиморасчетов = СтоимостьСНДС;
				СтрокаТаблицы.СуммаВзаиморасчетов = СтоимостьВВалютеВзаиморасчетов + НДСВВалютеВзаиморасчетов;
			КонецЕсли;
			//СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьДляВзаиморасчетов, ВалютаДокумента, 
			//СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
			//КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
			///
			
			// Суммы пересчитаем в валюту упр. учета
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтоимостьДляВзаиморасчетов, ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.НДСУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.НДС, ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			СтруктураШапкиДокумента.КратностьДокумента, 
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
			СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
			СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
			СтруктураШапкиДокумента.КурсДокумента,
			СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
			СтруктураШапкиДокумента.КратностьДокумента,
			СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
			
		КонецЕсли;
									 
		// Цена нужна для проведения по заказам поставщиков, поэтому ее необходимо пересчитать в валюту заказа
		Если ЕстьЦена И ЗначениеЗаполнено(СтруктураШапкиДокумента.Сделка) 
			И (ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")
		       ИЛИ ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
			СтруктураКурсаВалютыЗаказа = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаЗаказа, Дата);
			СтрокаТаблицы.Цена = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, СтруктураШапкиДокумента.ВалютаДокумента,
										 СтруктураШапкиДокумента.ВалютаЗаказа,
										 СтруктураШапкиДокумента.КурсДокумента,
										 СтруктураКурсаВалютыЗаказа.Курс, 
										 СтруктураШапкиДокумента.КратностьДокумента,
										 СтруктураКурсаВалютыЗаказа.Кратность);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТоваровУпр()

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаТоваров.Колонки.Добавить("СуммаРегл",        Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.Колонки.Добавить("ПроводкаСумма",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТоваров.Колонки.Добавить("ПроводкаСуммаНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	ЕстьСкладВТабличнойЧасти = (НЕ ТаблицаТоваров.Колонки.Найти("Склад") = Неопределено);
	Если ЕстьСкладВТабличнойЧасти Тогда
		ТаблицаТоваров.Колонки.Добавить("СкладПроводок", Новый описаниеТипов("СправочникСсылка.Склады"));
	КонецЕсли;
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, Дата);

	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
        Если ЕстьСкладВТабличнойЧасти Тогда
			Если СтруктураШапкиДокумента.СкладВТабличнойЧасти Тогда
				Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
					СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.Склад;
				ИначеЕсли СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
					// если склад в табличной части не заполнен - тогда переписываем его из ордера
					Если СтрокаТаблицы.Склад = Неопределено тогда
						СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.ПриходныйОрдерСклад;
					Иначе
						СтрокаТаблицы.СкладПроводок = СтрокаТаблицы.Склад;
					КонецЕсли;

				КонецЕсли;
			Иначе
				Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
					СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладОрдер;
				ИначеЕсли ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
					Если СтруктураШапкиДокумента.Свойство("СкладПриходногоОрдера") Тогда
						СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладПриходногоОрдера;
					Иначе
						СтрокаТаблицы.СкладПроводок = СтруктураШапкиДокумента.СкладОрдер.Склад;	
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 

		
		НДС   = СтрокаТаблицы.НДС;
		Сумма = ?(СуммаВключаетНДС, СтрокаТаблицы.Стоимость - НДС, СтрокаТаблицы.Стоимость);

		Если СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.ПроводкаСумма    = Сумма;
			СтрокаТаблицы.ПроводкаСуммаНДС = НДС;
		Иначе
			
			//m.ionov@a-prof.ru 16.02.2014
			Если УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаТоваров.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
				СтрокаТаблицы.ПроводкаСумма    = ?(СуммаВключаетНДС, СтрокаТаблицы.УЗ_СтоимостьРегл - СтрокаТаблицы.УЗ_НДСРегл, СтрокаТаблицы.УЗ_СтоимостьРегл);	
				СтрокаТаблицы.ПроводкаСуммаНДС = СтрокаТаблицы.УЗ_НДСРегл;	
				
				//В процедуре ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации они пересчитаются  в рубли, поэтом запишем их из рублевых данных
				СтрокаТаблицы.Сумма = СтрокаТаблицы.УЗ_СуммаРегл;
				СтрокаТаблицы.НДС = СтрокаТаблицы.УЗ_НДСРегл;
				
				СтрокаТаблицы.УЗ_СуммаБезНДСВал = СтрокаТаблицы.УЗ_СуммаВал - ?(СуммаВключаетНДС, СтрокаТаблицы.УЗ_НДСВал, 0);
				
			Иначе
				//----m.ionov@a-prof.ru---
			
				СтрокаТаблицы.ПроводкаСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Сумма, СтруктураШапкиДокумента.ВалютаДокумента,
			                                 СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
			                                 СтруктураШапкиДокумента.КурсДокумента,
			                                 Данные.Курс, 
			                                 СтруктураШапкиДокумента.КратностьДокумента,
			                                 Данные.Кратность);
				СтрокаТаблицы.ПроводкаСуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(НДС, СтруктураШапкиДокумента.ВалютаДокумента,
			                                 СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
			                                 СтруктураШапкиДокумента.КурсДокумента,
			                                 Данные.Курс, 
			                                 СтруктураШапкиДокумента.КратностьДокумента,
			                                 Данные.Кратность);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы.СуммаРегл = СтрокаТаблицы.ПроводкаСумма + СтрокаТаблицы.ПроводкаСуммаНДС;  // Используется в процедурах отражения затрат

	КонецЦикла;
	
КонецПроцедуры // ПодготовитьТаблицуТоваровРегл()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();

	// Переименуем колонку "Сумма" в "Стоимость" (как в регистрах).
	ТаблицаТары.Колонки.Сумма.Имя = "Стоимость";
	ТаблицаТары.Колонки.Добавить("ВестиПартионныйУчетПоСериям", Новый ОписаниеТипов("Булево"));
	ТаблицаТары.Колонки.Добавить("ХарактеристикаНоменклатуры",  Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТары.Колонки.Добавить("СерияНоменклатуры",           Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	//начало изменений 
	Если Не ТаблицаТары.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
		ТаблицаТары.Колонки.Добавить("УЗ_СтоимостьРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ТаблицаТары.ЗагрузитьКолонку(ТаблицаТары.ВыгрузитьКолонку("УЗ_СуммаРегл") , "УЗ_СтоимостьРегл");	
	КонецЕсли;
	//конец изменений 
	
	// Порядок вызова в данном случае важен
	ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()

Процедура ПодготовитьТаблицуТарыУпр(ТаблицаТары, СтруктураШапкиДокумента)

	ТаблицаТары.Колонки.Добавить("СуммаПродажная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	ЕстьРозничныйСклад = УправлениеРозничнойТорговлей.ОпределитьНаличиеРозничногоСклада(ТаблицаТары, "Склад", "ВидСкладаРазмещения");
	Если ЕстьРозничныйСклад Тогда
		ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Дата, ТаблицаТары.ВыгрузитьКолонку("Склад"),
	                     ТаблицаТары.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

		УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТары, ТаблицаПоЦенам, "ВидСкладаРазмещения");
	КонецЕсли;

	ТаблицаТары.Колонки.Добавить("ЦенаВВалютеЗаказа"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТары.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТары.Колонки.Добавить("СуммаУпр"           , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	//начало изменений БП 04
	 ПРГ_использоватьУзРегл = УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаТары.Колонки.Найти("УЗ_СуммаРегл") = Неопределено;
	 
	//конец изменений БП 04 
	

	// Надо рассчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		// Счиатем, что поступление выписывается с теми же флагами учета НДС, что и Заказ.
		Если СтруктураШапкиДокумента.НужнаЦенаЗаказа Тогда
			СтрокаТаблицы.ЦенаВВалютеЗаказа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Цена, ВалютаДокумента, 
			                                  СтруктураШапкиДокумента.ВалютаЗаказа,
			                                  СтруктураШапкиДокумента.КурсДокумента, 
			                                  СтруктураШапкиДокумента.КурсЗаказа,
			                                  СтруктураШапкиДокумента.КратностьДокумента, 
			                                  СтруктураШапкиДокумента.КратностьЗаказа);
		КонецЕсли;
		
		//начало изменений 
		Если ПРГ_использоватьУзРегл и СтруктураШапкиДокумента.ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета  Тогда
			СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.УЗ_СтоимостьРегл;
		Иначе
			СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента, 
										 СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.КурсДокумента, 
										 КурсВзаиморасчетов, СтруктураШапкиДокумента.КратностьДокумента, КратностьВзаиморасчетов);
			
		КонецЕсли;	
		
		Если ПРГ_использоватьУзРегл и СтруктураШапкиДокумента.ВалютаУправленческогоУчета = мВалютаРегламентированногоУчета  Тогда
			
			СтрокаТаблицы.СуммаУпр = СтрокаТаблицы.УЗ_СтоимостьРегл;;

			// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
			СтрокаТаблицы.Стоимость =  СтрокаТаблицы.УЗ_СтоимостьРегл;
			
			
		Иначе
			СтрокаТаблицы.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
											 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, СтруктураШапкиДокумента.КурсДокумента, 
											 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета,
			                                 СтруктураШапкиДокумента.КратностьДокумента, 
											 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);

			// Суммы пересчитаем в валюту упр. учета. По таре считаем, что СуммаБезНДС = Сумма
			СтрокаТаблицы.Стоимость = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, ВалютаДокумента,
			                                 СтруктураШапкиДокумента.ВалютаУправленческогоУчета, 
			                                 СтруктураШапкиДокумента.КурсДокумента,
			                                 СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
			                                 СтруктураШапкиДокумента.КратностьДокумента,
			                                 СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
				
			
		КонецЕсли;
		//конец изменений 								 

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыУпр()

Процедура ПодготовитьТаблицуТарыРегл(ТаблицаТары, СтруктураШапкиДокумента)

	ТаблицаТары.Колонки.Добавить("ПроводкаСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));

	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, Дата);

	//начало изменений БП 04
	 ПРГ_использоватьУзРегл = УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаТары.Колонки.Найти("УЗ_СуммаРегл") = Неопределено;
	//конец изменений БП 04 
	
	// Надо рассчитать сумму без НДС.
	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		Если СтруктураШапкиДокумента.ВалютаДокумента  = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.ПроводкаСумма    = СтрокаТаблицы.Стоимость;
		Иначе
			//начало изменений
			Если ПРГ_использоватьУзРегл Тогда
				СтрокаТаблицы.ПроводкаСумма    = СтрокаТаблицы.УЗ_СтоимостьРегл;
				//СтрокаТаблицы.ПроводкаСуммаНДС = СтрокаТаблицы.УЗ_НДСРегл;	
				
				//В процедуре ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации они пересчитаются  в рубли, поэтом запишем их из рублевых данных
			//	СтрокаТаблицы.Сумма = СтрокаТаблицы.УЗ_СуммаРегл;
				//СтрокаТаблицы.НДС = СтрокаТаблицы.УЗ_НДСРегл;
			//СтрокаТаблицы.УЗ_СуммаБезНДСВал = СтрокаТаблицы.УЗ_СуммаВал;
			Иначе
			СтрокаТаблицы.ПроводкаСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Стоимость, СтруктураШапкиДокумента.ВалютаДокумента,
			                                 СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, 
			                                 СтруктураШапкиДокумента.КурсДокумента,
			                                 Данные.Курс, 
			                                 СтруктураШапкиДокумента.КратностьДокумента,
			                                 Данные.Кратность);
			КонецЕсли;
			//начало изменений							 
										 
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуТарыРегл()

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруОбязательныхПолейШапкиУпр(СтруктураОбязательныхПолей, СтруктураШапкиДокумента)

	// Если установлен призник "Обновлять цены поставщиков при поступлении товаров",
	// то надо обязательно указывать тип цен
	Если РегистрироватьЦеныПоставщика И СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("ТипЦен", "Для обновления цен поставщиков необходимо указывать тип цен!");
	КонецЕсли;
	
	//Вадим
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры В
		|			(ВЫБРАТЬ
		|				УЗ_УстановкаКачестваНоменклатуры.ВидНоменклатуры КАК ссылка
		|			ИЗ
		|				РегистрСведений.УЗ_УстановкаКачестваНоменклатуры КАК УЗ_УстановкаКачестваНоменклатуры
		|			ГДЕ
		|				УЗ_УстановкаКачестваНоменклатуры.Качество = ЗНАЧЕНИЕ(Справочник.Качество.HOLD))";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() тогда
			СтруктураОбязательныхПолей.Вставить("УЗ_АМ");	
		КонецЕсли;
		
	КонецЕсли;
    //ВадимКонец

КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруОбязательныхПолейШапкиРегл(СтруктураОбязательныхПолей, СтруктураШапкиДокумента)

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		Если НЕ (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия //m.ionov@a-prof.ru 19.02.2014
				И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
	 		И (ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку) 
			Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовСКонтрагентом");
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоАвансам");
		КонецЕсли;

		Если ВозвратнаяТара.Количество() > 0 Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаРасчетовПоТаре");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Выполняет проверки,которые нужны только для регл. учета
Процедура ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	СтруктураОбязательныхПолей = Новый Структура();
	ДополнитьСтруктуруОбязательныхПолейШапкиРегл(СтруктураОбязательныхПолей, СтруктураШапкиДокумента);
	ОбщегоНазначенияКлиентСервер.ПроверитьЗаполнениеВычисляемыхРеквизитовШапки(ЭтотОбъект, СтруктураОбязательныхПолей, СтруктураШапкиДокумента, Отказ, Заголовок);
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура();

	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		И НЕ СтруктураШапкиДокумента.ЗаказВТабличнойЧасти Тогда
		СтруктураОбязательныхПолей.Вставить( "Сделка", 
				"Заполните поле ""Заказ покупателя""!");
	Иначе	
		// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			И НЕ СтруктураШапкиДокумента.ЗаказВТабличнойЧасти Тогда
			СтруктураОбязательныхПолей.Вставить( "Сделка", 
				"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
				|Заполните поле ""Заказ поставщику""!");
		ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			СтруктураОбязательныхПолей.Вставить( "Сделка", 
				"По выбранному договору установлен способ ведения взаиморасчетов ""по заказам (счетам)""! 
				|Заполните поле ""Счет поставщика""!");
		КонецЕсли;
	КонецЕсли;
	
	//m.ionov@a-prof.ru 21.02.2014
	//отключили проверку заполнения договора для нескольких счетов фактур, оставим ее для других видов операций
	Если Не УЗ_НесколькоСФ Тогда
		СтруктураОбязательныхПолей.Вставить("ДоговорКонтрагента"); 
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	ДополнитьСтруктуруОбязательныхПолейШапкиУпр(СтруктураОбязательныхПолей, СтруктураШапкиДокумента);
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
	УправлениеВзаиморасчетами.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, СтруктураШапкиДокумента.ДоговорКонтрагента, СтруктураШапкиДокумента.ДоговорОрганизация, Отказ, Заголовок); //m.ionov@a-prof.ru 21.02.2014
	
	Отказ = ОчиститьСкладПриВидеОперацииОборудование(Истина) ИЛИ Отказ;
	
	Если НЕ Отказ
	      И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
	      И СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		ОбщегоНазначения.СообщитьОбОшибке( "Документ с видом операции ""В переработку"" не должен отражаться в налоговом учете.", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ Отказ
	      И СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование
	      И СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		ОбщегоНазначения.СообщитьОбОшибке( "Документ с видом операции ""Оборудование"" не может оформляться с видом поступления ""По ордеру"".", Отказ, Заголовок);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Выполняет проверки,которые нужны только для упр. учета
Процедура ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Если склад указывается в ТЧ, то в шапке он может быть не заполнен или указан неправильно,
	// это ни на что не влияет, потому что при проведении используется склад в ТЧ.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И Не СтруктураШапкиДокумента.СкладВТабличнойЧасти 
	   И СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не может осуществлять поступление на НТТ!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	ИмяТабличнойЧасти = "Товары";
	
	// Укажем, что надо проверить
	//Проверяем здесь, а не в ОбработкаПроверкиЗаполнения, т.к. эти реквизиты заполняются 
	//	в ПередЗаписью - после того как выполняется ОбработкаПроверкиЗаполнения
	СтруктураОбязательныхПолей = Новый Структура("Склад");
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(СтруктураШапкиДокумента.ВидОперации, СтруктураШапкиДокумента.ДоговорКонтрагента, "Поступление") Тогда //m.ionov@a-prof.ru 19.02.2014
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику", "Не заполнено значение реквизита ""Заказ покупателя""!");

		Иначе	
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
		КонецЕсли;
	КонецЕсли;
	
	//начало изменений
	НеПроверятьСуммы = ?(Тип("СправочникСсылка.Склады")= ТипЗнч(СкладОрдер),?(СкладОрдер.ПРГ_РазрешитьНулевыеЦены,Истина,Ложь),Ложь);
	//конец изменений 
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку и Не НеПроверятьСуммы Тогда                 
		Если ЕстьСтрокиБезЦеныБлокПроведения(ТаблицаПоТоварам) Тогда // Шевченков №51287 20160414
			СтруктураОбязательныхПолей.Вставить("Сумма");
		КонецЕсли;		
	КонецЕсли;
	
	
	//начало изменений 
	Если Не НеПроверятьСуммы тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	 КонецЕсли;	
	//конец изменений 
	
	/// Кунов О.В., 10.09.2014
	Для каждого СтрокаТовара Из ТаблицаПоТоварам Цикл
		Если СтрокаТовара.УчетПоСериям И Не ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
			ТекстОшибки = "В строке номер %НомерСтроки% табличной части ""Товары"" у номенклатуры включен учет по сериям, но серии не указано!";
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТовара.НомерСтроки);
			ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("Товары", СтрокаТовара.НомерСтроки, "Номенклатура");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ТекстПоля,, Отказ);
		КонецЕсли; 
	КонецЦикла; 
	///
	
	//m.ionov@a-prof.ru 08.10.2014
	Если ДоступенСтатусДокумента() И ЗначениеЗаполнено(СП_СтатусДокумента) Тогда
		СтруктураОбязательныхПолей.Вставить("СП_КоличествоПоНакладной");	
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
		//начало изменений Ожиганов 10.04.2015 с 0 количеством  
	Если ПРГ_СчитатьОтКоличестваНакладной Тогда
		Если СтруктураОбязательныхПолей.Свойство("Сумма") Тогда
			СтруктураОбязательныхПолей.Удалить("Сумма");
		КонецЕсли;	
		СтруктураОбязательныхПолей.Вставить("СП_Сумма");
	КонецЕсли;
	//конец изменений 

	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Здесь НТТ быть не должно.
	УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Проверка заполнения номера ГТД в серии
	УправлениеЗапасами.ПроверитьЧтоВСерииЗаполненНомерГТД(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Товары", "ЗаказПоставщику", Отказ, Заголовок);

	// Проверка наличия продажных цен на приходуемый товар.
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ,
	                                                       Заголовок, "ВидСкладаРазмещения");
														   
	УчетСерийныхНомеров.ПроверитьКоличествоСерийныхНомеровВДокументе(ЭтотОбъект, "Товары", Заголовок);

	//проверка наличия резервирования под заказ с обособленным учетом при поступлении по ордеру с правом продажи
	ПроверитьРезервИВидПоступления(ТаблицаПоТоварам, "Товары", Заголовок, Отказ);
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Процедура ПроверитьРезервИВидПоступления(Таб, ИмяТЧ, Заголовок, Отказ)
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		Для каждого Строка из Таб цикл
			Если НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда 
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Строка.ЗаказПокупателя)<>Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
		                               """ табличной части """ + ИмяТЧ + """: ";
			
			Если Строка.БезПраваПродажи=ложь И Строка.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "выбран заказ покупателя с обособленным учетом. "+
				    "Резервировать под такие заказы можно только в случае, если приходный ордер без права продажи ", Отказ, Заголовок);

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Услуги";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Сумма");

	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(СтруктураШапкиДокумента.ВидОперации, СтруктураШапкиДокумента.ДоговорКонтрагента, "Поступление") Тогда //m.ionov@a-prof.ru 19.02.2014
		СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
	КонецЕсли;

	//m.ionov@a-prof.ru 19.02.2014
	//Если УЗ_ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаСФ Тогда
	Если УЗ_НесколькоСФ Тогда
		СтруктураОбязательныхПолей.Вставить("ДоговорКонтрагента");
	КонецЕсли;
	//----m.ionov@a-prof.ru---

	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей);
	КонецЕсли;

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);

	ПроверитьЗаполнениеТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, Отказ, Заголовок);
	
	// Здесь товаров быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетТоваров(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Услуги", ТаблицаПоУслугам, Отказ, Заголовок);

	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Услуги", "ЗаказПоставщику", Отказ, Заголовок);
	
	// Проверим соответствие подразделения и оранизации.
	УправлениеЗатратами.ПроверитьПодразделениеОрганизацииВСтрокахТабЧасти(ЭтотОбъект, ТаблицаПоУслугам, "Услуги",, Отказ, Заголовок);
	
	// Проверить обязательные поля для производственных статей затрат
	Для Каждого СтрокаУслуг Из ТаблицаПоУслугам Цикл
		Если СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве
		 ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы
		 ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщехозяйственныеРасходы
		 ИЛИ СтрокаУслуг.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
		 	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
				Если СтрокаУслуг.Подразделение.Пустая() Тогда
					ОбщегоНазначения.СообщитьОбОшибке("В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": Не заполнено значение реквизита ""Подразделение""!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		 	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
				Если СтрокаУслуг.ПодразделениеОрганизации.Пустая() Тогда
					ОбщегоНазначения.СообщитьОбОшибке("В строке номер """ + СтрокаУслуг.НомерСтроки + """ табличной части ""Услуги"": Не заполнено значение реквизита ""Подразделение организации""!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Выполняет проверки,которые нужны только для регл. учета
Процедура ПроверитьЗаполнениеТабличнойЧастиУслугиРегл(ТаблицаПоУслугам, Отказ, Заголовок)
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнены значения ""Статья затрат"" (строка № " + СтрокаТаблицы.НомерСтроки + " табличной части ""Услуги"")", Отказ, Заголовок);
		Иначе
			//начало изменений БП 07 
			Если НЕ ПараметрыСеанса.НеведетсяУПРУчетВЧастиЗатратИОС и НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат.ХарактерЗатрат)  Тогда
			//конец изменений БП 07	 	
				ОбщегоНазначения.СообщитьОбОшибке("В статье затрат """ + СтрокаТаблицы.СтатьяЗатрат + """ не указан вид расхода (строка № " + СтрокаТаблицы.НомерСтроки + " табличной части ""Услуги"")", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		//m.ionov@a-prof.ru 19.02.2014
		//Если УЗ_ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаСФ Тогда
		Если УЗ_НесколькоСФ Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента)
				И (Не СтрокаТаблицы.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
				ИЛИ СтрокаТаблицы.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Указан не верный договор - должен быть с ведением взаиморасчетов в целом и без ведения по документам расчетов (строка № " + СтрокаТаблицы.НомерСтроки + " табличной части ""Услуги"")", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		//----m.ionov@a-prof.ru---
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслугиРегл()

// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвратнаяТара";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = УправлениеЗапасами.СформироватьСтруктуруОбязательныхПолейТара();

	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");

	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
	КонецЕсли;

	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;

	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей, СтруктураШапкиДокумента.ВидСклада);
	Иначе
		УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(СтруктураОбязательныхПолей);
	КонецЕсли;

	// Теперь вызовем общую процедуру проверки заполнения.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара",СтруктураОбязательныхПолей, Отказ, Заголовок);

	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь наборов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Здесь НТТ быть не должно.
	УправлениеЗапасами.ПроверитьЧтоСкладНеНТТ(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// По возвратной таре не должен вестись учет по характеристикам.
	УправлениеЗапасами.ПроверитьЧтоНетНоменклатурыСХарактеристиками(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ, Заголовок);

	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "ВозвратнаяТара", "ЗаказПоставщику", Отказ, Заголовок);

	// Проверка наличия продажных цен на приходуемый товар.
	УправлениеРозничнойТорговлей.ПроверитьЧтоДляРозничныхСкладовЗаполненаСуммаПродажная(ЭтотОбъект, "ВозвратнаяТара", ТаблицаПоТаре, Отказ,
	                                                       Заголовок, "ВидСкладаРазмещения");

		//проверка наличия резервирования под заказ с обособленным учетом при поступлении по ордеру с правом продажи
	ПроверитьРезервИВидПоступления(ТаблицаПоТаре, "Возвратная тара", Заголовок, Отказ);
	
	// Нельзя резервировать возвратную тару под заказ покупателя с обособленным учетом
	УправлениеЗаказами.ПроверитьРезервированиеТарыПодЗаказСОбособленнымУчетом(ЭтотОбъект,"Заказ", ложь, ,Отказ, Заголовок);													   

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()

// Проверяет правильность заполнения строк табличной части "Оборудование".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество");
	
	// Склад в ТЧ всегда должен быть заполнен, иначе проведение будет неправильным.
	СтруктураОбязательныхПолей.Вставить("Склад");
	
	Если УправлениеЗаказами.ПроверятьЗаказВТабличнойЧасти(ВидОперации, ДоговорКонтрагента, "Поступление") Тогда
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику", "Не заполнено значение реквизита ""Заказ покупателя""!");
		Иначе
			СтруктураОбязательныхПолей.Вставить("ЗаказПоставщику");
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураОбязательныхПолей.Вставить("ПриходныйОрдер");
	КонецЕсли;

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Реквизиты Заказов "Организация", "Контрагент", "Договор контрагента" должны совпадать с реквизитами из шапки.
	УправлениеЗаказами.ПроверитьРеквизитыЗаказов(ЭтотОбъект, "Оборудование", "ЗаказПоставщику", Отказ, Заголовок);


КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОборудование()

// Проверяет правильность заполнения строк табличной части "Оборудование".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОбъектСтроительства, СпособСтроительства, СтатьяЗатрат, Сумма");

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		СтруктураОбязательныхПолей.Вставить("СчетУчетаБУ");
		Если НЕ НДСВключенВСтоимость Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНДС");
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
			СтруктураОбязательныхПолей.Вставить("СчетУчетаНУ");
		КонецЕсли;
		
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОбъектыСтроительства", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства()

// Функция удаляет из исходной таблицы строки в которых сброшен флаг БезПраваПродажи
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиБезПраваПродажи(ТабТовары)

	ТаблицаБезПраваПродажи = ТабТовары.Скопировать();
	
	// Сначала удалим из таблицы строки, по которым не надо списывать резерв.
	Сч = 0;
	Пока Сч < ТаблицаБезПраваПродажи.Количество() Цикл

		СтрокаТаблицы = ТаблицаБезПраваПродажи.Получить(Сч);
		Если Не СтрокаТаблицы.БезПраваПродажи Тогда
			ТаблицаБезПраваПродажи.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаБезПраваПродажи;
	
КонецФункции // УдалитьСтрокиБезПраваПродажи()

// Функция удаляет из исходной таблицы строки для которых не надо делать размещение под заказ
// Возвращается КОПИЯ исходной таблицы.
//
Функция УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТабТовары)

	ТаблицаПоТоварамРазмещение = ТабТовары.Скопировать();
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамРазмещение.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамРазмещение.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПоставщику) Тогда
			ТаблицаПоТоварамРазмещение.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПоТоварамРазмещение;
	
КонецФункции // УдалитьСтрокиНеТребующиеРазмещенияВЗаказе()

// Процедура удаляет строки из таблицы значений с пустым заказом или с внутренним заказом (по которым не надо делать резерв)
//
Процедура УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТоварамЗаказамПокупателей)
	
	Сч = 0;
	Пока Сч < ТаблицаПоТоварамЗаказамПокупателей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварамЗаказамПокупателей.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя)
		 ИЛИ (ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
		   И  СтрокаТаблицы.ЗаказПокупателя.Заказчик = СтрокаТаблицы.Склад) Тогда             // Резерв в это случае делать не надо.
			ТаблицаПоТоварамЗаказамПокупателей.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиБезЗаказаДляРезерва()

Процедура ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, ИмяТаблицы, ИмяКолонкиСделка, СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		//сделку надо очистить
		ТаблицыДанныхДокумента[ИмяТаблицы].ЗаполнитьЗначения(неопределено,ИмяКолонкиСделка);
	ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		//сделку надо взять из шапки документа
		ТаблицыДанныхДокумента[ИмяТаблицы].ЗаполнитьЗначения(УправлениеВзаиморасчетами.ОпределитьСделку(ЭтотОбъект, СтруктураШапкиДокумента),ИмяКолонкиСделка);
	КонецЕсли;
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизацийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВРегламентированномУчете Тогда
		Возврат;
	КонецЕсли;

	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;

	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
		//начало изменений
		Если Дата >= ПРГ_ДопФункцииКлиентСервер.ПолучитьДатуНовогоАлгоритмовВСтомости() Тогда
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТаре, ТаблицаДвижений);
		КонецЕсли;	
		//конец изменений 
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
		//ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество"); //m.ionov@a-prof.ru 18.12.2013
		
		Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
		КонецЕсли;
			
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ТоварыОрганизаций.ВыполнитьПриход();
		КонецЕсли;
			
	Иначе // По ордеру

		// По ордеру нужно сторнировать движения по товарам организаций,
		// если в ордере была указана не та организация.
		// Удалим строки, по которым не нужно делать движений (организации совпадают).
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КолвоЭлементовКоллекции = КопияТаблицыТоваров.Количество();
		Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
			ЭлементКоллекции = КопияТаблицыТоваров[КолвоЭлементовКоллекции - ОбратныйИндекс];
			Если ЭлементКоллекции.ОрганизацияДокументаПолучения = СтруктураШапкиДокумента.Организация Тогда
				КопияТаблицыТоваров.Удалить(ЭлементКоллекции);
			КонецЕсли;
		КонецЦикла;

		Если КопияТаблицыТоваров.Количество() > 0 Тогда // Есть что проводить.

			// Вначале сторнируем
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаДвижений.Очистить();

			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицыТоваров, ТаблицаДвижений);

			// Недостающие поля.
			ТаблицаДвижений.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("ОрганизацияДокументаПолучения"), "Организация");
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
			//ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество"); //m.ionov@a-prof.ru 18.12.2013

			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ТоварыОрганизаций.ВыполнитьРасход();
			КонецЕсли;

			// Теперь сделаем движения с правильной организацией.
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация");
			НаборДвижений.мПериод            = Дата;
			НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

			Если Не Отказ Тогда
				Движения.ТоварыОрганизаций.ВыполнитьПриход();
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
		
	// ОБОРУДОВАНИЕ ПО РЕГИСТРУ ТоварыОрганизаций.
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОборудованию, ТаблицаДвижений);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструТоварыОрганизацийРегл()


// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, ТаблицаПоУслугам, ТаблицаПоОбъектамСтроительства, Отказ, Заголовок, СтруктураШапкиДокумента)

	// Определим код операции движений по регистру партий
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
		Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеНаКомиссию;
		Иначе
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеВПереработку;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеОборудования;
	Иначе
		КодОперацииПартииТоваров = Неопределено;
	КонецЕсли;
	
	// ТОВАРЫ, ТАРА И ОБОРУДОВАНИЕ ПО РЕГИСТРУ ТоварыНаСкладах.
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		
		ОтборСкладОптовый    = Новый Структура("ВидСкладаРазмещения", Перечисления.ВидыСкладов.Оптовый);
		ОтборСкладРозничный  = Новый Структура("ВидСкладаРазмещения", Перечисления.ВидыСкладов.Розничный);
			
		ТаблицаТоварыОпт     = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам, ОтборСкладОптовый  ).Выгрузить();
		ТаблицаТараОпт       = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,    ОтборСкладОптовый  ).Выгрузить();
		ТаблицаТоварыРозница = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТоварам, ОтборСкладРозничный).Выгрузить();
		ТаблицаТараРозница   = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаПоТаре,    ОтборСкладРозничный).Выгрузить();
			
		СтруктТаблицДокументаОпт = Новый Структура;
		//m.ionov@a-prof.ru 09.10.2014
		//СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТоварам",      ТаблицаТоварыОпт);
		Если Не СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Закрыто
			И ДоступенСтатусДокумента() И ЗначениеЗаполнено(СП_СтатусДокумента) Тогда
			//Не делаем движений по товарам на складах
		Иначе
			СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТоварам",      ТаблицаТоварыОпт);
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТаре",         ТаблицаТараОпт);
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
				
		СтруктТаблицДокументаРозница = Новый Структура;
		СтруктТаблицДокументаРозница.Вставить("ТаблицаПоТоварам", ТаблицаТоварыРозница);
		СтруктТаблицДокументаРозница.Вставить("ТаблицаПоТаре",    ТаблицаТараРозница);
			
		ТаблицыДанныхДокументаОпт     = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыНаСкладах, СтруктТаблицДокументаОпт);
		ТаблицыДанныхДокументаРозница = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыВРознице, СтруктТаблицДокументаРозница);
		
		//m.ionov@a-prof.ru 18.12.2013
		//ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокументаОпт,     "Качество", Справочники.Качество.Новый);
		//ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокументаРозница, "Качество", Справочники.Качество.Новый);
		//----m.ionov@a-prof.ru---
			
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокументаОпт,     Дата);
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРознице, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокументаРозница, Дата);
			
	Иначе // Приход по ордеру

		// Контроль остатков товара
		Если Товары.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("Товары", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
		Если ВозвратнаяТара.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
		Если Оборудование.Количество() <> 0 Тогда
			ПроцедурыКонтроляОстатков.ТоварыКПолучениюНаСкладыКонтрольОстатков("Оборудование", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		КонецЕсли;
			
		НаборДвижений = Движения.ТоварыКПолучениюНаСклады;
		
		Если НЕ Отказ Тогда
				
			// Подготовка таблицы товаров к получению
			ТаблицаТоварыКПолучению = ТаблицаПоТоварам.Скопировать();
			ТаблицаТоварыКПолучению.Колонки.Добавить("ДокументРезерва");
				
			// Документ резерва - приходный ордрер без права продажи.
			Для каждого СтрокаТаблицы из ТаблицаТоварыКПолучению Цикл
				Если СтрокаТаблицы.БезПраваПродажи Тогда
					СтрокаТаблицы.ДокументРезерва = СтрокаТаблицы.ДокументПолучения;
				КонецЕсли;
			КонецЦикла;
				
			// Подготовка таблицы тара к получению
			ТаблицаТараКПолучению = ТаблицаПоТаре.Скопировать();
			ТаблицаТараКПолучению.Колонки.Добавить("ДокументРезерва");
							
			// Документ резерва - приходный ордрер без права продажи.
			Для каждого СтрокаТаблицы из ТаблицаТараКПолучению Цикл
				Если СтрокаТаблицы.БезПраваПродажи Тогда
					СтрокаТаблицы.ДокументРезерва = СтрокаТаблицы.ДокументПолучения;
				КонецЕсли;
			КонецЦикла;
				
			// Движение по товарам к получению
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаТоварыКПолучению", ТаблицаТоварыКПолучению);
			СтруктТаблицДокумента.Вставить("ТаблицаТараКПолучению",   ТаблицаТараКПолучению);
			СтруктТаблицДокумента.Вставить("ТаблицаОборудование",     ТаблицаПоОборудованию);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру( Движения.ТоварыКПолучениюНаСклады, СтруктТаблицДокумента);
					
			//ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Качество",          Справочники.Качество.Новый); //m.ionov@a-prof.ru 18.12.2013
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",      Перечисления.СтатусыПартийТоваров.Купленный,      "ТаблицаТоварыКПолучению, ТаблицаОборудование");
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",      Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаТараКПолучению");
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументПолучения", СкладОрдер,                                       "ТаблицаОборудование");
				
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
			
	КонецЕсли;
	
	УправлениеЗапасамиПартионныйУчет.ВыполнитьПриходПоРегистрамПартий(
		?(ДополнительныеСвойства.Свойство("ТаблицаСтаройРегистрацииВПоследовательности"),ДополнительныеСвойства.ТаблицаСтаройРегистрацииВПоследовательности,Неопределено),
		СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию,СтруктураШапкиДокумента.ОтражатьВУправленческомУчете);
	
	// ТОВАРЫ, УСЛУГИ И ОБОРУДОВАНИЕ ПО РЕГИСТРУ Закупки.
	Если НЕ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
	
		КопияТаблицыТоваров = ТаблицаПоТоварам.Скопировать();
		КопияТаблицыТоваров.ЗагрузитьКолонку(КопияТаблицыТоваров.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");
		
		КопияТаблицыУслуги = ТаблицаПоУслугам.Скопировать();
		КопияТаблицыУслуги.ЗагрузитьКолонку(КопияТаблицыУслуги.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");

		КопияТаблицыОборудование = ТаблицаПоОборудованию.Скопировать();
		КопияТаблицыОборудование.ЗагрузитьКолонку(КопияТаблицыОборудование.ВыгрузитьКолонку("СуммаУпр"), "Стоимость");

		КопияТаблицыТоваров.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыТоваров.Колонки.НДСУпр.Имя = "НДС";
		
		КопияТаблицыУслуги.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыУслуги.Колонки.НДСУпр.Имя = "НДС";
		
		КопияТаблицыОборудование.Колонки.НДС   .Имя = "_НДС";
		КопияТаблицыОборудование.Колонки.НДСУпр.Имя = "НДС";
		
		// <- Шевченков №54944
		КопияТаблицыТоваров.Колонки.СуммаВзаиморасчетов.Имя = "ПРГ_СтоимостьВал"; 
		КопияТаблицыТоваров.Колонки.НДСВал.Имя = "ПРГ_НДСВал";
		Если КопияТаблицыТоваров.Колонки.Найти("ПРГ_ВалютаДокумента") = Неопределено Тогда
			КопияТаблицыТоваров.Колонки.Добавить("ПРГ_ВалютаДокумента", новый описаниетипов("СправочникСсылка.Валюты"));			
		КонецЕсли;
		// ->
		// <- Шевченков №54944
		КопияТаблицыУслуги.Колонки.СуммаВзаиморасчетов.Имя = "ПРГ_СтоимостьВал"; 
		КопияТаблицыУслуги.Колонки.НДСВал.Имя = "ПРГ_НДСВал";
		Если КопияТаблицыУслуги.Колонки.Найти("ПРГ_ВалютаДокумента") = Неопределено Тогда
			КопияТаблицыУслуги.Колонки.Добавить("ПРГ_ВалютаДокумента", новый описаниетипов("СправочникСсылка.Валюты"));			
		КонецЕсли;
		// ->
        // <- Шевченков №54944
		КопияТаблицыОборудование.Колонки.СуммаВзаиморасчетов.Имя = "ПРГ_СтоимостьВал"; 
		КопияТаблицыОборудование.Колонки.НДСВал.Имя = "ПРГ_НДСВал";
		Если КопияТаблицыОборудование.Колонки.Найти("ПРГ_ВалютаДокумента") = Неопределено Тогда
			КопияТаблицыОборудование.Колонки.Добавить("ПРГ_ВалютаДокумента", новый описаниетипов("СправочникСсылка.Валюты"));			
		КонецЕсли;
		// ->
		
		//{21.09.2016 Островерхий заявка №56575 
		Если КопияТаблицыТоваров.Колонки.Найти("ПРГАдресПоставки") = Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
			МассивТипов.Добавить(Тип("СправочникСсылка.АдресаПоставки"));
			КопияТаблицыТоваров.Колонки.Добавить("ПРГАдресПоставки", Новый ОписаниеТипов(МассивТипов));			
		КонецЕсли;
		//21.09.2016 Островерхий} 
		
		//m.ionov@a-prof.ru 08.10.2014
		Если ДоступенСтатусДокумента() Тогда
			КопияТаблицыТоваров.Колонки.Добавить("СП_СтоимостьПоНакладной");
			КопияТаблицыТоваров.Колонки.Добавить("СП_НДСПоНакладной");
			Для каждого СтрокаТовара  Из КопияТаблицыТоваров Цикл
			
				Если СтрокаТовара.Количество = 0 Тогда
					СтрокаТовара.СП_СтоимостьПоНакладной = 0;
					СтрокаТовара.СП_НДСПоНакладной = 0;
				Иначе
					СтрокаТовара.СП_СтоимостьПоНакладной = СтрокаТовара.Стоимость*СтрокаТовара.СП_КоличествоПоНакладной/СтрокаТовара.Количество;
					СтрокаТовара.СП_НДСПоНакладной = СтрокаТовара.НДС*СтрокаТовара.СП_КоличествоПоНакладной/СтрокаТовара.Количество;
				КонецЕсли;	
			
			КонецЦикла; 
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
				
			// В этом случае таблицы документа обрабатываются особым образом
			ТаблицаДвижений = Движения.Закупки.Выгрузить();
			ТаблицаДвижений.Очистить();
			ТаблицаДвиженийТовары       = ТаблицаДвижений.Скопировать();
			ТаблицаДвиженийУслуги       = ТаблицаДвижений.Скопировать();
			ТаблицаДвиженийОборудование = ТаблицаДвижений.Скопировать();
				
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыТоваров,      ТаблицаДвиженийТовары,       Проект, Дата, "Закупки");
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыУслуги,       ТаблицаДвиженийУслуги,       Проект, Дата, "Закупки");
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(КопияТаблицыОборудование, ТаблицаДвиженийОборудование, Проект, Дата, "Закупки");
				
			// Вставляем уже подготовленные таблицы движений
			ТаблицыДанныхДокумента = Новый Структура;
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоТоварам",      ТаблицаДвиженийТовары);
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоУслугам",      ТаблицаДвиженийУслуги);
			ТаблицыДанныхДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаДвиженийОборудование);
							
		Иначе
							
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      КопияТаблицыТоваров);
			СтруктТаблицДокумента.Вставить("ТаблицаПоУслугам",      КопияТаблицыУслуги);
			СтруктТаблицДокумента.Вставить("ТаблицаПоОборудованию", КопияТаблицыОборудование);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.Закупки, СтруктТаблицДокумента);
							
		КонецЕсли;
						
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",       УправлениеЗапасамиПартионныйУчет.ОпределитьСтатусПартииПриходаУпр(СтруктураШапкиДокумента));
		//m.ionov@a-prof.ru 19.02.2014
		//ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		Если Не УЗ_НесколькоСФ Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументЗакупки",    Ссылка);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Подразделение",      Подразделение, "ТаблицаПоТоварам");
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка);
		КонецЕсли;
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ПРГ_ВалютаДокумента",СтруктураШапкиДокумента.ВалютаДокумента);  // Шевченков №54944

		//{21.09.2016 Островерхий заявка №56575 
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ПРГАдресПоставки",СтруктураШапкиДокумента.Грузоотправитель); 
		//21.09.2016 Островерхий} 
		
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.Закупки, Неопределено, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;	

КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартийУпр()

// Проводит табличные части "Товары" и "Возвратная тара" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ТоварыИТараПоРегистрамОстатковИПартийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента)

	// Определим код операции движений по регистру партий
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
		Если СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеНаКомиссию;
		Иначе
			КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ПоступлениеВПереработку;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
		КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.Поступление;
	Иначе
		КодОперацииПартииТоваров = Неопределено;
	КонецЕсли;
	
	//начало изменений БП 04 
	//УправлениеЗапасамиПартионныйУчет.ВыполнитьПриходПоРегистрамПартий(
	//	?(ДополнительныеСвойства.Свойство("ТаблицаСтаройРегистрацииВПоследовательности"),ДополнительныеСвойства.ТаблицаСтаройРегистрацииВПоследовательности,Неопределено),
	//	СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию,, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, СтруктураШапкиДокумента.ОтражатьВНалоговомУчете ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН);
	//
	УправлениеЗапасамиПартионныйУчет.ВыполнитьПриходПоРегистрамПартий(
		?(ДополнительныеСвойства.Свойство("ТаблицаСтаройРегистрацииВПоследовательности"),ДополнительныеСвойства.ТаблицаСтаройРегистрацииВПоследовательности,Неопределено),
		СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию,, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, (СтруктураШапкиДокумента.ОтражатьВНалоговомУчете ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН) и  КодОперацииПартииТоваров <> Перечисления.КодыОперацийПартииТоваров.ПоступлениеНаКомиссию);
	//конец изменений БП 04 

КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартий()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	                          ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							  //начало изменений
							  ТаблУслугНДФЛ,ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ,
                              //конец изменений 
							  Отказ, Заголовок);

	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	                          ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							  Отказ, Заголовок);
							  
	Если НЕ СтруктураШапкиДокумента.СпособВеденияПартионногоУчетаПоОрганизации = Перечисления.СпособыВеденияПартионногоУчетаПоОрганизациям.НеВедется Тогда
		ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, 
	    	                      ТаблицаПоТаре, Отказ, Заголовок);
	КонецЕсли;							  
							  
	// Движения по регистрам подсистемы НДС.
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
		И СтруктураШапкиДокумента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		
		ТаблицыДокумента = Новый Структура();
		ТаблицыДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
		ТаблицыДокумента.Вставить("ТаблицаПоУслугам", ТаблицаПоУслугам);
		ТаблицыДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
		ТаблицыДокумента.Вставить("ТаблицаПоОбъектамСтроительства", ТаблицаПоОбъектамСтроительства);
		
		//ТаблицыДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТаре); // Шевченков
		
		// Выполнить движения по спецрегистрам подсистемы учета НДС
		//ДвиженияРегистровПодсистемыНДС(СтруктураШапкиДокумента, ТаблицыДокумента, Отказ);
		ДвиженияРегистровПодсистемыНДС(СтруктураШапкиДокумента, ТаблицыДокумента, Отказ, ТаблицаПоТаре.Количество()>0, ТаблицаПоТаре);
		
	КонецЕсли;
	
	// Формирование движений по отражению затрат.
	УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
		СтруктураШапкиДокумента, 
		ТаблицаПоУслугам
	);

	ДвиженияПоРегиструТоварыОрганизацийРегл(РежимПроведения, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, 
	                          Отказ, Заголовок, СтруктураШапкиДокумента);
							  
	ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам,
                                                 Отказ, Заголовок, СтруктураШапкиДокумента);
												 
	ПроводкиНУ = ?(СтруктураШапкиДокумента.ОтражатьВНалоговомУчете,Движения.Налоговый,Неопределено);

	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
	                          ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, 
							  //начало изменений 
							  ТаблУслугНДФЛ,ТаблицаПоВзаиморасчетамНДФЛ,
							  //конец изменений 
							  Отказ, Заголовок,ПроводкиНУ);
							  
	ДвиженияПоРегистрамУСНРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, 
	                          ТаблицаПоОборудованию, Отказ, Заголовок);
							  
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить 
	// корректировку списания
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете И ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру тогда

		УправлениеЗапасамиПартионныйУчет.ДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить());

	КонецЕсли;
	
	// Разницы по ПБУ18/02
    Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Если ТаблицаПоУслугам.Количество() > 0 Тогда
			ДвиженияПоРазницамПоУслугам(СтруктураШапкиДокумента, ТаблицаПоУслугам,ПроводкиНУ);
		КонецЕсли;
	КонецЕсли;
	
	//начало изменений
	//Если ТаблУслугНДФЛ <> Неопределено Тогда
	//	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
	//		ПРГ_ДопФункцииКлиентСервер.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
	//				мСтруктураПараметровВзаиморасчетовНДФЛ, ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ, 
	//				ВидДвиженияНакопления.Приход, Отказ, Заголовок);
	//	КонецЕсли;
	//	
	//			
	//КонецЕсли;	
	//конец изменений 
	
	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		//БП12
		Движения.Хозрасчетный.Прочитать();
		Для Каждого Движение ИЗ Движения.Хозрасчетный Цикл
			Если (Движение.СчетДт.Код = "91.02.1") И (Движение.СчетКт.Родитель.Код = "19") Тогда 
				Проводка 				= Движения.Налоговый.ДобавитьДебет();
				Проводка.Период			= Дата;
				Проводка.СчетДт 		= ПланыСчетов.Налоговый.НайтиПоКоду("91.02.7");
				Проводка.ВидУчетаДт 	= Перечисления.ВидыУчетаПоПБУ18.НУ;
				Принимать_к_НУ			= Движение.СубконтоДт.ПрочиеДоходыИРасходы.ПринятиеКналоговомуУчету;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = Движение.СубконтоДт.ПрочиеДоходыИРасходы.Ссылка;
				Проводка.Содержание 	= Движение.Содержание;
				Проводка.Сумма			= Движение.Сумма;
				Проводка.Активность 	= Движение.Активность;
				Проводка.НомерЖурнала 	= Движение.НомерЖурнала;
				Проводка.Организация  	= Движение.Организация;
				Если НЕ Принимать_к_НУ Тогда 
					Проводка.ВидУчетаДт 	= Перечисления.ВидыУчетаПоПБУ18.ПР;
					
					Проводка 				= Движения.Налоговый.ДобавитьДебет();
					Проводка.Период			= Дата;
					Проводка.СчетДт 		= ПланыСчетов.Налоговый.НайтиПоКоду("НЕ.03");
					Проводка.ВидУчетаДт 	= Перечисления.ВидыУчетаПоПБУ18.НУ;
					Проводка.Содержание 	= Движение.Содержание;
					Проводка.Сумма			= Движение.Сумма;
					Проводка.Активность 	= Движение.Активность;
					Проводка.НомерЖурнала 	= Движение.НомерЖурнала;
					Проводка.Организация  	= Движение.Организация;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%
		Движения.Налоговый.Записать(Ложь);	
    КонецЕсли;
    /////Вадим 28.02.2014 15:59:45  бп 
		
	////ВадимКонец
	
	
КонецПроцедуры // ДвиженияПоРегистрам()

//Бирюков получим таблицу для закрытия регистра ЗаказыПоставщикам по ФИФО	
Функция СформироватьТаблицуОстатковПоДатеПоставки(ИсходнаяТаблицаТоваров)

	ТаблицаПоступления = ИсходнаяТаблицаТоваров.Скопировать();
	ТаблицаПоступления.Колонки.Добавить("УдалитьДатаПоставки", Новый ОписаниеТипов("Дата"));
	ТаблицаТоваров = ТаблицаПоступления.СкопироватьКолонки();
	ТаблицаПоступления.Свернуть("Номенклатура,ЗаказПоставщику","Количество");

	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.Номенклатура.Услуга КАК Услуга,
	|	ЗаказыПоставщикамОстатки.Номенклатура.Набор КАК Набор,
	|	ЗаказыПоставщикамОстатки.Номенклатура.Комплект КАК Комплект,
	|	"""" КАК ЗаказПокупателя,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстатки.Цена,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения,
	|	ЗаказыПоставщикамОстатки.СтавкаНДС,
	|	0 КАК НДС,
	//{24.11.2014 Островерхий заявка №б/н 
	|	ЗаказыПоставщикамОстатки.УдалитьДатаПоставки КАК УдалитьДатаПоставки, 
	//24.11.2014 Островерхий} 
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	|	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаказыПоставщикамОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&ДатаОстатков,
	|			ЗаказПоставщику В (&Заказ)
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ЗаказыПоставщикамОстатки
	//{24.11.2014 Островерхий заявка №б/н 
	|УПОРЯДОЧИТЬ ПО
	|	УдалитьДатаПоставки";
	//24.11.2014 Островерхий}
	

	
	ТаблЗаказов = Товары.Выгрузить(,"ЗаказПоставщику");
	ТаблЗаказов.Свернуть("ЗаказПоставщику");
	к = 0;
	Пока к < ТаблЗаказов.Количество() Цикл
		Если ЗначениеЗаполнено(ТаблЗаказов[к]) Тогда
			к = к +1;
		Иначе	
			ТаблЗаказов.Удалить(ТаблЗаказов[к]);
		КонецЕсли;	
	КонецЦикла;	
	
	СписокЗаказов = ТаблЗаказов.ВыгрузитьКолонку("ЗаказПоставщику");
	

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Заказ" , СписокЗаказов);
	Запрос.УстановитьПараметр("СписокНоменклатуры" , ТаблицаПоступления.ВыгрузитьКолонку("Номенклатура"));
	//{10.11.2015 Островерхий заявка №б/н 
	//Запрос.УстановитьПараметр("ДатаОстатков", ОбщегоНазначения.ПолучитьДатуОстатков(ЭтотОбъект)); 
	ПараметрыГраницы = Новый Массив(2);
	ПараметрыГраницы[0] = ЭтотОбъект.МоментВремени();
	ПараметрыГраницы[1] = ВидГраницы.Исключая;
	Граница = Новый(Тип("Граница"),ПараметрыГраницы);
	Запрос.УстановитьПараметр("ДатаОстатков", Граница);	
	//10.11.2015 Островерхий} 

	ТаблицаОстатковПоТоварам = Запрос.Выполнить().Выгрузить();

	Для Каждого Строка ИЗ ТаблицаПоступления Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("ЗаказПоставщику", Строка.ЗаказПоставщику);
		
		СтрокиОстатков = ТаблицаОстатковПоТоварам.НайтиСтроки(Отбор);
		
		ОсталосьСписать = Строка.Количество;
		Для Каждого СтрокаОстатков ИЗ СтрокиОстатков Цикл
			Если ОсталосьСписать <= 0 Тогда 
				Прервать
			КонецЕсли;
			
			СтрокаИтоговойТаблицы = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИтоговойТаблицы, СтрокаОстатков);
			
			Если СтрокаОстатков.Количество > ОсталосьСписать Тогда
				СтрокаИтоговойТаблицы.УдалитьДатаПоставки 	= СтрокаОстатков.УдалитьДатаПоставки;
				СтрокаИтоговойТаблицы.Количество	= ОсталосьСписать;
				СтрокаИтоговойТаблицы.СуммаВзаиморасчетов = СтрокаОстатков.СуммаВзаиморасчетов/СтрокаОстатков.Количество*ОсталосьСписать;
				СтрокаИтоговойТаблицы.СуммаУпр = СтрокаОстатков.СуммаУпр/СтрокаОстатков.Количество*ОсталосьСписать;
				Прервать;
			КонецЕсли;
			
			ОсталосьСписать = ОсталосьСписать - СтрокаОстатков.Количество;
//			СтрокаИтоговойТаблицы.Количество = СтрокаИтоговойТаблицы.Количество;
		КонецЦикла;
	КонецЦикла;

	//ТаблицаТоваров.ЗаполнитьЗначения(Сделка.Ссылка,"ЗаказПоставщику");
	Возврат ТаблицаТоваров

КонецФункции // СформироватьТаблицуОстатковПоДатеПоставки()
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


// По результату запроса по шапке документа формируем движения по регистрам для целей упр. учета.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  ТаблицаПоОборудованию     - таблица значений, содержащая данные для проведения и проверки ТЧ "Оборудование",
//  ТаблицаПоОбъектамСтроительства - таблица значений, содержащая данные для проведения и проверки ТЧ "Объекты строительства",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, 
							ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
							ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							Отказ, Заголовок);
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации    = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
	   И СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
	   И  (СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ
	   ИЛИ СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный) Тогда
		УправлениеСертификациейНоменклатуры.ПроверитьНаСертификацию( ТаблицаПоТоварам.ВыгрузитьКолонку("СерияНоменклатуры"), Дата, Ложь, Заголовок);
	КонецЕсли;
	
	УправлениеВзаиморасчетами.ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ЭтотОбъект, СтруктураШапкиДокумента, 
		        мСтруктураПараметровВзаиморасчетов, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
		        ВидДвиженияНакопления.Расход, Отказ, Заголовок);
				
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
	// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
	// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.

	ТоварыИТараПоРегистрамОстатковИПартийУпр(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, ТаблицаПоУслугам, ТаблицаПоОбъектамСтроительства, Отказ, Заголовок, СтруктураШапкиДокумента);
	
	//m.ionov@a-prof.ru 19.12.2013
	Если Товары.Количество() > 0 Тогда
		//Бирюков заремировал 04_01_14
		//Ожиганов Вводим ограничение с  01.02.2014
		Если Дата >= '20140201' Тогда
			СтарыйОтказ =  Отказ;
			Движения.ЗаказыПоставщикам.КонтрольОстатков_Барьер(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
			Если РольДоступна("ПолныеПрава") Тогда
				  Отказ = СтарыйОтказ;
			КонецЕсли;	
		 КонецЕсли;	
	КонецЕсли;
	//----m.ionov@a-prof.ru---

	Если НЕ Отказ Тогда

		// ТОВАР, ТАРА ПО РЕГИСТРУ ТоварыПолученные.
		СтруктТаблицДокумента = Новый Структура;
		ТабИменТара = неопределено;
		ТабИменТовары = Неопределено;

		ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТаре, ТабИменТара, "ЗаказПоставщику", "Сделка");

		//m.ionov@a-prof.ru 30.04.2014
		//СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТаре);
		ВидНоменклатурыТара = Константы.УП_ВидНоменклатурыВозвратнаяТара.Получить();
		Если ЗначениеЗаполнено(ВидНоменклатурыТара)
			И Дата >= НачалоДня(Константы.УП_ДатаНачалаУчетаВозвратнойТарыПоСкладам.Получить())
			И Не Константы.УП_ДатаНачалаУчетаВозвратнойТарыПоСкладам.Получить() = Дата(1,1,1) Тогда
			КопияТаблицаПоТаре = ТаблицаПоТаре.Скопировать();
			КопияТаблицаПоТаре.Колонки.Добавить("УП_Склад");;
			Для каждого СтрокаТаблицы  Из КопияТаблицаПоТаре Цикл
			
				Если СтрокаТаблицы.Номенклатура.ВидНоменклатуры = ВидНоменклатурыТара Тогда
					СтрокаТаблицы.УП_Склад = СтрокаТаблицы.Склад;
				КонецЕсли;
			
			КонецЦикла; 
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", КопияТаблицаПоТаре);
		Иначе
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре", ТаблицаПоТаре);
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		

		Если (ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		  Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда 
			  ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары, "ЗаказПокупателя", "Сделка");
		  Иначе
			  ОбщегоНазначения.ПереименоватьКолонкуТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары, "ЗаказПоставщику", "Сделка");
		  КонецЕсли;


			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			
		КонецЕсли;
		
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыПолученные, СтруктТаблицДокумента);
		
		ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоТаре, ТабИменТара);
		Если ТабИменТовары<>неопределено Тогда
			ОбщегоНазначения.ВосстановитьИменаКолонокТаблицыЗначений(ТаблицаПоТоварам, ТабИменТовары);
		КонецЕсли;
		
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", ДоговорКонтрагента);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Контрагент",         Контрагент);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Организация",        Организация);
		ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, "ТаблицаПоТаре", "Сделка", СтруктураШапкиДокумента);
		
		//m.ionov@a-prof.ru 30.04.2014
		Если  Дата >= НачалоДня(Константы.УП_ДатаНачалаУчетаВозвратнойТарыПоСкладам.Получить())
			И Не Константы.УП_ДатаНачалаУчетаВозвратнойТарыПоСкладам.Получить() = Дата(1,1,1)
			И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Сделка",        Неопределено,     "ТаблицаПоТаре");
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения",    Перечисления.СтатусыПолученияПередачиТоваров.ВозвратнаяТара,     "ТаблицаПоТаре");
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
		   И СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			ОпределитьСделкуВСтрокахТаблицыЗначений(ТаблицыДанныхДокумента, "ТаблицаПоТоварам", "Сделка", СтруктураШапкиДокумента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения", Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию, "ТаблицаПоТоварам");
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПолучения", Перечисления.СтатусыПолученияПередачиТоваров.ВПереработку, "ТаблицаПоТоварам");
		КонецЕсли;
		
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыПолученные, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		
		// ТОВАР, ТАРА И ОБОРУДОВАНИЕ ПО РЕГИСТРУ ЗаказыПоставщикам.
		
		СтруктТаблицДокумента = Новый Структура;
		//Бирюков подсунем свою таблицу
//		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      ТаблицаПоТоварам);
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам",      СформироватьТаблицуОстатковПоДатеПоставки(ТаблицаПоТоварам));
		//{27.11.2014 Островерхий заявка №б/н, отключаем движение по Таре 
		//СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",         ТаблицаПоТаре); 
		//27.11.2014 Островерхий} 
		СтруктТаблицДокумента.Вставить("ТаблицаПоОборудованию", ТаблицаПоОборудованию);
		Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			СтруктТаблицДокумента.Вставить("ТаблицаПоУслугам",        ТаблицаПоУслугам);
		КонецЕсли;
			
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ЗаказыПоставщикам, СтруктТаблицДокумента);
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			//при поступлении материалов в переработку должны сформироваться движения, значение измерения ЗаказПоставщику = заказ покупателя на переработку
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику", СтруктураШапкиДокумента.Сделка, "ТаблицаПоТоварам");
        КонецЕсли;

		ОбщегоНазначения.УдалитьСтрокиИзТаблицДокумента(ТаблицыДанныхДокумента, "ЗаказПоставщику");
			
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДоговорКонтрагента", СтруктураШапкиДокумента.ДоговорКонтрагента);
				
		СтатусПартии = ?(ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку, Перечисления.СтатусыПартийТоваров.ВПереработку, Перечисления.СтатусыПартийТоваров.Купленный);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", СтатусПартии,                                     "ТаблицаПоТоварам");
		//{27.11.2014 Островерхий заявка №б/н, отключаем движение по Таре
		//ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара, "ТаблицаПоТаре");
		//27.11.2014 Островерхий} 
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", Перечисления.СтатусыПартийТоваров.Оборудование,   "ТаблицаПоОборудованию");
		Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии", СтатусПартии, "ТаблицаПоУслугам");
		КонецЕсли;
					
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ЗаказыПоставщикам, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
	
	КонецЕсли;
	
	// Снятие резерва по приходному ордеру
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру И НЕ Отказ Тогда

		// Сначала удалим из таблицы строки, по которым не надо списывать резерв.
		ТаблицаПоТоварамПоОрдерамБезПраваПродажи = УдалитьСтрокиБезПраваПродажи(ТаблицаПоТоварам);
		ТаблицаПоТоварамПоОрдерамБезПраваПродажи.Колонки.ДокументПолучения.Имя = "ДокументРезерва";
		
		ТаблицаПоТареПоОрдерамБезПраваПродажи = УдалитьСтрокиБезПраваПродажи(ТаблицаПоТаре);
		ТаблицаПоТареПоОрдерамБезПраваПродажи.Колонки.ДокументПолучения.Имя = "ДокументРезерва";
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамПоОрдерамБезПраваПродажи);
		СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареПоОрдерамБезПраваПродажи);
		
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);

		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;
	
	// Резервирование по заказам покупателей
		
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТоварамЗаказамПокупателей = ТаблицаПоТоварам.Скопировать();
	
	//для вида операции ВПереработку реквизит ЗаказПокупателя всегда заполнен, поэтому вид операции не проверяем
	УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТоварамЗаказамПокупателей);

	// Теперь зарезервируем возвратную тару
	// Сначала удалим из таблицы строки, по которым не надо ничего резервировать
	// (реквизит ЗаказПокупателя пуст)
	ТаблицаПоТареЗаказамПокупателей = ТаблицаПоТаре.Скопировать();
	УдалитьСтрокиБезЗаказаДляРезерва(ТаблицаПоТареЗаказамПокупателей);
	
	Если ТаблицаПоТоварамЗаказамПокупателей.Количество() > 0 ИЛИ ТаблицаПоТареЗаказамПокупателей.Количество() > 0 Тогда

		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			// Контроль остатков товара
			Если ТаблицаПоТоварамЗаказамПокупателей.Количество() <> 0 Тогда
				ПроцедурыКонтроляОстатков.ТоварыВРезервеНаСкладахКонтрольОстатков("Товары", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
			КонецЕсли;
			Если ТаблицаПоТареЗаказамПокупателей.Количество() <> 0 Тогда
				ПроцедурыКонтроляОстатков.ТоварыВРезервеНаСкладахКонтрольОстатков("ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			ТаблицаПоТоварамЗаказамПокупателей.Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";
			ТаблицаПоТареЗаказамПокупателей   .Колонки.ЗаказПокупателя.Имя = "ДокументРезерва";
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамЗаказамПокупателей);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареЗаказамПокупателей);
				
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
			
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		
		КонецЕсли;

	КонецЕсли;
	
	// Товары и тара по регистру "Размещение заказов покупателей"
	ТаблицаПоТоварамРазмещение = УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТаблицаПоТоварам);
	ТаблицаПоТареРазмещение    = УдалитьСтрокиНеТребующиеРазмещенияВЗаказе(ТаблицаПоТаре);
	
	Если ТаблицаПоТоварамРазмещение.Количество() > 0 ИЛИ ТаблицаПоТареРазмещение.Количество() > 0 Тогда
		
		Движения.РазмещениеЗаказовПокупателей.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		Движения.РазмещениеЗаказовПокупателей.КонтрольОстатков(ЭтотОбъект, "ВозвратнаяТара", СтруктураШапкиДокумента, Отказ, Заголовок, РежимПроведения);
		
		Если НЕ Отказ Тогда
		
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварамРазмещение);
			СтруктТаблицДокумента.Вставить("ТаблицаПоТаре",    ТаблицаПоТареРазмещение);
			
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.РазмещениеЗаказовПокупателей, СтруктТаблицДокумента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ТоварТара", Перечисления.ТоварТара.Товар, "ТаблицаПоТоварам");
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ТоварТара", Перечисления.ТоварТара.Тара,  "ТаблицаПоТаре");

			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.РазмещениеЗаказовПокупателей, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;

	// Если установлен флаг РегистрироватьЦеныПоставщика, нужно зарегистрировать цены
	Если РегистрироватьЦеныПоставщика Тогда

		НаборДвижений = Движения.ЦеныНоменклатурыКонтрагентов;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();

		ТаблицаПоТоварамЦены = ТаблицаПоТоварам.Скопировать();
		СпособЗаполненияЦен  = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;

		// Пересчитаем цены, согласно флагу типа цен контрагентов (цена включает НДС)
		Если ТипЦен.ЦенаВключаетНДС Тогда
			Если НЕ СуммаВключаетНДС Тогда
				Для Каждого СтрокаТабличнойЧасти Из ТаблицаПоТоварамЦены Цикл
					СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(СтрокаТабличнойЧасти.Цена,
					                            СпособЗаполненияЦен, Ложь, Истина, Истина,
					                            УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если СуммаВключаетНДС Тогда
				Для Каждого СтрокаТабличнойЧасти Из ТаблицаПоТоварамЦены Цикл
					СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(СтрокаТабличнойЧасти.Цена,
					                            СпособЗаполненияЦен, Истина, Ложь, Ложь,
					                            УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		// Удалим строки с одинаковым товаром и характеристикой.
		МассивСтрокДляУдаления = Новый Массив;
		СписокСвернутыхСтрок   = Новый СписокЗначений;

		Для Каждого СтрокаТаблицыПоТоварамЦены Из ТаблицаПоТоварамЦены Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", СтрокаТаблицыПоТоварамЦены.Номенклатура);
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТаблицыПоТоварамЦены.ХарактеристикаНоменклатуры);
			СтрокиПоТовару = ТаблицаПоТоварамЦены.НайтиСтроки(СтруктураОтбора);
			Если СтрокиПоТовару.Количество() > 0 Тогда //Есть несколько строк по товару.
				ПерваяСтрока = СтрокиПоТовару[0];
				Цена = 0;
				Для каждого СтрокаПоТовару Из СтрокиПоТовару Цикл
					Если СписокСвернутыхСтрок.НайтиПоЗначению(СтрокаПоТовару) = Неопределено Тогда
						СписокСвернутыхСтрок.Добавить(СтрокаПоТовару);
					Иначе
						Продолжить;
					КонецЕсли;
					Цена = Цена + СтрокаПоТовару.Цена/СтрокаПоТовару.Коэффициент;
					Если СтрокаПоТовару <> ПерваяСтрока Тогда
						МассивСтрокДляУдаления.Добавить(СтрокаПоТовару);
					КонецЕсли;
				КонецЦикла;
				Если Цена > 0 Тогда
					ПерваяСтрока.Цена = Цена / СтрокиПоТовару.Количество() * ПерваяСтрока.Коэффициент;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
			ТаблицаПоТоварамЦены.Удалить(СтрокаДляУдаления);
		КонецЦикла;

		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК Цены
		|ГДЕ
		|	Цены.Период = &ДатаЦен
		|	И Цены.ТипЦен = &ТипЦен
		|	И Цены.Номенклатура В (&СписокНоменклатуры)
		|");

		Запрос.УстановитьПараметр("ДатаЦен", НачалоДня(Дата));
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаПоТоварамЦены.ВыгрузитьКолонку("Номенклатура"));

		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура");
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры");

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураОтбора.Номенклатура = Выборка.Номенклатура;
			СтруктураОтбора.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;

			СтрокиПоТовару = ТаблицаПоТоварамЦены.НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаТовара Из СтрокиПоТовару Цикл
				ТаблицаПоТоварамЦены.Удалить(СтрокаТовара);
			КонецЦикла;
		КонецЦикла;

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамЦены, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(ТипЦен,"ТипЦен");

		Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа") Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВалютаЗаказа,"Валюта");
		Иначе
			ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ВалютаДокумента,"Валюта");
		КонецЕсли;

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.ЦеныНоменклатурыКонтрагентов.ВыполнитьДвижения();
		КонецЕсли;

	КонецЕсли;
	
	// если вид операции = объекты строительства
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		НаборДвижений = Движения.СтроительствоОбъектовОсновныхСредств;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийОбъектыСтроительства = НаборДвижений.Выгрузить();
		ТаблицаДвиженийОбъектыСтроительства.Очистить();

		// Заполним таблицу движений.
		ТаблицаПоОбъектамСтроительства.Колонки.Сумма.Имя 	 = "СуммаДок";
		ТаблицаПоОбъектамСтроительства.Колонки.Стоимость.Имя = "Сумма";

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОбъектамСтроительства, ТаблицаДвиженийОбъектыСтроительства);

		// Недостающие поля.
		//ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер,"ДокументРезерва");
		//ТаблицаДвижений.ЗаполнитьЗначения(СкладОрдер.Склад,"Склад");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвиженийОбъектыСтроительства;

		Если Не Отказ Тогда
			Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьПриход();
			Движения.СтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;
		
		НаборДвижений = Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийОбъектыСтроительства = НаборДвижений.Выгрузить();
		ТаблицаДвиженийОбъектыСтроительства.Очистить();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоОбъектамСтроительства, ТаблицаДвиженийОбъектыСтроительства);

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвиженийОбъектыСтроительства;

		Если Не Отказ Тогда
			Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств.ДобавитьДвижение();
			Движения.ЗатратыНаСтроительствоОбъектовОсновныхСредств.Записать(Ложь);
		КонецЕсли;
		
		ТаблицаПоОбъектамСтроительства.Колонки.Сумма.Имя 	 = "Стоимость";
		ТаблицаПоОбъектамСтроительства.Колонки.СуммаДок.Имя = "Сумма";

	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда

		// Погашение внутренних заказов в случае Заказчик = Склад поступления
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить( "СтатусПартии",          Перечисления.СтатусыПартийТоваров.Купленный);
		ДопПараметры.Вставить( "РежимПроведения",       РежимПроведения);
		ДопПараметры.Вставить( "ИмяРеквизитаЗаказ",     "Заказ");
		ДопПараметры.Вставить( "ЗаказВШапке",           Ложь);
		ДопПараметры.Вставить( "ИмяТабЧасти",           "Товары");
		
		ТабИсходная = ТаблицаПоТоварам.Скопировать();
		
		ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.Купленный);
		Если ТабИсходная.Количество() > 0 Тогда
			УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
		КонецЕсли;
		
		ТабИсходная.Очистить();
		ТабИсходная = ТаблицаПоТаре.Скопировать();
		ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);

			
		Если ТабИсходная.Количество() > 0 Тогда
			ДопПараметры.Вставить( "СтатусПартии", Перечисления.СтатусыПартийТоваров.ВозвратнаяТара);
			ДопПараметры.Вставить( "ИмяТабЧасти",  "ВозвратнаяТара");

			УправлениеЗаказами.ДвижениеПоВнутреннимЗаказам( ЭтотОбъект, ТабИсходная, ДопПараметры, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура  ПодготовитьТаблицуДляДвиженийПоВнутреннимЗаказам(ТабИсходная, знач СтатусПартии)
	Сч = 0;

	Пока Сч < ТабИсходная.Количество() Цикл
		СтрокаТаблицы = ТабИсходная.Получить(Сч);
		Если ТипЗнч(СтрокаТаблицы.ЗаказПокупателя) = Тип("ДокументСсылка.ВнутреннийЗаказ") // Считается исполнением внутреннего заказа.
			  И СтрокаТаблицы.ЗаказПокупателя.Заказчик = СтрокаТаблицы.Склад Тогда
			// Проверим остаток по регистру "Внутренние заказы", если в остатках не хватает количества, 
			// то, вероятно, заказаны комплектующие для комплектов, по ним движений не делаем
			КоличествоОстаток = УправлениеЗаказами.ПолучитьОстатокПоВнутреннемуЗаказу(СтрокаТаблицы.ЗаказПокупателя, 
																   СтрокаТаблицы.Количество, 
																   СтрокаТаблицы.Номенклатура, 
																   ?(СтатусПартии=Перечисления.СтатусыПартийТоваров.ВозвратнаяТара,неопределено,СтрокаТаблицы.ХарактеристикаНоменклатуры),
																   СтрокаТаблицы.ЕдиницаИзмерения,
																   СтатусПартии);
			Если КоличествоОстаток > 0 Тогда
				СтрокаТаблицы.Количество = Мин(СтрокаТаблицы.Количество, КоличествоОстаток);
				Сч = Сч + 1;
			Иначе
				ТабИсходная.Удалить(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			ТабИсходная.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	ТабИсходная.Колонки.ЗаказПокупателя.Имя = "Заказ";
КонецПроцедуры


// Формирует движения по регистру "Взаиморасчеты с контрагентами по документам расчетов",
// если по договору ведется учет в разрезе документов
//
Процедура ДвиженияПоРегистрамОперативныхВзаиморасчетов(РежимПроведения, ТаблицаПоВзаиморасчетам, Отказ, Заголовок, СтруктураШапкиДокумента)

	Если НЕ мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		Возврат;
	КонецЕсли;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	ВидРасчетовПоОперации = перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);
		
	УправлениеВзаиморасчетами.ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаПоВзаиморасчетам, ВидРасчетовПоОперации, ВидДвижения, Движения, Отказ, Заголовок);
				
КонецПроцедуры

Процедура ДвиженияПоРегистрамУСНРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию,Отказ, Заголовок)
	
	Если (Не СтруктураШапкиДокумента.ОтражатьВНалоговомУчетеУСН) ИЛИ 
		(СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		
		НаборДвижений = Движения.РасходыПриУСН;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		Если (НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства) Тогда
			НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаДвижений, 
								Перечисления.ВидыРасходовУСН.Номенклатура, СтруктураШапкиДокумента.ДоговорКонтрагента,
								Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
		КонецЕсли;
								
		НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаДвижений, 
								Перечисления.ВидыРасходовУСН.Услуги, СтруктураШапкиДокумента.ДоговорКонтрагента,
								Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
								
		//НалоговыйУчетУСН.ПоступлениеРасходовУСН(СтруктураШапкиДокумента, ТаблицаПоОборудованию, ТаблицаДвижений, 
		//						Перечисления.ВидыРасходовУСН.Номенклатура, СтруктураШапкиДокумента.ДоговорКонтрагента,
		//						Перечисления.СтатусыПартийУСН.Купленные, СтруктураШапкиДокумента.СуммаВключаетНДС);
								
		//Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.РасходыПриУСН.ВыполнитьПриход();
			НаборДвижений.Записать(Истина);
		КонецЕсли;
				
		//Зачет аванса													
		НалоговыйУчетУСН.ДвиженияУСН(Ссылка, РежимПроведения);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, 
							ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
							ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам,
							//начало изменений
							ТаблицаНДФЛ,ТаблицаПоВзаиморасчетамНДФЛ,
							//конец изменений 
							Отказ, Заголовок, ПроводкиНУ);

	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия //m.ionov@a-prof.ru 19.02.2014
	 или ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку
	 или ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда

		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
		// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		// ТАРА ПО РЕГИСТРУ ТоварыНаСкладах.
		// ТАРА ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		ТоварыИТараПоРегистрамОстатковИПартийРегл(РежимПроведения, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоОборудованию, Отказ, Заголовок, СтруктураШапкиДокумента);

	КонецЕсли; 	
	
	УправлениеЗапасамиПартионныйУчет.СформироватьПроводкиПоПоступлениюТМЦ(СтруктураШапкиДокумента, Отказ, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете, СтруктураШапкиДокумента.ОтражатьВНалоговомУчете);
	
	
	
	ПроводкиБУ = Движения.Хозрасчетный;
	//вадим
	 СоздатьДвиженияПоЛизенгу(ПроводкиБУ);
	//ВадимКонец
	// Движения по взаиморасчетам
	Если мСтруктураПараметровВзаиморасчетов.ПроводитьПоВзаиморасчетам Тогда
		СкладПроводок = Справочники.Склады.ПустаяСсылка();
		Если ТаблицаПоТоварам.Количество()>0 Тогда
			Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
				СкладПроводок = ТаблицаПоТоварам[0].Склад;
			ИначеЕсли ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
				СкладПроводок = ТаблицаПоТоварам[0].ПриходныйОрдерСклад;
			КонецЕсли;
		КонецЕсли;

		//начало изменений 
		//ТаблицаПоВзаиморасчетамВспом =ТаблицаПоВзаиморасчетам.Скопировать();
		Если ТаблицаНДФЛ <> Неопределено Тогда
			//Для Каждого ТекСТрока Из ТаблицаПоВзаиморасчетамНДФЛ Цикл
			//	НоваяСтрока 					  = ТаблицаПоВзаиморасчетамВспом.Добавить();
			//	НоваяСтрока.Сделка				  = ТекСТрока.Сделка;
			//	НоваяСтрока.СуммаВзаиморасчетов   = -1*ТекСТрока.СуммаВзаиморасчетов;
			//	НоваяСтрока.СуммаРегл			  = -1*ТекСТрока.СуммаРегл;
			//	НоваяСтрока.СуммаУпр			  = -1*ТекСТрока.СуммаУпр;
			//КонецЦикла;	
			//ТаблицаПоВзаиморасчетамВспом.Свернуть("Сделка","СуммаУпр,СуммаРегл,СуммаВзаиморасчетов");
		КонецЕсли;
		СтруктураПараметровЗачетАванса = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаСтруктурыПараметровДляЗачетаАванса(Ссылка, мВалютаРегламентированногоУчета, Заголовок,, ТаблицаПоВзаиморасчетам, СтруктураШапкиДокумента);
		//СтруктураШапкиДокумента.СтруктураПодготовленныхТаблиц.Вставить("ТаблицаНДФЛ");
		//конец изменений 
		Если НЕ СтруктураПараметровЗачетАванса = Ложь Тогда
			// Движения по регистру сведений РасчетыПоПриобретениюОрганизации
			// и проводки по зачету аванса
			ТаблицаРасчетовПоПриобретению = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовитьТаблицуДляРегистраРасчетовПоПриобретению(
				мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента,ТаблицаНДФЛ);
			СтруктураПараметровЗачетАванса.Вставить("Склад", СкладПроводок);
			СтруктураПараметровЗачетАванса.Вставить("УЗ_НесколькоСФ", УЗ_НесколькоСФ); //m.ionov@a-prof.ru 19.02.2014
			СуммаАванса = БухгалтерскийУчетРасчетовСКонтрагентами.ЗачетАванса(СтруктураПараметровЗачетАванса, 
				ПроводкиБУ, мВалютаРегламентированногоУчета, РежимПроведения, ЭтотОбъект, ТаблицаРасчетовПоПриобретению);
			// Движения по регистру РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации
			Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
				СтруктураПараметровЗачетАванса.Вставить("ПроводкиНУ", Движения.Налоговый);
			Конецесли;
			БухгалтерскийУчетРасчетовСКонтрагентами.РасчетыВУсловныхЕдиницахПриобретениеРеализация(СтруктураПараметровЗачетАванса, 
				мВалютаРегламентированногоУчета, РежимПроведения, ПроводкиБУ, ЭтотОбъект, Отказ, , Истина);
		Конецесли;

	КонецЕсли;
	
	//начало изменений
	Если ТаблицаНДФЛ <> Неопределено Тогда
		Для Каждого ТекСтрока  Из ТаблицаНДФЛ Цикл
			НоваяПроводка  = Движения.Хозрасчетный.Добавить();
			НоваяПроводка.Период 	  = СтруктураШапкиДокумента.Дата;
			НоваяПроводка.Активность	 = Истина;
			НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
			НоваяПроводка.Сумма 	  = ТекСтрока.Сумма;
			НоваяПроводка.СчетДт	  = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
			//
			НоваяПроводка.Содержание 	 = "Удержан подоходный налог";
			//
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);		
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "Договоры", СтруктураШапкиДокумента.ДоговорКонтрагента);		
			///БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", ТекСтрока.НоменклатурнаяГруппа);
			//БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат", ВыборкаПоНастройкаВоды.СтатьяЗатратВодаТехнологическая);
			////												
			НоваяПроводка.СчетКт = ПланыСчетов.Хозрасчетный.НДФЛ;
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "ВидыПлатежейВГосБюджет",Перечисления.ВидыПлатежейВГосБюджет.Налог);		
			БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Контрагенты", ИМНС);
			//БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СтатьиЗатрат", ВыборкаНезавВода.СтатьяЗатрат);
			//
			//БухгалтерскийУчет.ЗаполнитьСубконто(
			//
			//НоваяПроводка.
		КонецЦикла;	
	КонецЕсли;	
	//конец изменений 
	/////Вадим 28.02.2014 16:02:09  бп 
    Если ОтражатьВБухгалтерскомУчете тогда
		НайденнаяСтрока = Услуги.Найти("Превышение лимита мобильной связи","Содержание");
		Если не НайденнаяСтрока = Неопределено Тогда
			//Движения.НДСПредъявленный.Прочитать();
			Для каждого ТекСтрока Из ТаблицаПоУслугам Цикл
				///"Превышение лимита мобильной связи по вх.док.  от "//
				Если найти(ТекСтрока.Содержание,"Превышение лимита мобильной связи")>0 тогда
					НоваяПроводка  = Движения.Хозрасчетный.Добавить();
					НоваяПроводка.Период 	  = СтруктураШапкиДокумента.Дата;
					НоваяПроводка.Активность	 = Истина;
					НоваяПроводка.Организация = СтруктураШапкиДокумента.Организация;
					НоваяПроводка.Сумма 	  = ТекСтрока.СуммаНДС;
					
					
					НоваяПроводка.СчетДт	  = ТекСтрока.СчетЗатрат;
					//
					НоваяПроводка.Содержание 	 = "Превышение лимита мобильной связи(НДС)";
					//
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, ТекСтрока.Субконто1);		
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, ТекСтрока.Субконто2);		
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, ТекСтрока.Субконто3);		
					//БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СФПолученные", 	ссылка);		
					///БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "НоменклатурныеГруппы", ТекСтрока.НоменклатурнаяГруппа);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, "СтатьиЗатрат", ВыборкаПоНастройкаВоды.СтатьяЗатратВодаТехнологическая);
					////												
					НоваяПроводка.СчетКт = ТекСтрока.СчетУчетаНДС;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Контрагенты", Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "СФПолученные", ссылка);
					
					Нов=Движения.НДСПредъявленный.Добавить();
					нов.Период=дата;
					нов.ВидДвижения=ВидДвиженияНакопления.Расход;
					нов.Организация=Организация;
					нов.СчетФактура=ссылка;
					нов.ВидЦенности=ТекСтрока.ВидЦенности;
					нов.СтавкаНДС=ТекСтрока.СтавкаНДС;
					нов.СчетУчетаНДС=ТекСтрока.СчетУчетаНДС;
					нов.Поставщик=Контрагент;
					нов.СуммаБезНДС=ТекСтрока.Сумма;
					нов.НДС=ТекСтрока.СуммаНДС;
					нов.ДатаСобытия=дата;
					нов.Событие=Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком;
					
				Конецесли;	
			КонецЦикла;
			Движения.НДСПредъявленный.Записать(Ложь);
		Конецесли;		
	Конецесли;	
 	////ВадимКонец
 

	Движения.Хозрасчетный.Записать(ложь);
	Движения.Налоговый.Записать(ложь);
   	
КонецПроцедуры // ДвиженияПоРегистрамРегл()

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, 
							  ТаблицаПоТаре, Отказ, Заголовок)
							  
	// По партиям, оприходованным по ордеру с правом продажи, возможно следует выполнить корректировку списания
	// Приходный ордер может быть указан не только в шапке, но и в табличной части как "Документ получения"
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру тогда
		
		МассивПриходныхОрдеров = Новый Массив;
		Для каждого Строка Из ТаблицаПоТоварам Цикл
		
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
			   И Строка.БезПраваПродажи =Ложь Тогда
			 МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
		
		КонецЦикла;
		
		Для каждого Строка Из ТаблицаПоТаре Цикл
		
			Если  ТипЗнч(Строка.ДокументПолучения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
			   И Строка.БезПраваПродажи =Ложь Тогда
			 МассивПриходныхОрдеров.Добавить(Строка.ДокументПолучения);
			КонецЕсли;
		
		КонецЦикла;
		
		ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивПриходныхОрдеров);
		
		// ПО РЕГИСТРУ СписанныеТовары: формируем записи с указанием приходных ордеров, которые будут обрабатываться при списании
		НаборДвижений = Движения.СписанныеТовары;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		Инд = 0;
		Для каждого Элемент Из МассивПриходныхОрдеров Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.ПоступлениеПриходныйОрдер = Элемент;
			Инд = Инд+1;
			НоваяСтрока.НомерСтрокиДокумента = Инд;
			НоваяСтрока.Организация = СтруктураШапкиДокумента.Организация;
		КонецЦикла;

		ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");

		ТаблицаДвижений.ЗаполнитьЗначения(ОтражатьВУправленческомУчете,"ОтражатьВУправленческомУчете");

		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

		Если Не Отказ Тогда
			Движения.СписанныеТовары.ВыполнитьДвижения();
		КонецЕсли;

	КонецЕсли;
	
	Если Движения.СписанныеТовары.Модифицированность() Тогда
		Движения.СписанныеТовары.Записать(Истина);
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегиструСписанныеТовары

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ НДС

// Процедура вызывается из тела процедуры ДвиженияПоРегистрам
// Формирует движения по регистрам подсистемы учета НДС.
//
Процедура ДвиженияРегистровПодсистемыНДС(СтруктураШапкиДокумента, ТаблицыДокумента, Отказ, КорректироватьНДСПредъявленный = Ложь, времТаблицаПоТаре = Неопределено) Экспорт
	
	Если Не УчетНДС.ПроводитьДокументДляЦелейНДС(СтруктураШапкиДокумента) Тогда
		// Движения по этому документу делать не нужно
		Возврат;
	КонецЕсли;
	
	Для Каждого ТаблицаДокумента Из ТаблицыДокумента Цикл

		ТабЧасть   = ТаблицаДокумента.Значение;
		
		// <- Шевченков 20170523 №65872
		Если ТаблицаДокумента.Ключ = "ТаблицаПоТоварам" И КорректироватьНДСПредъявленный И ТабЧасть.Количество() > 0 Тогда			
			
			ТабВрем = ТабЧасть.Скопировать();			
			ТабВрем.Сортировать("СуммаБезНДС УБЫВ");
			ТабВрем[0].СуммаБезНДС = ТабВрем[0].СуммаБезНДС + времТаблицаПоТаре.Итог("Стоимость");
			
			УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСПредъявленный(СтруктураШапкиДокумента, ТабВрем, Отказ);   // Шевченков 20170704 #67724
			
		Иначе
			
			Если Не ТабЧасть.Количество() = 0 Тогда 				
				УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСПредъявленный(СтруктураШапкиДокумента, ТабЧасть, Отказ);				
			КонецЕсли;
			
		КонецЕсли;
		// -> 
		 
	КонецЦикла;
	
	// Если по договору с контрагентом организация выступает в качестве налогового агента, требуется отразить начисление НДС
	Если СтруктураШапкиДокумента.УчетАгентскогоНДС Тогда
        УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСНачисленный_ПоступлениеАгентскогоНДС(СтруктураШапкиДокумента);
	КонецЕсли; 
	
	// При необходимости, отражаем в регистре партионного учета для НДС
	// Отражение партий по товарам
	Если (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия 
			Или СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование)
		И ТаблицыДокумента.Свойство("ТаблицаПоТоварам") 
		И Не ТаблицыДокумента.ТаблицаПоТоварам.Количество() = 0 Тогда
		
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, ТаблицыДокумента.ТаблицаПоТоварам.Скопировать(), , Отказ);
	КонецЕсли;
		
	// Отражение партий по оборудованию
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование
		И (ТаблицыДокумента.Свойство("ТаблицаПоОборудованию") 
				И Не ТаблицыДокумента.ТаблицаПоОборудованию.Количество() = 0) Тогда
				
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, ТаблицыДокумента.ТаблицаПоОборудованию.Скопировать(), , Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры // ДвиженияРегистровПодсистемыНДС()

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке)

	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "ВалютаУправленческогоУчета"        , "ВалютаУправленческогоУчета");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"             , "КурсВалютыУправленческогоУчета"    , "КурсВалютыУправленческогоУчета");
    УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "НастройкаСпособовВеденияУправленческогоПартионногоУчета", "СпособВеденияПартионногоУчетаПоОрганизации", "СпособВеденияПартионногоУчетаПоОрганизации");
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьДеревоПолейЗапросаПоШапкеРегл(ДеревоПолейЗапросаПоШапке)
	

КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиТоварыРегл(СтруктураПолей, СтруктураШапкиДокумента)

	СтруктураПолей.Вставить("СчетУчетаБУ"                      , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС"                     , "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ"                      , "СчетУчетаНУ");
	СтруктураПолей.Вставить("ОтражениеВУСН"                    , "ОтражениеВУСН");

	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараУпр(СтруктураПолей)


КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараРегл(СтруктураПолей, СтруктураШапкиДокумента)

	СтруктураПолей.Вставить("СчетУчетаБУ"          , "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНУ"          , "СчетУчетаНУ");

	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиУслугиУпр(СтруктураПолей)

	СтруктураПолей.Вставить("НоменклатурнаяГруппа",           "НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("Цена",                           "Цена");
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиУслугиРегл(СтруктураПолей)

	СтруктураПолей.Вставить("НоменклатурнаяГруппа",     "НоменклатурнаяГруппа");
	СтруктураПолей.Вставить("ПодразделениеОрганизации", "ПодразделениеОрганизации");
	СтруктураПолей.Вставить("ОбъектСтроительства",      "ОбъектСтроительства");
	СтруктураПолей.Вставить("СпособСтроительства",      "СпособСтроительства");
	СтруктураПолей.Вставить("СчетЗатрат",   "СчетЗатрат" );
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетЗатратНУ", "СчетЗатратНУ" );
	СтруктураПолей.Вставить("Субконто1",    "Субконто1");
	СтруктураПолей.Вставить("Субконто2",    "Субконто2");
	СтруктураПолей.Вставить("Субконто3",    "Субконто3");
	СтруктураПолей.Вставить("СубконтоНУ1",  "СубконтоНУ1");
	СтруктураПолей.Вставить("СубконтоНУ2",  "СубконтоНУ2");
	СтруктураПолей.Вставить("СубконтоНУ3",  "СубконтоНУ3");
	СтруктураПолей.Вставить("ОтражениеВУСН",  "ОтражениеВУСН");

КонецПроцедуры

// Дополняет полями, нужными для упр. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеУпр(СтруктураПолей)


КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеРегл(СтруктураПолей, СтруктураШапкиДокумента)

	СтруктураПолей.Вставить("СчетУчетаБУ",  "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ",  "СчетУчетаНУ");

	//Для определения счетов учета при проведении документов
	Если СтруктураШапкиДокумента.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("СкладВидСклада"            , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("СкладВидСклада"            , "Склад.ВидСклада");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет полями, нужными для регл. учета
Процедура ДополнитьСтруктуруПолейТабличнойЧастиОбъектыСтроительстваРегл(СтруктураПолей, СтруктураШапкиДокумента)

	СтруктураПолей.Вставить("СчетУчетаБУ",  "СчетУчетаБУ");
	СтруктураПолей.Вставить("СчетУчетаНДС", "СчетУчетаНДС");
	СтруктураПолей.Вставить("СчетУчетаНУ",  "СчетУчетаНУ");

КонецПроцедуры

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок, СтруктураШапкиДокумента)
	мУчетнаяПолитика   = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиУпр(Дата,истина);
    Если НЕ ЗначениеЗаполнено(мУчетнаяПолитика) Тогда
		Отказ = Истина;
	КонецЕсли;

	Если НЕ (СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете
		ИЛИ СтруктураШапкиДокумента.ОтражатьВНалоговомУчете) Тогда
		
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаРегл = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(Дата, Организация,истина);
    Если НЕ ЗначениеЗаполнено(УчетнаяПолитикаРегл) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	ТипОснования = ТипЗнч(Основание);

	Если ТипОснования = Тип("ДокументСсылка.ЗаказПокупателя") Тогда

		Если Не Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
			Возврат;
		КонецЕсли;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку;
		
		Сделка = Основание;
		
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		
		// Заполним табличные части неполученными ТМЦ по заказу поставщику.
		ЗаполнитьТоварыПоОстаткамУпр("ВПереработку");
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
        ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		СкладОрдер     = Основание.Склад;

		ОрганизацияКонтрагента = ЗаполнениеДокументов.ПолучитьОрганизациюПоКонтрагенту(Основание.Контрагент);

		Если ЗначениеЗаполнено(ОрганизацияКонтрагента) Тогда
			
			// Документ не отражается в управленческом учете (внутреняя передача товара),
			// поменяем организацию и контрагента местами.
			Организация = ОрганизацияКонтрагента;
			Контрагент  = ЗаполнениеДокументов.ПолучитьКонтрагентаПоОрганизации(Основание.Организация);

			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;

			// Заполним номер и дату вхоящего документа.
			НомерВходящегоДокумента = Основание.Номер;
			ДатаВходящегоДокумента  = Основание.Дата;
			
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
			
		Иначе
			//переносить контрагента и договор нет смысла при такой цепочке
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;

		СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;

		// Заполним табличные части.
		ЗаполнитьТоварыПоОснованиюРеализация(Основание);
		ЗаполнитьУслугиПоОснованиюРеализация(Основание);
		ЗаполнитьВозвратнуюТаруПоОснованиюРеализация(Основание);

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.ВидОперации <> Перечисления.ВидыОперацийПередачаТоваров.ВПереработку Тогда
			//договор мог уже заполниться - перезаполним
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);

			Возврат;
		КонецЕсли;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		// Заполнение шапки.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
		СчетУчетаРасчетовПоТаре      = Основание.СчетУчетаРасчетовПоТаре;
		ВидОперации					 = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку;
		
		ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект, мСтруктураПараметровДляПолученияДоговора);
		
		Для Каждого ТекСтрокаВозвратнаяТара Из Основание.ВозвратнаяТара Цикл
			
			НоваяСтрока = ВозвратнаяТара.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаВозвратнаяТара);
			
		КонецЦикла;
		
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			
			// Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ЭтотОбъект, "Приобретение"); 
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			                                         Контрагент, ТипЦен, ДоговорКонтрагента, Дата,ВалютаДокумента, УчитыватьНДС,СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(НоваяСтрока, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета); 

			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
	
		КонецЦикла;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику")
	 ИЛИ ТипОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ОтражатьВУправленческомУчете = Истина;
		Ответственный = Основание.Ответственный;
		//m.ionov@a-prof.ru 26/11/2013
		Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			УЗ_Спецификация = Основание.УЗ_Спецификация; 
		КонецЕсли;
		//------ m.ionov@a-prof.ru
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			//сейчас возможности ввести заказ поставщику на основании счета в случае договора по счетам не поддерживается
             //поэтому считаем что Основание - всегда счет
			Сделка = Основание;
		Иначе  //по заказам или по договору в целом
			Если   ТипОснования  = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
				Сделка = Основание;
			ИначеЕсли ТипЗнч(Основание.ДокументОснование)  = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Сделка = Основание.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		// Не нужно заполнять табличные части, если основание заказ поставщику на переработку.
		Если (ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику")) Тогда
			Если Основание.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.Переработка Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;	

		
		Если Основание.Оборудование.Количество() = 0 Тогда
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование;
		КонецЕсли;

		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		СкладОрдер     = Основание.Склад;
        		
		Если ЗначениеЗаполнено(Сделка) И Сделка.Проведен Тогда
			
			// Заполним табличные части неполученными ТМЦ по заказу поставщику.
			ЗаполнитьТоварыПоОстаткамУпр();
			ЗаполнитьВозвратнуюТаруПоОстаткамУпр();
			ЗаполнитьУслугиПоОстаткамУпр();
			
			Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
				ЗаполнитьОборудованиеПоОстаткамУпр();
			КонецЕсли;
			
			ЗаполнитьСчетаУчетаВТабЧасти(Товары, "Товары", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
			
			ЗаполнитьСчетаУчетаВТабЧасти(ВозвратнаяТара, "ВозвратнаяТара", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			
			СкопироватьОборудование(Основание);
			СкопироватьТовары(Основание);
			СкопироватьВозвратнуюТару(Основание);
			СкопироватьУслуги(Основание);
			
		КонецЕсли;
		
		ОчиститьСкладПриВидеОперацииОборудование(Ложь);

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		СкладОрдер     = Основание;
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру;
		
		Если Контрагент.ОсновнойДоговорКонтрагента.Организация = Организация и
			Контрагент.ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			ДоговорКонтрагента           = Контрагент.ОсновнойДоговорКонтрагента;
		Иначе
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ Первые 1 Ссылка 
			|ИЗ Справочник.ДоговорыКонтрагентов
			|Где Организация = &Организация и Владелец = &Контрагент и ВидДоговора = &ВидДоговора и ПометкаУдаления = ложь";
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Организация",Организация);
			Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			
			ВыборкаДоговоров = Запрос.Выполнить().Выбрать();
			Если ВыборкаДоговоров.Следующий() Тогда
				ДоговорКонтрагента = ВыборкаДоговоров.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ТипЦен                       = ДоговорКонтрагента.ТипЦен;
		УчитыватьНДС                 = Истина;
		СуммаВключаетНДС             = ТипЦен.ЦенаВключаетНДС;
		СуммаВключаетНДС             = ?(ЗначениеЗаполнено(ТипЦен), ТипЦен.ЦенаВключаетНДС, Истина);
		ВалютаДокумента              = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		СтруктураКурса               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВзаиморасчетов           = СтруктураКурса.Курс;
		КратностьВзаиморасчетов      = СтруктураКурса.Кратность;

		Если Основание.Проведен Тогда

			// Заполним табличную часть "Товары" по приходному ордеру на товары.
			ЗаполнитьТоварыПоОснованиюУпр(Основание, Товары);
			ЗаполнитьТоварыПоОснованиюУпр(Основание, ВозвратнаяТара);
		КонецЕсли;
	//m.ionov@a-prof.ru 25.02.2015
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПКК_АктНачисленияБонусовУслуг") Тогда
		
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		
		ПКК_АктНачисленияБонусов = Основание;
						
		ТипЦен                       = ДоговорКонтрагента.ТипЦен;
		УчитыватьНДС                 = Истина;
		СуммаВключаетНДС             = ТипЦен.ЦенаВключаетНДС;
		СуммаВключаетНДС             = ?(ЗначениеЗаполнено(ТипЦен), ТипЦен.ЦенаВключаетНДС, Истина);
		ВалютаДокумента              = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		СтруктураКурса               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсВзаиморасчетов           = СтруктураКурса.Курс;
		КратностьВзаиморасчетов      = СтруктураКурса.Кратность;
		
		СтрокаТабличнойЧасти = Услуги.Добавить();
		СтрокаТабличнойЧасти.Количество = 1;
		СтрокаТабличнойЧасти.Цена = Основание.СуммаДокумента;
		СтрокаТабличнойЧасти.Сумма = Основание.СуммаДокумента;
		
		// Рассчитываем реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		
		Если Основание.ТабличнаяЧасть.Количество() > 0 Тогда
			СтрокаТабличнойЧасти.СтатьяЗатрат = Основание.ТабличнаяЧасть[0].Бонус.СтатьяЗатрат;
		КонецЕсли;

		ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТабличнойЧасти, "Услуги", ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);    		

	//----m.ionov@a-prof.ru---

	ИначеЕсли ТипОснования = Тип("СправочникСсылка.НастройкиЗаполненияФорм") Тогда
		
		ХранилищаНастроек.ДанныеФорм.ЗаполнитьОбъектПоНастройке(ЭтотОбъект, Основание, Документы.ПоступлениеТоваровУслуг.СтруктураДополнительныхДанныхФормы());
		
	КонецЕсли;

	УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ЭтотОбъект, мСтруктураПараметровВзаиморасчетов);
	
	// Заполним значения счетов по бухгалтерскому и налоговому учету.
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Услуги Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	
	ЗаполнитьСчетаУчетаВТабЧасти(Товары, 		 "Товары", 			ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(Услуги, 		 "Услуги", 			ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(ВозвратнаяТара, "ВозвратнаяТара", 	ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	ЗаполнитьСчетаУчетаВТабЧасти(Оборудование, 	 "Оборудование", 	ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполнитьСтруктуруСчетовУчетаШапки());
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, "Покупка");
	// Скорректируем заполнившиеся по умолчанию признаки отражения в учетах
	Если  ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		ОтражатьВНалоговомУчете = Ложь;
	КонецЕсли;
	//Заполним склад значением корректного типа
	Если НЕ ЗначениеЗаполнено(СкладОрдер) Тогда
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
			СкладОрдер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
		Иначе
			СкладОрдер = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Сделка) И ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") 
		И Сделка.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.Переработка Тогда
		НДСВключенВСтоимость    = Истина;
		УчитыватьНДС            = Ложь;
		СуммаВключаетНДС        = Ложь;
	КонецЕсли; 
	Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		РегистрироватьЦеныПоставщика = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РегистрироватьЦеныПоставщика");
	КонецЕсли;
	//31_01_14 Бирюков нужно учитывать во взаиморасчетах сумму по табчасти "Тара"
	НеУчитыватьТару = Ложь;
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект,,НеУчитыватьТару);
//	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//начало изменений Ожиганов проведение с 0 количество   
	Если ПРГ_ДатаСоздания = '00010101' и ЭтоНовый() Тогда
		ПРГ_ДатаСоздания  = ТекущаяДата();
	КонецЕсли;	
	//начало изменений Ожиганов 29.05.2015 немножко оптимизируем 
	ПРГ_ДопФункцииКлиентСервер.ДобавитьВОбъектСвойстваДляУдаленияДвижения(ЭтотОбъект,РежимЗаписи);
	//конец изменений 	
	
	//конец изменений 
	////Вадим 14.01.2014 8:01:57  бп на всякий случай проверяем заполнения количества в услугах.
	//начало изменений БП 04
	ПустНомГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	//конец изменений БП 04 
 	Для каждого стр Из Услуги Цикл
  		Если стр.количество=0 тогда	
			стр.количество=1;
		Конецесли;	
		//m.ionov@a-prof.ru 21.02.2014
		Если стр.СчетФактура = Неопределено Тогда
			стр.СчетФактура = Документы.СчетФактураПолученный.ПустаяСсылка();
		КонецЕсли;
		//----m.ionov@a-prof.ru---
		//начало изменений БП 04 
		стр.НоменклатурнаяГруппа = ПустНомГруппа;
		//конец изменений БП 04 
  	КонецЦикла;
    ////ВадимКонец
	мУдалятьДвижения = НЕ ЭтоНовый();
	//m.ionov@a-prof.ru 21.05.2014
	Если Проведен И ПараметрыСеанса.ПроведениеДокументов Тогда
		//Далее идут только проверки и очистки реквизитов которые сделались при первом проведении документа
		Возврат;
	КонецЕсли;
	

	ОчиститьНенужныеТабличныеЧасти();

	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Оборудование);
	
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Товары);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Услуги);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, Оборудование);
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьСтавкуНДС(ЭтотОбъект, ОбъектыСтроительства);

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	//31_01_14 Бирюков нужно учитывать во взаиморасчетах сумму по табчасти "Тара"
	НеУчитыватьТару = Ложь;
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект,,НеУчитыватьТару);
//	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%                          
	Если УЗ_ПоказыватьСуммыВРублях и ВозвратнаяТара.Итог("УЗ_СуммаРегл")  =0 
	 и ВозвратнаяТара.Количество() > 0
	 и ВалютаДокумента <> мВалютаРегламентированногоУчета
	Тогда
		для Каждого ТекСтрока Из ВозвратнаяТара Цикл
			ТекСтрока.УЗ_СуммаРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,ВалютаДокумента,мВалютаРегламентированногоУчета,КурсВзаиморасчетов,1,КратностьВзаиморасчетов,1);
		КонецЦикла;
	КонецЕсли;
	
	
	УчетНДС.СинхронизацияПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураПолученный");

	// Заполнить склад и ордер в табличных частях
	СкладИзШапки    =  (Не мУказаниеСкладовВТЧ) И (ВидПоступления <> Перечисления.ВидыПоступленияТоваров.ПоОрдеру);

	УправлениеЗаказами.ЗаполнитьЗаказПоставщикуВТЧ(ВидОперации,ЭтотОбъект, "Поступление");
	//при поступлении в переработку все товары должны быть зарезервированы под заказ из шапки
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку и ЗначениеЗаполнено(Сделка) Тогда
		Для каждого СтрокаТЧ из Товары цикл
			СтрокаТЧ.Заказ = Сделка;
		КонецЦикла;
	КонецЕсли;

	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, Товары,         СкладИзШапки);
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, ВозвратнаяТара, СкладИзШапки);
	ОбработкаТабличныхЧастей.ЗаполнитьСкладИОрдерВСтрокахТабЧасти(ЭтотОбъект, Оборудование,   СкладИзШапки);
	
	Если Не мУказаниеПроектовВТабличнойЧастиДокументов Тогда
		УправлениеПроектами.ЗаполнитьПроектВСтрокахТабЧасти(ЭтотОбъект, Услуги);
	КонецЕсли;

	// Удаление неиспользуемых строк табличной части "Серийные номера".
	УчетСерийныхНомеров.УдалитьНеиспользуемыеСтрокиПодчиненнойТЧ(ЭтотОбъект, мПараметрыСвязиСтрокТЧ, "Товары");

	// Заполним субконто затрат
	СчетаУчетаВДокументах.ЗаполнитьСубконтоТабличнойЧасти("Услуги", ЭтотОбъект, ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчете);
	
	
	
	//начало изменений  что не делить взаиморасчеты по таре
	СчетУчетаРасчетовПоТаре = СчетУчетаРасчетовСКонтрагентом;
	//конец изменений  
	//Blik 090614 28733 н
	Если ЭтотОбъект.ДоговорКонтрагента.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.НАЙМ_ПЕРСОНАЛА Тогда
		Если (ЭтотОбъект.этотобъект.ПометкаУдаления) И (НЕ ЭтотОбъект.ссылка.ПометкаУдаления) Тогда 
			НаборЗаписей = РегистрыСведений.ПРГ_ПредоставленныеДокументыЭТК.СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.Контрагент.Установить(ЭтотОбъект.Контрагент); 
			НаборЗаписей.Отбор.Договор.Установить(ЭтотОбъект.ДоговорКонтрагента); 
			НаборЗаписей.Отбор.ДокументОтражения.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Записать(); 
			
		КонецЕсли;
	КонецЕсли;
//Blik 090614 28733 к
	// <- Шевченков №50334 20160321
	Если ДоговорКонтрагента.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.Мерчендайзинг Тогда
		Если (Ссылка.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда 
			НаборЗаписей = РегистрыСведений.ПРГ_ПредоставленныеДокументыУМЧ.СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.Контрагент.Установить(Контрагент); 
			НаборЗаписей.Отбор.Договор.Установить(ДоговорКонтрагента); 
			НаборЗаписей.Отбор.ДокументОтражения.Установить(Ссылка);
			НаборЗаписей.Записать(); 
			
		КонецЕсли;
	КонецЕсли;	
	// ->
    //Blik 060715 41027 н
	Если ДоговорКонтрагента.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.НайтиПоНаименованию("Премии (скидки)")  //Blik 290915 44343
		и  ЗначениеЗаполнено(ПКК_АктНачисленияБонусов) Тогда
		//Если 	
		
		НаборЗаписей = РегистрыСведений.ПРГ_ПредоставленныеБА.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент); 
		НаборЗаписей.Отбор.Договор.Установить(ДоговорКонтрагента); 
		НаборЗаписей.Отбор.ДокументОтражения.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Отбор.Дата.Установить(ЭтотОбъект.Дата);//Blik 290915 44343
		НаборЗаписей.Записать(); 
	КонецЕсли;
	//Blik 060715 41027 к

	мТабличнаяЧастьМодифицирована = ТабличнаяЧастьМодифицирована();

	//m.ionov@a-prof.ru 08.10.2014
	Если НЕ ДоступенСтатусДокумента() Тогда
		СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.ПустаяСсылка();
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете И Не МожноОтражатьВБУУчете() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Документ " + СокрЛП(ЭтотОбъект) + " отражен в БУ учете, у вас нет прав на его изменение", Отказ);
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	// <- Шевченков 54324 20160714
	Если ПометкаУдаления И ЗначениеЗаполнено(ПКК_АктНачисленияБонусов) Тогда
		
		Сообщить("Поле ""Акт начисления бонусов/услуг"" было очищено. Старое значение: " + Строка(ПКК_АктНачисленияБонусов));
		ПКК_АктНачисленияБонусов = Документы.ПКК_АктНачисленияБонусовУслуг.ПустаяСсылка();		
	
	КонецЕсли;
	// ->
	
КонецПроцедуры // ПередЗаписью

// Процедура - обработчик события "ПриЗаписи"
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	УчетНДС.ПроверитьСоответствиеРеквизитовСчетаФактуры(ЭтотОбъект, "СчетФактураПолученный");
	
	//m.ionov@a-prof.ru 21.05.2014
	Если Проведен И ПараметрыСеанса.ПроведениеДокументов Тогда
		//Далее идут только проверки и очистки реквизитов которые сделались при первом проведении документа
		Возврат;
	КонецЕсли;
	
	
	//Бирюков Создадим серию для копекеров и сохраним ее реквизиты
	Для каждого Строка Из Товары Цикл
		Если СкладОрдер.ПРГ_СкладКопекера Тогда 
			СуффиксНаименованияСерии = "К";
			Если НЕ ЗначениеЗаполнено(Строка.СерияНоменклатуры) Тогда
				НоваяСерия = ПРГ_ДопФункцииКлиентСервер.СоздатьСериюНоменклатуры(Строка, ЭтотОбъект, СуффиксНаименованияСерии);
				Строка.СерияНоменклатуры = НоваяСерия;
			КонецЕсли;	
		Иначе
			СуффиксНаименованияСерии = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.СерияНоменклатуры) Тогда
			ОбъектСерии  = Строка.СерияНоменклатуры.ПолучитьОбъект();
			Если НЕ ОбъектСерии = Неопределено тогда
				Ошибка = Истина;
				КодСерии = СокрЛП(Строка.СерияНоменклатуры.Код);
				Старт = 1;
				Пока Ошибка Цикл
					Попытка
						КодСерии = Число(Сред(КодСерии,Старт));
						Ошибка = Ложь;
					Исключение
						Ошибка = Истина;
						Старт = Старт + 1;
					КонецПопытки;
				КонецЦикла;
				НаименованиеСерии =   СокрЛП(Формат(КодСерии,"ЧГ=")) + СуффиксНаименованияСерии;
				Если СокрЛП(Строка.СерияНоменклатуры.Наименование) <> СокрЛП(НаименованиеСерии) Тогда
					ОбъектСерии.Наименование  = НаименованиеСерии;
					ОбъектСерии.СерийныйНомер = ""+СокрЛП(НомерВходящегоДокумента)+"_"+ Формат(ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
				КонецЕсли;
				Если Строка.НомерГТД <> Строка.СерияНоменклатуры.НомерГТД Тогда
					ОбъектСерии.НомерГТД = Строка.НомерГТД;
				КонецЕсли;
				Если Строка.СтранаПроисхождения <> Строка.СерияНоменклатуры.СтранаПроисхождения Тогда
					ОбъектСерии.СтранаПроисхождения = Строка.СтранаПроисхождения;
				КонецЕсли;
				Если Строка.УЗ_КоличествоТарныхМест <> Строка.СерияНоменклатуры.УЗ_КоличествоТарныхМест Тогда
					ОбъектСерии.УЗ_КоличествоТарныхМест = Строка.УЗ_КоличествоТарныхМест;
				КонецЕсли;
				Если Строка.УЗ_ДатаВыработки <> Строка.СерияНоменклатуры.УЗ_ДатаВыработки Тогда
					ОбъектСерии.УЗ_ДатаВыработки = Строка.УЗ_ДатаВыработки;
				КонецЕсли;
				Если Цел((ТекущаяДата() - Дата)/(3600*24)) < 5 Тогда
					ОбъектСерии.ОбменДанными.Загрузка = Истина
				КонецЕсли;
				//начало изменений Ожиганов 30.05.2015 немножко оптимизируем 
				Если ОбъектСерии.Модифицированность() Тогда
					ОбъектСерии.Записать();
				КонецЕслИ;	
				//конец изменений 
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	//m.ionov@a-prof.ru 23.09.2014
	Если Не Отказ
		И ДоступенСтатусДокумента() Тогда
		//Запишем изменение статуса
		ЗаписатьИзменениеСтатусов(Отказ);
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
КонецПроцедуры

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения=неопределено,Отказ=ложь) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокументаИПроверитьОтражениеВУчете(ЭтотОбъект, Отказ, Заголовок);
	
	//m.ionov@a-prof.ru 19.02.2014
	Если УЗ_НесколькоСФ Тогда
		СтруктураШапкиДокумента.Вставить("ДоговорКонтрагента", ?(Услуги.Количество() > 0,Услуги[0].ДоговорКонтрагента,ДоговорКонтрагента));	
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	ОбщегоНазначенияКлиентСервер.ДобавитьВСтруктуруШапкиСведенияОСчетахРасчетов(ЭтотОбъект, СтруктураШапкиДокумента);
	
	Если РежимПроведения = Неопределено Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("РежимПроведения", РежимПроведения);

	// Для определения где нужно проверять склад: в шапке или в ТЧ.
	СтруктураШапкиДокумента.Вставить("СкладВТабличнойЧасти", мУказаниеСкладовВТЧ);

	// Если есть колонка заказ, то заполнение поля Сделка не обязательно
	ЗаказВТабличнойЧасти = УправлениеЗаказами.ЕстьЗаказВТабличнойЧасти(СтруктураШапкиДокумента.ВидОперации, СтруктураШапкиДокумента.ДоговорКонтрагента, "Поступление"); //m.ionov@a-prof.ru 19.02.2014
	СтруктураШапкиДокумента.Вставить("ЗаказВТабличнойЧасти", ЗаказВТабличнойЧасти);
	
	

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();
	//m.ionov@a-prof.ru 21.02.2014
	Если УЗ_НесколькоСФ Тогда
		СтруктураШапкиДокумента.Вставить("ВедениеВзаиморасчетов", СтруктураШапкиДокумента.ДоговорКонтрагента.ВедениеВзаиморасчетов);
		СтруктураШапкиДокумента.Вставить("ВалютаВзаиморасчетов", СтруктураШапкиДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		СтруктураШапкиДокумента.Вставить("ДоговорОрганизация", СтруктураШапкиДокумента.ДоговорКонтрагента.Организация);
		СтруктураШапкиДокумента.Вставить("ВидДоговора", СтруктураШапкиДокумента.ДоговорКонтрагента.ВидДоговора);
		СтруктураШапкиДокумента.Вставить("УчетАгентскогоНДС", СтруктураШапкиДокумента.ДоговорКонтрагента.УчетАгентскогоНДС);
		СтруктураШапкиДокумента.Вставить("ВидАгентскогоДоговора", СтруктураШапкиДокумента.ДоговорКонтрагента.ВидАгентскогоДоговора);
		СтруктураШапкиДокумента.Вставить("НалоговыйАгентПоОплате", СтруктураШапкиДокумента.ДоговорКонтрагента.НалоговыйАгентПоОплате);
		СтруктураШапкиДокумента.Вставить("РасчетыВУсловныхЕдиницах", СтруктураШапкиДокумента.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах);
		СтруктураШапкиДокумента.Вставить("ВестиПоДокументамРасчетовСКонтрагентом", СтруктураШапкиДокумента.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом);
				
	Иначе
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВедениеВзаиморасчетов"                   , "ВедениеВзаиморасчетов");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВалютаВзаиморасчетов"                    , "ВалютаВзаиморасчетов");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "Организация"                             , "ДоговорОрганизация");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВидДоговора"                             , "ВидДоговора");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "УчетАгентскогоНДС"                       , "УчетАгентскогоНДС");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВидАгентскогоДоговора"                   , "ВидАгентскогоДоговора");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "НалоговыйАгентПоОплате"                  , "НалоговыйАгентПоОплате");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "РасчетыВУсловныхЕдиницах"                , "РасчетыВУсловныхЕдиницах");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВестиПоДокументамРасчетовСКонтрагентом"  , "ВестиПоДокументамРасчетовСКонтрагентом");
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Организация",          "ОтражатьВРегламентированномУчете"        , "ОтражатьВРегламентированномУчете");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка",               "ВидОперации"                             , "СделкаВидОперации");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"              , "ВидОперации"                             , "СделкаВидОперации");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",      "СписыватьПартииПриПроведенииДокументов"  , "СписыватьПартииПриПроведенииДокументов");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",      "ВестиПартионныйУчетПоСкладам"            , "ВестиПартионныйУчетПоСкладам");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "НеВключатьНДСВСтоимостьПартий"           , "НеВключатьНДСВСтоимостьПартий");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВедениеУчетаПоПроектам"                  , "ВедениеУчетаПоПроектам");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика"     , "ВестиУчетТоваровОрганизацийВРазрезеСкладов"   , "ВестиУчетТоваровОрганизацийВРазрезеСкладов");
	//начало изменений Ожиганов 30.05.2015 немножко оптимизируем 
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка",               "Дата"                             , "ДатаСделки");
	//конец изменений 
	//начало изменений Ожиганов 31.05.2015 немножко оптимизируем 
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ВЫРАЖЕНИЕ",               "ЕстьNULL(Док.СкладОрдер.ПРГ_СкладКопекера,Ложь)", "ПРГ_СкладКопекера");
	//конец изменений 
	//начало изменений Ожиганов 29.02.2016 49618 учет доп.соглашений в учетной системе 1С 
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"                 , "СуммаПоДоговору"                         , "ПРГ_СуммаПоДоговору");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"                 , "ПРГ_КоличествоПоДоговору"                , "ПРГ_КоличествоПоДоговору");
	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"                 , "ПРГ_КонтрольЗакупок"                     , "ПРГ_КонтрольЗакупок");
	//конец изменений 
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "ВидСклада",                              "ВидСклада");
	Иначе
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "Склад",                                  "СкладПриходногоОрдера");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер",       "Склад.ВидСклада",                        "ВидСклада");
	КонецЕсли;

	УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "СкладОрдер"      , "БезПраваПродажи"                   , "БезПраваПродажи");
	
	// Если сделка - Заказ поставщику, то надо цену для проведения пересчитать в валюту заказа.
	Если ЗначениеЗаполнено(Сделка) 
	   И (ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")
		  ИЛИ ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "ВалютаДокумента"                       , "ВалютаЗаказа");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КурсВзаиморасчетов"                    , "КурсВзаиморасчетовЗаказа");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Сделка"          , "КратностьВзаиморасчетов"               , "КратностьВзаиморасчетовЗаказа");
	КонецЕсли;

	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке);

	// Если надо пересчитывать цену в валюту заказа. то в структуре должна быть заполнена валюта заказа.
	ВалютаЗаказа = Неопределено;
	НужнаЦенаЗаказа = Ложь;
	Если СтруктураШапкиДокумента.Свойство("ВалютаЗаказа", ВалютаЗаказа) Тогда
		НужнаЦенаЗаказа = Истина;
		Если ВалютаЗаказа = мВалютаРегламентированногоУчета Тогда
			КурсЗаказа      = 1;
			КратностьЗаказа = 1;
		Иначе //ВалютаЗаказа = ВалютаВзаиморасчетов
			КурсЗаказа      = СтруктураШапкиДокумента.КурсВзаиморасчетовЗаказа;
			КратностьЗаказа = СтруктураШапкиДокумента.КратностьВзаиморасчетовЗаказа;
		КонецЕсли;
		СтруктураШапкиДокумента.Вставить("КурсЗаказа"     , КурсЗаказа);
		СтруктураШапкиДокумента.Вставить("КратностьЗаказа", КратностьЗаказа);
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("НужнаЦенаЗаказа", НужнаЦенаЗаказа);
	
	// Здесь контролировать сумму задолженности, предоплату и число дней задолженности не надо
	СтруктураШапкиДокумента.Вставить("КонтролироватьСуммуЗадолженности", Ложь);
	СтруктураШапкиДокумента.Вставить("ПроцентПредоплаты", 0);
	СтруктураШапкиДокумента.Вставить("КонтролироватьЧислоДнейЗадолженности", Ложь);

	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьДеревоПолейЗапросаПоШапкеУпр(ДеревоПолейЗапросаПоШапке);
	ДополнитьДеревоПолейЗапросаПоШапкеРегл(ДеревоПолейЗапросаПоШапке);
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

//Процедура добавляет в структуру полей сведения о СтатьеЗатрат и НоменклатурнойГруппе из Номенклатуры
//	Эти сведения впоследствии могут пригодиться для заполнения незаполненных Статьи и НоменклатурнойГруппы
//	Также процедура готовит структуру, сопоставляющую поля из табличной части документа и поля из номенклатуры
Процедура ДополнитьСтруктуруПолейДаннымиНоменклатуры(СтруктураПолей, СтруктураОбрабатываемыхКолонок, СтруктураЗависимыхКолонок)
	//Поля для заполнения 
	СтруктураПолей.Вставить("СтатьяЗатратНоменклатуры", "Номенклатура.СтатьяЗатрат");
	СтруктураПолей.Вставить("ХарактерЗатратНоменклатуры", "Номенклатура.СтатьяЗатрат.ХарактерЗатрат");
	СтруктураПолей.Вставить("НоменклатурнаяГруппаНоменклатуры", "Номенклатура.НоменклатурнаяГруппаЗатрат");

	СтруктураОбрабатываемыхКолонок.Вставить("СтатьяЗатрат", 			"СтатьяЗатратНоменклатуры");
	СтруктураОбрабатываемыхКолонок.Вставить("НоменклатурнаяГруппа", 	"НоменклатурнаяГруппаНоменклатуры");
	СтруктураОбрабатываемыхКолонок.Вставить("ХарактерЗатрат", 			"ХарактерЗатратНоменклатуры");
	
	СтруктураЗависимыхКолонок.Вставить("ХарактерЗатрат", "СтатьяЗатрат");
	
КонецПроцедуры

//начало изменений Ожиганов проведение с 0 количество   
Функция ПРГ_СформироватьСтруктуруПолейТовары() Экспорт

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	//начало изменений Ожиганов 31.05.2015 немножко оптимизируем 
	СтруктураПолей.Вставить("ВидНоменклатуры"            , "Номенклатура.ВидНоменклатуры");
	
	//конец изменений 
	// Если ПРГ_СчитатьОтКоличестваНакладной Тогда // Шевченков №52760 20160527 
	Если ЗначениеЗаполнено(ПРГ_СчитатьОтКоличестваНакладной) И ПРГ_СчитатьОтКоличестваНакладной Тогда // Шевченков №52760 20160527 
		СтруктураПолей.Вставить("Количество"                , "СП_КоличествоПоНакладной* Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
		//начало изменений Ожиганов 10.04.2015 с 0 количеством  исправление проверки по 0 сумме
		СтруктураПолей.Вставить("Сумма"                     , "СП_Сумма");
		СтруктураПолей.Вставить("НДС"                       , "СП_НДС");
		//конец изменений 
		
	Иначе	
		СтруктураПолей.Вставить("Количество"                , "Количество * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
		//начало изменений Ожиганов 10.04.2015 с 0 количеством проверки по 0 сумме
		СтруктураПолей.Вставить("Сумма"                     , "Сумма");
		СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
		//конец изменений 
	КонецЕсли;	

	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"         , "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям", "Номенклатура.ВестиПартионныйУчетПоСериям");

	Возврат СтруктураПолей;

КонецФункции // СформироватьСтруктуруПолейТовары()
//конец изменений 
// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре,ТаблУслугНДФЛ) Экспорт

	СкладИзШапки    =  Не мУказаниеСкладовВТЧ;
	
	// Получим необходимые данные для проведения и проверки заполнения данные по табличной части "Товары".
	//начало изменений Ожиганов проведение с 0 количество   
	//СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
	СтруктураПолей = ПРГ_СформироватьСтруктуруПолейТовары();
	//конец изменений 

	СтруктураПолей.Вставить("Услуга"                               , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                                , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                             , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("ЗаказПокупателя"                      , "Заказ");
	СтруктураПолей.Вставить("ВидЗаказаПокупателя"                  , "Заказ.ВидОперации");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"                , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        "Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"                     , "ЕдиницаИзмерения");
	
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
		СтруктураПолей.Вставить("ВидСкладаРазмещения"                  , "Ссылка.СкладОрдер.ВидСклада");
	Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
		СтруктураПолей.Вставить("ВидСкладаРазмещения"                  , "Склад.ВидСклада");
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
		СтруктураПолей.Вставить("ВидСклада"       , "ПриходныйОрдер.Склад.ВидСклада");
	Иначе
		Если СкладИзШапки Тогда
			СтруктураПолей.Вставить("ВидСклада"   , "Ссылка.СкладОрдер.ВидСклада");
	    Иначе
			СтруктураПолей.Вставить("ВидСклада"   , "Склад.ВидСклада");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПолей.Вставить("ДокументПолучения"                    , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения"        , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("БезПраваПродажи"                      , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("Цена"                                 , "Цена");
	СтруктураПолей.Вставить("НДС"                                  , "СуммаНДС");
	СтруктураПолей.Вставить("Коэффициент"                          , "Коэффициент");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"                  , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("УчетПоСериям"                         , "Номенклатура.ВестиУчетПоСериям");
	СтруктураПолей.Вставить("СтранаПроисхождения"                  , "СерияНоменклатуры.СтранаПроисхождения");
	СтруктураПолей.Вставить("НомерГТД"                             , "СерияНоменклатуры.НомерГТД");
	СтруктураПолей.Вставить("ЗаказПоставщику"                      , "ЗаказПоставщику");
	//БП12
	СтруктураПолей.Вставить("СУчетом270НК"                         , "СУчетом270НК");
	//%%%%%%%%%%%%%%%%%%%%%%

	/// Кунов О.В., 28.05.2014
	СтруктураПолей.Вставить("КоличествоБрутто"						, "ПРГ_КоличествоБрутто");
	СтруктураПолей.Вставить("КоличествоНетто"						, "ПРГ_КоличествоНетто");
	///
	
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиТоварыРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	//m.ionov@a-prof.ru 16.02.2014
	СтруктураПолей.Вставить("УЗ_СуммаРегл"                         , "УЗ_СуммаРегл");
	СтруктураПолей.Вставить("УЗ_НДСРегл"                           , "УЗ_СуммаНДСРегл");
	
	СтруктураПолей.Вставить("УЗ_СуммаВал"                         , "Сумма");
	СтруктураПолей.Вставить("УЗ_НДСВал"                           , "СуммаНДС");
	//----m.ionov@a-prof.ru---
	
	//m.ionov@a-prof.ru 08.10.2014
	Если ДоступенСтатусДокумента() Тогда
		СтруктураПолей.Вставить("СП_КоличествоПоНакладной"	        	, "СП_КоличествоПоНакладной * Коэффициент /Номенклатура.ЕдиницаХраненияОстатков.Коэффициент");
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	//начало изменений Ожиганов проведение с 0 количество   
	//РезультатЗапросаПоТоварам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураСложныхПолей);
	РезультатЗапросаПоТоварам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей, СтруктураСложныхПолей, СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Закрыто и ПРГ_ДоступенСтатусДокумента);
	//конец изменений 
	
	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Услуги".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",             "Номенклатура");
	СтруктураПолей.Вставить("Количество",               "Количество");
	СтруктураПолей.Вставить("Сумма",                    "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС",                "СтавкаНДС");
	СтруктураПолей.Вставить("НДС",                      "СуммаНДС");
	СтруктураПолей.Вставить("СуммаНДС",                 "СуммаНДС");
	СтруктураПолей.Вставить("Содержание",               "Содержание");
	СтруктураПолей.Вставить("Услуга",                   "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор",                    "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект",                 "Номенклатура.Комплект");
	СтруктураПолей.Вставить("СтатьяЗатрат",             "СтатьяЗатрат");
	СтруктураПолей.Вставить("ХарактерЗатрат",           "СтатьяЗатрат.ХарактерЗатрат");
	СтруктураПолей.Вставить("Продукция",                "Продукция");
	СтруктураПолей.Вставить("ХарактеристикаПродукции",  "ХарактеристикаПродукции");
	СтруктураПолей.Вставить("СерияПродукции",           "СерияПродукции");
	СтруктураПолей.Вставить("Подразделение",            "Подразделение");
	СтруктураПолей.Вставить("ПодразделениеОрганизации", "ПодразделениеОрганизации");
	СтруктураПолей.Вставить("Заказ",                    "Заказ");
	СтруктураПолей.Вставить("ЗаказПоставщику",          "ЗаказПоставщику");
	СтруктураПолей.Вставить("СпособРаспределенияЗатратНаВыпуск", "СпособРаспределенияЗатратНаВыпуск");
	СтруктураПолей.Вставить("ПроектЗатрат", "Проект");
	//БП12
	СтруктураПолей.Вставить("СУчетом270НК"                         , "СУчетом270НК");
	//%%%%%%%%%%%%%%%%%%%%%%
		
	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиУслугиУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиУслугиРегл(СтруктураПолей);
	
	СтруктураОбрабатываемыхКолонок = Новый Структура();
	СтруктураЗависимыхКолонок = Новый Структура();
	ДополнитьСтруктуруПолейДаннымиНоменклатуры(СтруктураПолей, СтруктураОбрабатываемыхКолонок, СтруктураЗависимыхКолонок);
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	//m.ionov@a-prof.ru 16.02.2014
	СтруктураПолей.Вставить("УЗ_СуммаРегл"                         , "УЗ_СуммаРегл");
	СтруктураПолей.Вставить("УЗ_НДСРегл"                           , "УЗ_СуммаНДСРегл");
	
	СтруктураПолей.Вставить("УЗ_СуммаВал"                         , "Сумма");
	СтруктураПолей.Вставить("УЗ_НДСВал"                           , "СуммаНДС");
	//----m.ionov@a-prof.ru---
	
	//m.ionov@a-prof.ru 19.02.2014
	Если УЗ_НесколькоСФ Тогда
		СтруктураПолей.Вставить("ДоговорКонтрагента",             "ДоговорКонтрагента");
	
		СтруктураПолей.Вставить("Контрагент",                      "Ссылка.Контрагент");
		СтруктураПолей.Вставить("СчетФактура",                    "СчетФактура");
		
		СтруктураПолей.Вставить("СчетУчетаРасчетовСКонтрагентом", "Ссылка.СчетУчетаРасчетовСКонтрагентом");
		СтруктураПолей.Вставить("СчетУчетаРасчетовПоАвансам",     "Ссылка.СчетУчетаРасчетовПоАвансам");
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	РезультатЗапросаПоУслугам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей, СтруктураСложныхПолей);

	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Оборудование".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТовары();
	СтруктураПолей.Вставить("Цена" ,            "Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ЗаказПоставщику",  "ЗаказПоставщику");
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
    Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
	КонецЕсли;
	СтруктураПолей.Вставить("ДокументПолучения"                    , "ПриходныйОрдер");
	СтруктураПолей.Вставить("ОрганизацияДокументаПолучения"        , "ПриходныйОрдер.Организация");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"                  , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("БезПраваПродажи"                      , "ПриходныйОрдер.БезПраваПродажи");
	
	Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам И НЕ ЗначениеЗаполнено(Проект) Тогда
		СтруктураСложныхПолей=Новый Структура;
		СтруктураСложныхПолей.Вставить("Проект", "ПроектыНоменклатуры.Проект");
	Иначе
		СтруктураСложныхПолей=Неопределено;	
	КонецЕсли;
	
	//начало изменений Ожиганов 29.02.2016 49618 учет доп.соглашений в учетной системе 1С 
	СтруктураПолей.Вставить("ВидНоменклатуры", "Номенклатура.ВидНоменклатуры");	
	//конец изменений 

	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиОборудованиеРегл(СтруктураПолей, СтруктураШапкиДокумента);

	РезультатЗапросаПоОборудованию = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Оборудование", СтруктураПолей, СтруктураСложныхПолей);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ОбъектСтроительства", "ОбъектСтроительства");
	СтруктураПолей.Вставить("СпособСтроительства", "СпособСтроительства");
	СтруктураПолей.Вставить("СтатьяЗатрат"       , "СтатьяЗатрат");
	СтруктураПолей.Вставить("Сумма"              , "Сумма");
	СтруктураПолей.Вставить("СуммаНДС"           , "СуммаНДС");
	СтруктураПолей.Вставить("СтавкаНДС"			 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"				 , "СуммаНДС");
	
	ДополнитьСтруктуруПолейТабличнойЧастиОбъектыСтроительстваРегл(СтруктураПолей, СтруктураШапкиДокумента);

	РезультатЗапросаПоОбъектамСтроительства = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОбъектыСтроительства", СтруктураПолей);

	// Получим необходимые данные для проведения и проверки заполнения данные 
	// по табличной части "Возвратная тара".
	СтруктураПолей = УправлениеЗапасами.СформироватьСтруктуруПолейТара();
	СтруктураПолей.Вставить("ЗаказПокупателя"           , "Заказ");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	Если СкладИзШапки и ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		СтруктураПолей.Вставить("Склад"                                , "Ссылка.СкладОрдер");
		СтруктураПолей.Вставить("ВидСклада"								, 	 "Ссылка.СкладОрдер.ВидСклада");
    Иначе
		СтруктураПолей.Вставить("Склад"                                , "Склад");
		СтруктураПолей.Вставить("ВидСклада"								,"Склад.ВидСклада");
	КонецЕсли;
	СтруктураПолей.Вставить("ДокументПолучения"         , "ПриходныйОрдер");
	СтруктураПолей.Вставить("БезПраваПродажи"           , "ПриходныйОрдер.БезПраваПродажи");
	СтруктураПолей.Вставить("СкладЗаказаПокупателя"     , "Заказ.СкладГруппа");
	СтруктураПолей.Вставить("ОбособленныйУчетТоваровПоЗаказамПокупателей", 
	                        "Заказ.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей");
	СтруктураПолей.Вставить("ВидСкладаРазмещения"       , "Склад.ВидСклада");
	СтруктураПолей.Вставить("ПриходныйОрдерСклад"       , "ПриходныйОрдер.Склад");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "Номенклатура.ЕдиницаХраненияОстатков");
	СтруктураПолей.Вставить("ЗаказПоставщику"           , "ЗаказПоставщику");
	
	//начало изменений
	СтруктураПолей.Вставить("УЗ_СуммаРегл"           , "УЗ_СуммаРегл");
	СтруктураПолей.Вставить("УЗ_СуммаВал"            , "Сумма");
	//конец изменений

	// Дополним полями, нужными для регл. и упр. учета
	ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараУпр(СтруктураПолей);
	ДополнитьСтруктуруПолейТабличнойЧастиВозвратнаяТараРегл(СтруктураПолей, СтруктураШапкиДокумента);
	
	РезультатЗапросаПоТаре = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);

	// Подготовим таблицы тары для проведения.
	ТаблицаПоТаре         = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента);
	//m.ionov@a-prof.ru 18.12.2013
	ТаблицаПоТаре.Колонки.Добавить("Качество");
	ТаблицаПоТаре.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	//----m.ionov@a-prof.ru---
	
	//начало изменений БП 04
	
	ТаблицаПоУслугам  = РезультатЗапросаПоУслугам.Выгрузить();
	ТаблУслугНДФЛ     = Неопределено;
	Если ВыделятьНДФЛ Тогда
		ТаблУслугНДФЛВспомг  = ТаблицаПоУслугам.СкопироватьКолонки();
		Для Каждого ТекСтрока Из ТаблицаПоУслугам Цикл
			НоваяСтрока = ТаблУслугНДФЛВспомг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
			НоваяСтрока.Цена  =  Окр(ТекСтрока.Цена*0.13,0);
			НоваяСтрока.Сумма  = Окр(ТекСтрока.Сумма*0.13,0);
		КонецЦикла;	
		ТаблУслугНДФЛ = ПодготовитьТаблицуТоваров(ТаблУслугНДФЛВспомг, СтруктураШапкиДокумента);
	Конецесли;	
	
	
	//конец изменений БП 04 

	ТаблицаПоТоварам      = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	ТаблицаПоОборудованию = ПодготовитьТаблицуТоваров(РезультатЗапросаПоОборудованию, СтруктураШапкиДокумента);
	ТаблицаПоУслугам      = ПодготовитьТаблицуТоваров(ТаблицаПоУслугам, СтруктураШапкиДокумента);
	ТаблицаПоОбъектамСтроительства = ПодготовитьТаблицуОбъектовСтроительства(РезультатЗапросаПоОбъектамСтроительства, СтруктураШапкиДокумента);
	
	
	//начало изменений БП 07 
	Если ПараметрыСеанса.НеведетсяУПРУчетВЧастиЗатратИОС Тогда
		ТаблицаПоУслугам.ЗаполнитьЗначения(Перечисления.ХарактерЗатрат.НеУчитываемыеВУправленческомУчете,"ХарактерЗатрат");
	КонецЕсли;	
	//конец изменений БП 07	 
	
	//Заполним в таблице по услугам подразделение организации
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуДокументаПодразделениемОрганизации(СтруктураШапкиДокумента, ТаблицаПоУслугам);
	
	//Заполнение незаполненных СтатьиЗатрат и НоменклатурнойГруппы по Номенклатуре в Таблице услуг
	ОбщегоНазначенияКлиентСервер.ЗаполнитьНоменклатурнуюГруппуИСтатьюЗатратВТаблицеДокумента(ТаблицаПоУслугам, СтруктураОбрабатываемыхКолонок, СтруктураЗависимыхКолонок);
	
	//Счета учета номенклатуры и затрат
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Товары", 			ТаблицаПоТоварам, 		СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("ВозвратнаяТара", 	ТаблицаПоТаре, 			СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Услуги", 			ТаблицаПоУслугам, 		СтруктураШапкиДокумента);
	СчетаУчетаВДокументах.ЗаполнитьПриПроведенииСчетаУчетаТабличнойЧасти("Оборудование", 	ТаблицаПоОборудованию, 	СтруктураШапкиДокумента);
	
	ПРГ_СуммаСтроитВал 	   = -1;
	ПРГ_СуммаТоварыВал 	   = -1;
	ПРГ_СуммаОборудВал 	   = -1;
	ПРГ_СуммаВозврТараВал  = -1;
	ПРГ_СуммаУслугиВал     = -1;
	
	
	Если  СтруктураШапкиДокумента.РасчетыВУсловныхЕдиницах
		и мВалютаРегламентированногоУчета = СтруктураШапкиДокумента.ВалютаДокумента и не УЗ_ПоказыватьСуммыВРублях Тогда
		Если Число(СтруктураШапкиДокумента.КурсВзаиморасчетов) = 0 или Число(СтруктураШапкиДокумента.КратностьВзаиморасчетов) = 0 тогда
			ПРГ_КоэффициентПересчета = 1;
		Иначе
			ПРГ_КоэффициентПересчета  = СтруктураШапкиДокумента.КратностьВзаиморасчетов / СтруктураШапкиДокумента.КурсВзаиморасчетов;
		КонецЕсли;
		
		ПРГ_СуммаСтроитВал 	   = 0;
		ПРГ_СуммаТоварыВал 	   = 0;
		ПРГ_СуммаОборудВал 	   = 0;
		ПРГ_СуммаВозврТараВал  = 0;
		ПРГ_СуммаУслугиВал     = 0;
		
		
		ПРГ_СуммаТоварыРуб 	   = ТаблицаПоТоварам.Итог("Сумма")+?(Не СтруктураШапкиДокумента.СуммаВключаетНДС и СтруктураШапкиДокумента.УчитыватьНДС,ТаблицаПоТоварам.Итог("НДС"),0);
		ПРГ_СуммаОборудРуб 	   = ТаблицаПоОборудованию.Итог("Сумма") + ?(Не СтруктураШапкиДокумента.СуммаВключаетНДС  и СтруктураШапкиДокумента.УчитыватьНДС,ТаблицаПоОборудованию.Итог("НДС"),0);
		ПРГ_СуммаВозврТараРуб  = ТаблицаПоТаре.Итог("УЗ_СуммаВал");// + ТаблицаПоТаре.Итог("НДС");
		ПРГ_СуммаУслугиРуб     = ТаблицаПоУслугам.Итог("Сумма") + ?(Не СтруктураШапкиДокумента.СуммаВключаетНДС  и СтруктураШапкиДокумента.УчитыватьНДС ,ТаблицаПоУслугам.Итог("НДС"),0);
		ПРГ_СуммаСтроитРуб     = ТаблицаПоОбъектамСтроительства.Итог("Сумма") + ?(Не СтруктураШапкиДокумента.СуммаВключаетНДС  и СтруктураШапкиДокумента.УчитыватьНДС,ТаблицаПоОбъектамСтроительства.Итог("НДС"),0);
		
		ПРГ_СуммаРуб = ПРГ_СуммаТоварыРуб+ПРГ_СуммаОборудРуб+ПРГ_СуммаВозврТараРуб+ПРГ_СуммаУслугиРуб+ПРГ_СуммаСтроитРуб;
		
		Если ПРГ_СуммаРуб <> СуммаДокумента Тогда
			вызватьисключение "Не совпадают суммы в валюте !!! Обратитесь программисту!!!"
		КонецЕслИ;	
		
		ПРГ_СуммаВал 		   = Окр(ПРГ_СуммаРуб*ПРГ_КоэффициентПересчета,2);
		ПогСуммаПРГВал 		   = ПРГ_СуммаВал;
		
		ПРГ_СуммаТоварыВал 	   = Окр(ПРГ_СуммаТоварыРуб/ПРГ_СуммаРуб*ПРГ_СуммаВал,2);
		ПогСуммаПРГВал		   = ПогСуммаПРГВал - ПРГ_СуммаТоварыВал;
		
		ПРГ_СуммаОборудВал 	   = Окр(ПРГ_СуммаОборудРуб/ПРГ_СуммаРуб*ПРГ_СуммаВал,2);
		ПогСуммаПРГВал		   = ПогСуммаПРГВал - ПРГ_СуммаОборудВал;
		
		ПРГ_СуммаВозврТараВал  = Окр(ПРГ_СуммаВозврТараРуб/ПРГ_СуммаРуб*ПРГ_СуммаВал,2);
		ПогСуммаПРГВал		   = ПогСуммаПРГВал - ПРГ_СуммаВозврТараВал;
		
		ПРГ_СуммаУслугиВал     = Окр(ПРГ_СуммаУслугиРуб/ПРГ_СуммаРуб*ПРГ_СуммаВал,2);
		ПогСуммаПРГВал		   = ПогСуммаПРГВал - ПРГ_СуммаУслугиВал;
		
		ПРГ_СуммаСтроитВал	   = Окр(ПРГ_СуммаСтроитРуб/ПРГ_СуммаРуб*ПРГ_СуммаВал,2);
		ПогСуммаПРГВал		   = ПогСуммаПРГВал - ПРГ_СуммаСтроитВал;
		
		
		Если ПогСуммаПРГВал <> 0 Тогда
			Если (ПРГ_СуммаТоварыВал > 0) и (ПогСуммаПРГВал <> 0) Тогда
				ПРГ_СуммаТоварыВал = ПРГ_СуммаТоварыВал + ПогСуммаПРГВал;
				ПогСуммаПРГВал = 0;
			КонецЕсли;	
			
			Если (ПРГ_СуммаОборудВал > 0) и (ПогСуммаПРГВал <> 0) Тогда
				ПРГ_СуммаОборудВал = ПРГ_СуммаОборудВал + ПогСуммаПРГВал;
				ПогСуммаПРГВал = 0;
			КонецЕсли;	
			
			Если (ПРГ_СуммаВозврТараВал > 0) и (ПогСуммаПРГВал <> 0) Тогда
				ПРГ_СуммаВозврТараВал = ПРГ_СуммаВозврТараВал + ПогСуммаПРГВал;
				ПогСуммаПРГВал = 0;
			КонецЕсли;	
			
			Если (ПРГ_СуммаУслугиВал > 0) и (ПРГ_СуммаУслугиВал <> 0) Тогда
				ПРГ_СуммаУслугиВал 	= ПРГ_СуммаУслугиВал + ПогСуммаПРГВал;
				ПогСуммаПРГВал = 0;
			КонецЕсли;	
			
			Если (ПРГ_СуммаСтроитВал > 0) и (ПРГ_СуммаУслугиВал <> 0) Тогда
				ПРГ_СуммаСтроитВал 	= ПРГ_СуммаСтроитВал + ПогСуммаПРГВал;
				ПогСуммаПРГВал = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		
		Если  ПРГ_СуммаТоварыВал+ПРГ_СуммаОборудВал+ПРГ_СуммаВозврТараВал+ ПРГ_СуммаУслугиВал+ПРГ_СуммаСтроитВал
			<> ПРГ_СуммаВал Тогда
			вызватьисключение "Неправильно распределена сумма. Обратитесь к программисту!!!"
		КонецЕсли;
		
	КонецЕсли;	
	
	
	БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоТоварам,               СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета, УЗ_ПоказыватьСуммыВРублях,ПРГ_СуммаТоварыВал); //m.ionov@a-prof.ru 16.02.2014
	//m.ionov@a-prof.ru 16.02.2014
	//Перезапишем суммы в валюте
	Если УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаПоТоварам.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
		ТаблицаПоТоварам.ЗагрузитьКолонку(ТаблицаПоТоварам.ВыгрузитьКолонку("УЗ_СуммаВал"), "СуммаВал");	
		ТаблицаПоТоварам.ЗагрузитьКолонку(ТаблицаПоТоварам.ВыгрузитьКолонку("УЗ_НДСВал"), "НДСВал");	
		ТаблицаПоТоварам.ЗагрузитьКолонку(ТаблицаПоТоварам.ВыгрузитьКолонку("УЗ_СуммаБезНДСВал"), "СуммаБезНДСВал");	
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоОборудованию,          СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета,,ПРГ_СуммаОборудВал);
	БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета,,ПРГ_СуммаСтроитВал);
	
	БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоУслугам              , СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета, УЗ_ПоказыватьСуммыВРублях,ПРГ_СуммаУслугиВал); //m.ionov@a-prof.ru 16.02.2014
	//m.ionov@a-prof.ru 16.02.2014
	//Перезапишем суммы в валюте
	Если УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаПоУслугам.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
		ТаблицаПоУслугам.ЗагрузитьКолонку(ТаблицаПоУслугам.ВыгрузитьКолонку("УЗ_СуммаВал"), "СуммаВал");	
		ТаблицаПоУслугам.ЗагрузитьКолонку(ТаблицаПоУслугам.ВыгрузитьКолонку("УЗ_НДСВал"), "НДСВал");	
		ТаблицаПоУслугам.ЗагрузитьКолонку(ТаблицаПоУслугам.ВыгрузитьКолонку("УЗ_СуммаБезНДСВал"), "СуммаБезНДСВал");	
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаПоТаре                 , СтруктураШапкиДокумента,СтруктураШапкиДокумента.НДСВключенВСтоимость,мВалютаРегламентированногоУчета,УЗ_ПоказыватьСуммыВРублях,ПРГ_СуммаВозврТараВал);
	
	//начало изменений
	//Перезапишем суммы в валюте
	Если УЗ_ПоказыватьСуммыВРублях И НЕ ТаблицаПоУслугам.Колонки.Найти("УЗ_СуммаРегл") = Неопределено Тогда
		ТаблицаПоТаре.ЗагрузитьКолонку(ТаблицаПоТаре.ВыгрузитьКолонку("УЗ_СуммаВал"), "СуммаВал");	
		ТаблицаПоТаре.ЗагрузитьКолонку(ТаблицаПоТаре.ВыгрузитьКолонку("УЗ_СуммаРегл"), "СуммаБУ");	
	КонецЕсли;
	//конец изменений 
	
	
	БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоТоварам, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоТоварам, "Поступление");
    БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоУслугам, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоУслугам, "");
    БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоОборудованию, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоОборудованию, "Поступление");
    БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблицаПоОбъектамСтроительства, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);	
	БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблицаПоОбъектамСтроительства, "Поступление");
	
	//начало изменений БП 04 
	Если ТаблУслугНДФЛ <> Неопределено Тогда
		БухгалтерскийУчет.СформироватьКолонкиДляСодержанияПроводкиПоВходящемуДокументу(ТаблУслугНДФЛ, "вх.док.", НомерВходящегоДокумента, ДатаВходящегоДокумента);
		БухгалтерскийУчет.СформироватьСодержаниеПроводкиПоВходящемуДокументу(ТаблУслугНДФЛ , "Удержан подоходный налог");
	КонецЕсли;	
	//конец изменений БП 04 
КонецПроцедуры // СформироватьТаблицыДокумента()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре;
	Перем ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам;
	//начало изменений
	Перем ТаблУслугНДФЛ;
	Перем ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ;
	//конец изменений 
	
	//начало изменений Ожиганов проведение с 0 количество   
	ПРГ_ДоступенСтатусДокумента  = ДоступенСтатусДокумента(); 
	ПРГ_СчитатьОтКоличестваНакладной = ПРГ_ДоступенСтатусДокумента и 
	(СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Открыто
	или СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.ПереданоНаСклад
	);
	//конец изменений
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Истина, РежимПроведения);
	КонецЕсли;
	
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения,Отказ);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	//Бирюков Документы, в которых выбран заказ 2013 года не проводим
	//начало изменений Ожиганов 30.05.2015 немножко оптимизируем 
	Если ЗначениеЗаполнено(Сделка) и ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
	//конец изменений 	
		//начало изменений Ожиганов 30.05.2015 немножко оптимизируем 
		//Если Формат(Год(Сделка.Дата),"ЧГ=0") = "2013" Тогда
		Если  Год(СтруктураШапкиДокумента.ДатаСделки) = 2013 Тогда
		//конец изменений 
			Сообщить("Выбран заказ поставщику 2013 года! Документ не будет проведен!", СтатусСообщения.Внимание);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	//начало изменений
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре,ТаблУслугНДФЛ);
	//конец изменений 
	
	ПроводитьПоВзаиморасчетам = (СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
		И ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку);
	мСтруктураПараметровВзаиморасчетов.Вставить("ПроводитьПоВзаиморасчетам", ПроводитьПоВзаиморасчетам);
	
	//31_01_14 Бирюков нужно учитывать во взаиморасчетах сумму по табчасти "Тара"
	СтруктураПодготовленныхТаблиц = Новый Структура("Товары, Услуги, Оборудование, ОбъектыСтроительства, ВозвратнаяТара", 
		ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства, ТаблицаПоТаре);
	//СтруктураПодготовленныхТаблиц = Новый Структура("Товары, Услуги, Оборудование, ОбъектыСтроительства", 
	//	ТаблицаПоТоварам, ТаблицаПоУслугам, ТаблицаПоОборудованию, ТаблицаПоОбъектамСтроительства);
	
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%	
	мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблиц);
	УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                ЭтотОбъект, мСтруктураПараметровВзаиморасчетов, СтруктураШапкиДокумента, 
													Отказ, Заголовок);
	//m.ionov@a-prof.ru 17.02.2014
	Если УЗ_ПоказыватьСуммыВРублях И Не ТаблицаПоВзаиморасчетам = Неопределено Тогда
		//Blik 260615 40870 н закком загрузку колонки тк для строк с ПП нужно оставить суммы как есть
		//ТаблицаПоВзаиморасчетам.ЗагрузитьКолонку(ТаблицаПоВзаиморасчетам.ВыгрузитьКолонку("СуммаУпр") , "СуммаРегл");	
		Если ТаблицаПоВзаиморасчетам.Колонки.Найти("ДокументрасчетовСКонтрагентом") <> Неопределено Тогда
		Для Каждого стр из ТаблицаПоВзаиморасчетам Цикл
			Если не ТипЗнч(стр.ДокументрасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
                 стр.СуммаРегл = стр.СуммаУпр;
		    КонецЕсли;
		КонецЦикла;
	иначе
		 ТаблицаПоВзаиморасчетам.ЗагрузитьКолонку(ТаблицаПоВзаиморасчетам.ВыгрузитьКолонку("СуммаУпр") , "СуммаРегл");
		КонецЕсли;
		//Blik 260615 40870 к
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	//начало изменений
	Если  ТаблУслугНДФЛ <> Неопределено Тогда
		СтруктураПодготовленныхТаблицНДФЛ = Новый Структура("ТаблУслугНДФЛ",ТаблУслугНДФЛ);
		мСтруктураПараметровВзаиморасчетовНДФЛ.Вставить("СтруктураПодготовленныхТаблиц", СтруктураПодготовленныхТаблицНДФЛ);
		УправлениеВзаиморасчетами.ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ, 
	                                                ЭтотОбъект, мСтруктураПараметровВзаиморасчетовНДФЛ, СтруктураШапкиДокумента, 
													Отказ, Заголовок);
		СкорректироватьТаблицыВзаиморасчетов(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ);
	КонецЕсли;	
	//конец изменений 

	// Проверить заполнение ТЧ 
	//начало изменений убираем проверку при проведении
	Если Не Проведен или НЕ ПараметрыСеанса.ПроведениеДокументов Тогда

		ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
		ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
		ПроверитьЗаполнениеТабличнойЧастиОборудование(ТаблицаПоОборудованию, СтруктураШапкиДокумента, Отказ, Заголовок);
		ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, Отказ, Заголовок);
		ПроверитьЗаполнениеТабличнойЧастиОбъектыСтроительства(ТаблицаПоОбъектамСтроительства, СтруктураШапкиДокумента, Отказ, Заголовок);

		//Счета учета номенклатуры и затрат
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Товары", 			ТаблицаПоТоварам, 		СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("ВозвратнаяТара", 	ТаблицаПоТаре, 			СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Услуги", 			ТаблицаПоУслугам, 		СтруктураШапкиДокумента, Отказ, Заголовок);
		СчетаУчетаВДокументах.ПроверитьСчетаУчетаТабличнойЧасти("Оборудование", 		ТаблицаПоОборудованию, 	СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	//конец изменений
	//Проверим на возможность проведения в БУ и НУ
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете или СтруктураШапкиДокумента.ОтражатьВНалоговомУчете тогда
		УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(СтруктураШапкиДокумента.ДоговорКонтрагента, СтруктураШапкиДокумента.ВалютаДокумента, //m.ionov@a-prof.ru 21.02.2014
		СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете,СтруктураШапкиДокумента.ОтражатьВНалоговомУчете,
		мВалютаРегламентированногоУчета, Ложь,Отказ, Заголовок);
	КонецЕсли;
	
	//начало изменений Ожиганов проведение с 0 количество 
	//в случае если в статусе не Закрыт формируем движения по товарам полученным
	Если Не Отказ и ПРГ_СчитатьОтКоличестваНакладной Тогда
		ПРГ_ФормированиеДвиженийТоварыПолученные(ТаблицаПоТоварам,СтруктураШапкиДокумента,Заголовок,РежимПроведения,Отказ);
		возврат;
	КонецЕсли;	
	//конец изменений 
	
	ПодготовитьПараметрыУчетнойПолитики(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	// <- Шевченков №33032
	//начало изменений Ожиганов 29.02.2016 убереем проверку если идет перепроведение документов 
	//Если ЭтотОбъект.ОтражатьВБухгалтерскомУчете И Константы.ПРГ_ПроверятьУсловияПоДоговорам.Получить() Тогда
	Если ЭтотОбъект.ОтражатьВБухгалтерскомУчете И Константы.ПРГ_ПроверятьУсловияПоДоговорам.Получить() и Не ПараметрыСеанса.ПроведениеДокументов Тогда
	//конец изменений 	
		Отказ = НЕ ПРГ_Обработки.РазрешеноПроводитьВзаиморасчетыПоДоговору(ЭтотОбъект.Ссылка);
	КонецЕсли;	
	// ->
	//начало изменений Ожиганов 29.02.2016 49618 учет доп.соглашений в учетной системе 1С 
	ПРГ_ПроверкаВозможностиПроведенияПоДоговору(СтруктураШапкиДокумента,ТаблицаПоТоварам,ТаблицаПоОборудованию,ТаблицаПоОбъектамСтроительства,ТаблицаПоТаре,Отказ);
	Если Отказ Тогда
		возврат;
	КонецЕсли;	
	//конец изменений 
	
	// Движения по документу
	//m.ionov@a-prof.ru 31.10.2014
	//начало изменений Ожиганов 37889  
	//Если ДоступенСтатусДокумента() И СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Отменено Тогда
	Если ПРГ_ДоступенСтатусДокумента И СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Отменено Тогда
		
	//Если Не Отказ Тогда
	ИначеЕсли Не Отказ Тогда
	//конец изменений 
	//----m.ionov@a-prof.ru---
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
							ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоОборудованию,
							ТаблицаПоОбъектамСтроительства, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,
							//начало изменений
							ТаблУслугНДФЛ,ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ,
							//конец изменений 
							Отказ, Заголовок);
	КонецЕсли;

	/// Кунов О.В., 28.05.2014
	Если ПРГ_СвежееСырье Тогда
		ДвиженияПоСвежемуСырью(ТаблицаПоТоварам);
	КонецЕсли;
	///
	
	/// Кунов О.В., 16.10.2014 - 
	Если ДоговорКонтрагента.ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() И ДоговорКонтрагента.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
		
	ИначеЕсли (ОтражатьВБухгалтерскомУчете Или ОтражатьВУправленческомУчете) И ЗначениеЗаполнено(Сделка) И
			Не ПараметрыСеанса.ПроведениеДокументов И мТабличнаяЧастьМодифицирована И Не Отказ Тогда
				
		КонтрольИУведомлениеПоРасхождениямЦен();
		
	КонецЕсли;
	///
	
	//m.ionov@a-prof.ru 08.10.2014
	Если Не Отказ 
		 И Не СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Закрыто
		 И Не СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Отменено
		 И ДоступенСтатусДокумента() И ЗначениеЗаполнено(СП_СтатусДокумента) Тогда
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаТовары", ТаблицаПоТоварам);
				
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыКПолучениюНаСклады, СтруктТаблицДокумента);
				
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад",          СкладОрдер);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументПолучения",          Ссылка);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументРезерва",          Документы.ЗаказПокупателя.ПустаяСсылка());
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "СтатусПартии",          Перечисления.СтатусыПартийТоваров.Купленный);
								
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыКПолучениюНаСклады, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	//Сделаем переменные доступными из подписок на события
	ДополнительныеСвойства.Вставить("СтруктураШапкиДокумента", СтруктураШапкиДокумента);
	ДополнительныеСвойства.Вставить("СтруктураТабличныхЧастей", Новый Структура("ТаблицаПоТоварам, ТаблицаПоОборудованию, ТаблицаПоТаре, ТаблицаПоОбъектамСтроительства, ТаблицаПоОборудованию", ТаблицаПоТоварам, ТаблицаПоОборудованию, ТаблицаПоТаре, ТаблицаПоОбъектамСтроительства, ТаблицаПоОборудованию));
	
	//m.ionov@a-prof.ru 25.02.2015
	Если ЗначениеЗаполнено(ПКК_АктНачисленияБонусов) Тогда
		ЕстьДокументыПоБонусномуАкту(Отказ);
	КонецЕсли;
	//----m.ionov@a-prof.ru---
	
	//{26.01.2016 Островерхий заявка №46457 
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		ПолныеПрава.ЗаписатьНаборЗаписейНаСервере("СвободныеОстатки", Ссылка,, "РегистрНакопления");
	КонецЕсли; 
	//26.01.2016 Островерхий} 
	
КонецПроцедуры // ОбработкаПроведения()

/// Кунов О.В., 28.05.2014
Процедура ДвиженияПоСвежемуСырью(ТаблицаПоТоварам)
	
	ТаблицаДвижений = Движения.ПРГ_СвежееСырье.ВыгрузитьКолонки();
	
	Для Каждого СтрокаТовара Из ТаблицаПоТоварам Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Новый Структура("Номенклатура, СерияНоменклатуры, КоличествоБрутто, КоличествоНетто, КоличествоКЗачету",
			СтрокаТовара.Номенклатура, СтрокаТовара.СерияНоменклатуры, СтрокаТовара.КоличествоБрутто, СтрокаТовара.КоличествоНетто, СтрокаТовара.Количество)
		);
	КонецЦикла;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Дата, 				"Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Контрагент,			"Контрагент");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента,	"ДоговорКонтрагента");
	
	Движения.ПРГ_СвежееСырье.мТаблицаДвижений = ТаблицаДвижений;
	Движения.ПРГ_СвежееСырье.ВыполнитьДвижения();
	
КонецПроцедуры
///

/// Кунов О.В., 16.10.2014 - 
Функция ТабличнаяЧастьМодифицирована()
	
	Результат = Ложь;
	
	мТабличнаяЧасть = Ссылка.Товары.Выгрузить(, "Номенклатура, Количество, Цена, Сумма");
	мТабличнаяЧасть.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	
	мТабличнаяЧастьСейчас = Товары.Выгрузить(, "Номенклатура, Количество, Цена, Сумма");
	мТабличнаяЧастьСейчас.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	
	Для Каждого СтрокаТабличнойЧастиСейчас Из мТабличнаяЧастьСейчас Цикл
		
		СтрокиТабличнойЧасти = мТабличнаяЧасть.НайтиСтроки(Новый Структура("Номенклатура, Цена", СтрокаТабличнойЧастиСейчас.Номенклатура, СтрокаТабличнойЧастиСейчас.Цена));
		
		Если СтрокиТабличнойЧасти.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = СтрокиТабличнойЧасти[0];
			Если СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧастиСейчас.Количество И СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧастиСейчас.Сумма Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Результат = Истина;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Процедура КонтрольИУведомлениеПоРасхождениямЦен()
	
	//{19.07.2016 Островерхий заявка №54306 
	СтрокаПодкл = СокрЛП(Константы.ПРГ_СтрокаПодключения.Получить());
			
	Если НЕ Нрег(СтрокаПодкл) = Нрег(СтрокаСоединенияИнформационнойБазы()) Тогда
		Возврат;	
	КонецЕсли; 
	//19.07.2016 Островерхий}  		
	
	ТоварыВЗаказе = Сделка.Товары.Выгрузить(, "Номенклатура, СтавкаНДС, Цена");
	ТоварыВЗаказе.Свернуть("Номенклатура, СтавкаНДС, Цена");
	
	Для Каждого СтрокаТовара Из ТоварыВЗаказе Цикл
		СтрокаТовара.Цена = Окр(СтрокаТовара.Цена, 2);
	КонецЦикла;
	
	ТоварыВЗаказе.Колонки.Добавить("ЦенаВПоступлении");
	ТоварыВЗаказе.Колонки.Добавить("СтавкаНДСВПоступлении");
	ТоварыВЗаказе.Колонки.Добавить("Разница");
	
	ТоварыВЗаказе.ЗаполнитьЗначения(0, "ЦенаВПоступлении, Разница");
	
	ТоварыВПоступлении = Товары.Выгрузить(, "Номенклатура, СтавкаНДС, Цена");
	ТоварыВПоступлении.Свернуть("Номенклатура, СтавкаНДС, Цена");
	
	Для Каждого СтрокаПоступления Из ТоварыВПоступлении Цикл
		
		//СтрокиТовараВЗаказе = ТоварыВЗаказе.НайтиСтроки(
		//	Новый Структура("Номенклатура, Цена", СтрокаПоступления.Номенклатура, СтрокаПоступления.Цена)
		//);
		
		//Если Не СуммаВключаетНДС И Сделка.СуммаВключаетНДС Тогда
		//	СтавкаНДСВПоступлении = УчетНДС.ПолучитьСтавкуНДС(СтрокаПоступления.СтавкаНДС); // в процентах
		//	ЦенаВПоступлении =  Окр(СтрокаПоступления.Цена * (100 + СтавкаНДСВПоступлении) / 100, 2);
		//Иначе
			ЦенаВПоступлении = СтрокаПоступления.Цена;
		//КонецЕсли;
		
		СтрокиТовараВЗаказе = Новый Массив;
		Для Каждого СтрокаТовара Из ТоварыВЗаказе Цикл
			Если СтрокаТовара.Номенклатура = СтрокаПоступления.Номенклатура И СтрокаТовара.Цена = ЦенаВПоступлении Тогда
				СтрокиТовараВЗаказе.Добавить(СтрокаТовара);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокиТовараВЗаказе.Количество() = 0 Тогда
			СтрокиТовараВЗаказе = ТоварыВЗаказе.НайтиСтроки(
				Новый Структура("Номенклатура", СтрокаПоступления.Номенклатура)
			);
		КонецЕсли; 
		
		Если СтрокиТовараВЗаказе.Количество() > 0 Тогда
			СтрокаЗаказа = СтрокиТовараВЗаказе[0];
			СтрокаЗаказа.ЦенаВПоступлении = ЦенаВПоступлении;
			СтрокаЗаказа.СтавкаНДСВПоступлении = СтрокаПоступления.СтавкаНДС;
			СтрокаЗаказа.Разница = ЦенаВПоступлении - СтрокаЗаказа.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТоварыВЗаказе Цикл
		Если СтрокаЗаказа.ЦенаВПоступлении = 0 Или СтрокаЗаказа.Цена = СтрокаЗаказа.ЦенаВПоступлении Тогда
			СтрокиКУдалению.Добавить(СтрокаЗаказа);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		ТоварыВЗаказе.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	Если ТоварыВЗаказе.Количество() > 0 Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Обнаружены расхождения цен в документе поступления и заказе поставщику!");
		ОбщегоНазначения.СообщитьОбОшибке(ДокументВСтроку(Ссылка));
		ОбщегоНазначения.СообщитьОбОшибке(ДокументВСтроку(Сделка));
		
		Для Каждого СтрокаЗаказа Из ТоварыВЗаказе Цикл
			
			СтрокаСообщения = "Номенклатура %Номенклатура% (код %Код%): цена в заказе %ЦенаВЗаказе%, цена в поступлении %ЦенаВПоступлении%, расхождение: %Разница%";
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%Номенклатура%", СтрокаЗаказа.Номенклатура.Наименование);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%Код%", СокрЛП(СтрокаЗаказа.Номенклатура.Код));
			
			ПараметрЦенаВЗаказе = Формат(СтрокаЗаказа.Цена, "ЧДЦ=2; ЧН=");
			ПараметрЦенаВЗаказе = ПараметрЦенаВЗаказе + " " + ? (
				Сделка.СуммаВключаетНДС,
				"(НДС включен, " + СтрокаЗаказа.СтавкаНДС + ")",
				"(НДС не включен, " + СтрокаЗаказа.СтавкаНДС + ")"
			);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%ЦенаВЗаказе%", ПараметрЦенаВЗаказе);
			
			ПараметрЦенаВПоступлении = Формат(СтрокаЗаказа.ЦенаВПоступлении, "ЧДЦ=2; ЧН=");
			ПараметрЦенаВПоступлении = ПараметрЦенаВПоступлении + " " + ? (
				СуммаВключаетНДС,
				"(НДС включен, " + СтрокаЗаказа.СтавкаНДСВПоступлении + ")",
				"(НДС не включен, " + СтрокаЗаказа.СтавкаНДСВПоступлении + ")"
			);
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%ЦенаВПоступлении%", ПараметрЦенаВПоступлении);
			
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%Разница%", Формат(СтрокаЗаказа.Разница, "ЧДЦ=2; ЧН="));
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
			
		КонецЦикла;
		
		УведомитьОРасхожденияхЦенПоПочте(ТоварыВЗаказе);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура УведомитьОРасхожденияхЦенПоПочте(ТаблицаТоваров)
	
	ШапкаХТМЛ =
	"<!DOCTYPE html>
	|<html>
	|<head>
	|<style type='text/css'>
	|body { font-size: 16; }
	|caption { text-align: left; font-weight: bold; }
	|th { font-weight: normal; text-align: center; background-color: lightgray; border: 1px solid black; border-bottom-width: 0px; }
	|td { padding: 2px; }
	|table { border-collapse: collapse; }
	|table, td { border: 1px solid black; }
	|.red { color: red; }
	|.ar { text-align: right; }
	|.grayinfo { font-size: 13; color: gray; }
	|</style>
	|</head>
	|<body>
	|";

	ШапкаПисьма =
	"<p>%ИмяОтчество%!</p>
	|<p>Обнаружены расхождения цен в заказе поставщику и документе поступления.</p>
	|";
	
	ДанныеОДокументах =
	"<p><span style=""font-weight: bold;"">Информация о документах</span>
	|<table>
	|<colgroup>
	|<col width='200' bgcolor='lightgray'/>
	|</colgroup>
	|<tr><td>Документ поступления</td><td>%ДокументПоступления%</td></tr>
	|<tr><td>Заказ поставщику</td><td>%ДокументЗаказ%</td></tr>
	|<tr><td>Поставщик</td><td>%Контрагент%</td></tr>
	|<tr><td>Договор</td><td>%Договор%</td></tr>
	|<tr><td>Спецификация</td><td>%Спецификация%</td></tr>
	|</table></p>
	|";
	
	ДанныеОДокументах = СтрЗаменить(ДанныеОДокументах, "%ДокументПоступления%", ДокументВСтроку(Ссылка));
	ДанныеОДокументах = СтрЗаменить(ДанныеОДокументах, "%ДокументЗаказ%", ДокументВСтроку(Сделка));
	ДанныеОДокументах = СтрЗаменить(ДанныеОДокументах, "%Контрагент%", Контрагент.Наименование);
	ДанныеОДокументах = СтрЗаменить(ДанныеОДокументах, "%Договор%", ДоговорКонтрагента.Наименование);
	ДанныеОДокументах = СтрЗаменить(ДанныеОДокументах, "%Спецификация%", ? (ЗначениеЗаполнено(Сделка.УЗ_Спецификация), ДокументВСтроку(Сделка.УЗ_Спецификация), ""));
		
	СписокРасхождений =
	"<p><span style=""font-weight: bold;"">Список расхождений</span>
	|<table>
	|<colgroup>
	|<col width=""400"" align=""right"" />
	|<col width='150'/>
	|<col width='150'/>
	|<col width='150'/>
	|</colgroup>
	|<tr bgcolor='lightgray'><td>Номенклатура</td><td>Код</td><td>Цена в заказе</td><td>НДС</td><td>Цена в поступлении</td><td>НДС</td><td>Величина расхождения</td></tr>";
	
	Для Каждого СтрокаТаблицыТоваров Из ТаблицаТоваров Цикл
		СтрокаРасхождения = "
		|<tr><td>%Номенклатура%</td><td>%Код%</td><td>%ЦенаВЗаказе%</td><td>%НДСВЗаказе%</td><td>%ЦенаВПоступлении%</td><td>%НДСВПоступлении%</td><td class=""red"">%Разница%</td></tr>";
		
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%Номенклатура%", СтрокаТаблицыТоваров.Номенклатура.Наименование);
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%Код%", СокрЛП(СтрокаТаблицыТоваров.Номенклатура.Код));
		
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%ЦенаВЗаказе%", Формат(СтрокаТаблицыТоваров.Цена, "ЧДЦ=2; ЧН="));
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%ЦенаВПоступлении%", Формат(СтрокаТаблицыТоваров.ЦенаВПоступлении, "ЧДЦ=2; ЧН="));
		
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%НДСВЗаказе%",
			? (Сделка.СуммаВключаетНДС, "Включен, ", "Не включен, ") + СтрокаТаблицыТоваров.СтавкаНДС
		);
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%НДСВПоступлении%",
			? (СуммаВключаетНДС, "Включен, ", "Не включен, ") + СтрокаТаблицыТоваров.СтавкаНДСВПоступлении
		);
		
		СтрокаРасхождения = СтрЗаменить(СтрокаРасхождения, "%Разница%", Формат(СтрокаТаблицыТоваров.Разница, "ЧДЦ=2; ЧН="));
		
		СписокРасхождений = СписокРасхождений + СтрокаРасхождения;
	КонецЦикла;
	
	СписокРасхождений = СписокРасхождений + 
	"</table></p>";
	
	ПодвалПисьма =
	"<p>
	|<span class='grayinfo'>Уведомление сгенерировано автоматически, отвечать на это письмо не нужно.</span>
	|</p>
	|</html>
	|";
	
	ТекстПисьма = ШапкаХТМЛ + ШапкаПисьма + ДанныеОДокументах + СписокРасхождений + ПодвалПисьма;
	
	СписокФизлиц = Справочники.ПРГ_Служебный.ПолучитьОбъектыИзГруппы(Справочники.ПРГ_Служебный.ПолучателиСообщенийОРасхожденииЦен);
	
	АвторЗаказа = Сделка.Ответственный.ФизЛицо;
	Если ЗначениеЗаполнено(АвторЗаказа) И СписокФизлиц.Найти(АвторЗаказа) = Неопределено Тогда
		СписокФизлиц.Добавить(АвторЗаказа);
	КонецЕсли;
	
	Для Каждого Физлицо Из СписокФизлиц Цикл
		Если Не ЗначениеЗаполнено(Физлицо) Тогда
			Продолжить;
		КонецЕсли;
		АдресПолучателя = УправлениеЭлектроннойПочтой.ОпределитьАдресПолучателя(Физлицо);
		Если Не ЗначениеЗаполнено(АдресПолучателя) Тогда
			Продолжить;
		КонецЕсли;
		ФИО = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Физлицо, Дата);
		ТекстПисьмаСОбращением = СтрЗаменить(ТекстПисьма, "%ИмяОтчество%", ФИО.Имя + " " + ФИО.Отчество);
		ПРГ_Регламентый.ОправитьФайл("Расхождения цен", АдресПолучателя, ТекстПисьмаСОбращением, , , , Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументВСтроку(Документ)
	
	НомерДокумента = Документ.Номер;
	Пока Лев(НомерДокумента, 1) = "0" Цикл
		НомерДокумента = Сред(НомерДокумента, 2);
	КонецЦикла;
	
	Результат = Документ.Метаданные().Синоним + " №" + Строка(НомерДокумента) + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
	
	Возврат Результат;
	
КонецФункции
///

// Процедура вызывается из тела процедуры ДвиженияПоРегистрамРегл
// Формирует движения по постоянным и временным разницам по табличной части Услуги
Процедура ДвиженияПоРазницамПоУслугам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ПроводкиНУ)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВНалоговомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Если Не УчетнаяПолитикаРегл.ПоддержкаПБУ18 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДока   = Дата;
	
	// Подготовим структуру таблицы для отражения затрат.
	ТаблицаЗатрат = УправлениеЗатратами.СформироватьТаблицуЗатрат();
	
	Для Каждого СтрокаТЧ из ТаблицаПоУслугам Цикл
		
		//СуммаВПроводку = СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС;
		СуммаВПроводку = СтрокаТЧ.ПроводкаСумма;
		
		Если Лев(СтрокаТЧ.СчетЗатратНУ.Код, 2) = "97" Тогда
			СтатьяЗатрат1 = СтрокаТЧ.СубконтоНУ1.СтатьяЗатрат;
			СтатьяЗатрат2 = Неопределено;
			СтатьяЗатрат3 = Неопределено;
		Иначе
			СтатьяЗатрат1 = СтрокаТЧ.СубконтоНУ1;
			СтатьяЗатрат2 = СтрокаТЧ.СубконтоНУ2;
			СтатьяЗатрат3 = СтрокаТЧ.СубконтоНУ3;
		КонецЕсли;
			
		Если ТипЗнч(СтатьяЗатрат1)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат1.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат1.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат2)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат2.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат2.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат3)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗатрат = СтатьяЗатрат3.ВидРасходовНУ;
			ВидУчета = ?(СтатьяЗатрат3.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения, Перечисления.ВидыУчетаПоПБУ18.ПР, Перечисления.ВидыУчетаПоПБУ18.ВР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат1)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат1.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат1.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат2)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат2.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат2.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		ИначеЕсли ТипЗнч(СтатьяЗатрат3)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗатрат = СтатьяЗатрат3.ВидПрочихДоходовИРасходов;
			ВидУчета = ?(СтатьяЗатрат3.ПринятиеКналоговомуУчету, Перечисления.ВидыУчетаПоПБУ18.ВР, Перечисления.ВидыУчетаПоПБУ18.ПР);
		Иначе
			ВидЗатрат = "";
			ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР;
		КонецЕсли;
		
		Если ВидЗатрат = "" Тогда
			СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ",СтрокаТЧ.СчетЗатрат), Ложь, Дата);
			Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
				Продолжить;
			КонецЕсли;
			Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ, ВидЗатратНУ",СтрокаТЧ.СчетЗатрат, ВидЗатрат), Ложь, Дата);
			Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
				Продолжить;
			КонецЕсли;
			Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СчетНУСоответствующийСчетуБУ)	Тогда
				СчетНУСоответствующийСчетуБУ = БухгалтерскийУчет.ПреобразоватьСчетаБУвСчетНУ(Новый Структура("СчетБУ",СтрокаТЧ.СчетЗатрат), Ложь, Дата);
				Если СчетНУСоответствующийСчетуБУ = СтрокаТЧ.СчетЗатратНУ	Тогда
					Продолжить;
				КонецЕсли;
				Если СчетНУСоответствующийСчетуБУ.Родитель = СтрокаТЧ.СчетЗатратНУ.Родитель Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если соответствующий счет не найден, то разницы не рассчитаны
		Если НЕ ЗначениеЗаполнено(СчетНУСоответствующийСчетуБУ)	Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = ПроводкиНУ.Добавить();
			
		Проводка.Период      = ДатаДока;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = СтрокаТЧ.Содержание;
			
		Проводка.СчетДт      = СчетНУСоответствующийСчетуБУ;
			
		ПроизводственныеРасходыНУ = УправлениеЗатратами.ПроверитьСчетЗатратНаПроизводственныеРасходы(СчетНУСоответствующийСчетуБУ, "Налоговый");
			
		Если ПроизводственныеРасходыНУ Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",        СтрокаТЧ.ПодразделениеОрганизации);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",         СтрокаТЧ.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства", СтрокаТЧ.ОбъектСтроительства);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СпособыСтроительства", СтрокаТЧ.СпособСтроительства);
		Иначе
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтрокаТЧ.Субконто3);
		КонецЕсли;
						
		Проводка.Сумма = СуммаВПроводку;
		Проводка.ВидУчетаДт = ВидУчета;
		
		// Добавим строку в таблицу затрат.
		Если ПроизводственныеРасходыНУ Тогда
			НоваяСтрока = ТаблицаЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.СуммаБезНДС = 0;
			НоваяСтрока.СуммаРегл = 0;
			НоваяСтрока.СчетЗатратНУ = СчетНУСоответствующийСчетуБУ;
			
			Если ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР Тогда
				НоваяСтрока.ВременнаяРазница = СуммаВПроводку;
			ИначеЕсли ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР Тогда
				НоваяСтрока.ПостояннаяРазница = СуммаВПроводку;
			КонецЕсли;
		КонецЕсли;
			
		Проводка = ПроводкиНУ.Добавить();
			
		Проводка.Период      = ДатаДока;
		Проводка.Организация = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание  = СтрокаТЧ.Содержание;
		
		ПроизводственныеРасходыНУ = УправлениеЗатратами.ПроверитьСчетЗатратНаПроизводственныеРасходы(СтрокаТЧ.СчетЗатратНУ, "Налоговый");
		
		Проводка.СчетДт = СтрокаТЧ.СчетЗатратНУ;
		Если ПроизводственныеРасходыНУ Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",        СтрокаТЧ.ПодразделениеОрганизации);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтрокаТЧ.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",         СтрокаТЧ.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства", СтрокаТЧ.ОбъектСтроительства);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СпособыСтроительства", СтрокаТЧ.СпособСтроительства);
		Иначе
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1, СтрокаТЧ.СубконтоНУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2, СтрокаТЧ.СубконтоНУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3, СтрокаТЧ.СубконтоНУ3);
			Проводка.Сумма = - СуммаВПроводку;
		КонецЕсли;
		Проводка.Сумма = - СуммаВПроводку;
		Проводка.ВидУчетаДт = ВидУчета;
		
		// Добавим строку в таблицу затрат.
		Если ПроизводственныеРасходыНУ Тогда
			НоваяСтрока = ТаблицаЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.СуммаБезНДС = 0;
			НоваяСтрока.СуммаРегл = 0;
			
			Если ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ВР Тогда
				НоваяСтрока.ВременнаяРазница = - СуммаВПроводку;
			ИначеЕсли ВидУчета = Перечисления.ВидыУчетаПоПБУ18.ПР Тогда
				НоваяСтрока.ПостояннаяРазница = - СуммаВПроводку;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаЗатрат.Количество() > 0 Тогда
		
		ВремСтруктураШапкиДокумента = Новый Структура;
		ВремСтруктураШапкиДокумента.Вставить("Ссылка", СтруктураШапкиДокумента.Ссылка);
		ВремСтруктураШапкиДокумента.Вставить("Дата", СтруктураШапкиДокумента.Дата);
		ВремСтруктураШапкиДокумента.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ВремСтруктураШапкиДокумента.Вставить("ОтражатьВБухгалтерскомУчете", Ложь);
		ВремСтруктураШапкиДокумента.Вставить("ОтражатьВНалоговомУчете", Истина);
		
		УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
			ВремСтруктураШапкиДокумента, 
			ТаблицаЗатрат
		);
		
	КонецЕсли;
		
КонецПроцедуры // ДвиженияПоРазницамПоУслугам()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОтражатьВУправленческомУчете И НЕ ОтражатьВБухгалтерскомУчете Тогда
		СтрокаСообщения = Нстр("ru = 'Документ должен принадлежать хотя бы одному из видов учета: ""Управленческий"" и (или)  ""Бухгалтерский"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства Тогда
		//Не проверяем ВидПоступления
		НомерУдаляемогоЭлемента = ПроверяемыеРеквизиты.Найти("ВидПоступления");
		Если НомерУдаляемогоЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоЭлемента);
		КонецЕсли;
	КонецЕсли;

	Если ВидПоступления <> Перечисления.ВидыПоступленияТоваров.НаСклад
	 ИЛИ мУказаниеСкладовВТЧ
	 ИЛИ (Товары.Количество() + ВозвратнаяТара.Количество() + Оборудование.Количество()) = 0 Тогда
		//Не требуется указание склада в шапке
		НомерУдаляемогоЭлемента = ПроверяемыеРеквизиты.Найти("СкладОрдер");
		Если НомерУдаляемогоЭлемента <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	Если УчитыватьНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.СтавкаНДС");
		ПроверяемыеРеквизиты.Добавить("Услуги.СтавкаНДС");
	КонецЕсли;
	
	//начало изменений проведение
	Если Не ДоступенСтатусДокумента() Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.Количество");
	КонецЕсли;	
	//конец изменений

	// Единица измерения мест должна быть заполнена, если указано количество мест
	ОбработкаТабличныхЧастейСервер.ПроверитьЗаполненаЕдиницаИзмеренияМест(Товары, ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, "Покупка", ОбъектКопирования.Ссылка);
	//m_ionov@mail.ru 01.09.2016
	УЗ_ОбменПролайт = Ложь;
	УЗ_УИДТТН = 0;
	//------- m_ionov@mail.ru -------
КонецПроцедуры
///вадим
Процедура СоздатьДвиженияПоЛизенгу(ПроводкиБУ)
	Если не ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеОСПоЛизингу Тогда
  		возврат;
 	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугОСПоЛизингу.ОС КАК ОС,
		|	ПоступлениеТоваровУслугОСПоЛизингу.МОЛ,
		|	ПоступлениеТоваровУслугОСПоЛизингу.ПодразделениеОрганизации,
		|	ПоступлениеТоваровУслугОСПоЛизингу.Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ОСПоЛизингу КАК ПоступлениеТоваровУслугОСПоЛизингу
		|ГДЕ
		|	ПоступлениеТоваровУслугОСПоЛизингу.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОС";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	МестонахождениеОСОрганизаций = Движения.МестонахождениеОСБухгалтерскийУчет;
	ПрГ_ОСПоЛизингу		 = Движения.ПРГ_ОСВЛизенге;
	//начало изменений БП 10 
	СостоянияОСЛизинг    = Движения.СостоянияОСЛизинг;
	//конец изменений БП 10 
	//ПринятоКУчету 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		///проводки
		Проводка   = ПроводкиБУ.Добавить();
		
		Проводка.Период                  = Дата;
		Проводка.Организация             = Организация;
		Проводка.Содержание              = "ОС по лизингу";
		Проводка.сумма              = ВыборкаДетальныеЗаписи.сумма;
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.АрендованныеОсновныеСредства;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты"	,Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства"		,ВыборкаДетальныеЗаписи.ОС);
		//////МестонахождениеОСБухгалтерскийУчет		
		Движение = МестонахождениеОСОрганизаций.Добавить();
	    
		Движение.Период           = Дата;
		Движение.ОсновноеСредство = ВыборкаДетальныеЗаписи.ОС;
		Движение.Организация      = Организация;
		Движение.МОЛ              = ВыборкаДетальныеЗаписи.МОЛ;
		Движение.Местонахождение  = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
		
		/////Лизинг
		
		Движение = ПрГ_ОСПоЛизингу.Добавить();
	    Движение.Период           = Дата;
		Движение.ОС = ВыборкаДетальныеЗаписи.ОС;
		//начало изменений БП 10
		Движение.Организация		    = Организация;
		//конец изменений БП 10
		Движение.Стоимость              = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Контрагент  			= Контрагент;
		Движение.Договор  				= ДоговорКонтрагента;
		
	    //начало изменений БП 10 
		Движение =   СостоянияОСЛизинг.Добавить();
		Движение.Период			 = Дата;
		Движение.ОсновноеСредство= ВыборкаДетальныеЗаписи.ОС;
		Движение.Организация 	 = Организация;
		Движение.Состояние	 	 = Перечисления.СостоянияОС.ПринятоКУчету;
		Движение.ДатаСостояния   = Дата;
	    //конец изменений БП 10 
	КонецЦикла;

КонецПроцедуры

//начало изменений 
Процедура СкорректироватьТаблицыВзаиморасчетов(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам,ТаблицаПоВзаиморасчетамНДФЛ, ТаблицаПоРасчетамНДФЛ);
	
	Для Каждого ТекСтрока ИЗ ТаблицаПоВзаиморасчетамНДФЛ Цикл
		НоваяСтрока = ТаблицаПоВзаиморасчетам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		НоваяСтрока.СуммаВзаиморасчетов	    = -1*ТекСтрока.СуммаВзаиморасчетов;
		НоваяСтрока.СуммаРегл		    	= -1*ТекСтрока.СуммаРегл;
		НоваяСтрока.СуммаУпр                = -1*ТекСтрока.СуммаУпр;
		
	КонецЦикла;	
	
	
	
	Для Каждого ТекСтрока ИЗ ТаблицаПоРасчетамНДФЛ Цикл
	
		НоваяСтрока = ТаблицаПоРасчетам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		НоваяСтрока.СуммаВзаиморасчетов	    = -1*ТекСтрока.СуммаВзаиморасчетов;
		НоваяСтрока.СуммаРегл		    	= -1*ТекСтрока.СуммаРегл;
		НоваяСтрока.СуммаУпр                = -1*ТекСтрока.СуммаУпр;
		
	КонецЦикла;	
	
	СписокСуммКолонки = Нрег(",СуммаРегл,СуммаВзаиморасчетов,СуммаУпр,");
	СписокГруппКолонок  = "";
	
	Для каждого ТекКолокна Из ТаблицаПоВзаиморасчетам.Колонки Цикл
		Если Найти(СписокСуммКолонки,","+Нрег(ТекКолокна.Имя)+",") >0 Тогда
		Иначе	
			СписокГруппКолонок = СписокГруппКолонок+?(ПустаяСтрока(СписокГруппКолонок),"",",")+ТекКолокна.Имя;
		КонецЕслИ;	
	
	КонецЦикла;
	
	ТаблицаПоВзаиморасчетам.Свернуть(СписокГруппКолонок,"СуммаВзаиморасчетов,СуммаРегл,СуммаУпр");
	СписокГруппКолонок  = "";

	//ТаблицаПоРасчетам.Свернуть("Сделка","СуммаВзаиморасчетов,СуммаРегл,СуммаУпр");
		Для каждого ТекКолокна Из ТаблицаПоРасчетам.Колонки Цикл
		Если Найти(СписокСуммКолонки,","+Нрег(ТекКолокна.Имя)+",") >0 Тогда
		Иначе	
			СписокГруппКолонок = СписокГруппКолонок+?(ПустаяСтрока(СписокГруппКолонок),"",",")+ТекКолокна.Имя;
		КонецЕслИ;	
	
	КонецЦикла;

	ТаблицаПоРасчетам.Свернуть(СписокГруппКолонок,"СуммаВзаиморасчетов,СуммаРегл,СуммаУпр");
	
	
КонецПроцедуры	
//конец изменений

//m.ionov@a-prof.ru 16.02.2014
Процедура ПересчитатьСуммуРуб(СтрокаТабличнойЧасти) Экспорт
	Если Не УЗ_ПоказыватьСуммыВРублях Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Индекс(СтрокаТабличнойЧасти) >= 0 
		ИЛИ Услуги.Индекс(СтрокаТабличнойЧасти) >= 0  Тогда
		КоэффициентПересчета = ?(КратностьВзаиморасчетов = 0,1,КурсВзаиморасчетов/КратностьВзаиморасчетов);			
		
		СтрокаТабличнойЧасти.УЗ_СуммаРегл = СтрокаТабличнойЧасти.Сумма*КоэффициентПересчета;
		СтрокаТабличнойЧасти.УЗ_СуммаНДСРегл = СтрокаТабличнойЧасти.СуммаНДС*КоэффициентПересчета;
	//начало изменений
	ИначеЕсли ВозвратнаяТара.Индекс(СтрокаТабличнойЧасти) >= 0 Тогда
		КоэффициентПересчета = ?(КратностьВзаиморасчетов = 0,1,КурсВзаиморасчетов/КратностьВзаиморасчетов);			
		СтрокаТабличнойЧасти.УЗ_СуммаРегл = СтрокаТабличнойЧасти.Сумма*КоэффициентПересчета;
	//конец изменений 
	КонецЕсли;
КонецПроцедуры

Процедура ПересчитатьТолькоСуммуРуб(СтрокаТабличнойЧасти) Экспорт
	Если Не УЗ_ПоказыватьСуммыВРублях ИЛИ СуммаВключаетНДС Тогда
		//Это нужно только для сумм не включающих НДС
		Возврат;
	КонецЕсли;
	
	Если Товары.Индекс(СтрокаТабличнойЧасти) >= 0 
		ИЛИ Услуги.Индекс(СтрокаТабличнойЧасти) >= 0  Тогда
		
		КоэффициентПересчета = ?(КратностьВзаиморасчетов = 0,1,КурсВзаиморасчетов/КратностьВзаиморасчетов);			
		
		ИтогоСумма = (СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.СуммаНДС)*КоэффициентПересчета;
		
		СтрокаТабличнойЧасти.УЗ_СуммаРегл = ИтогоСумма - СтрокаТабличнойЧасти.УЗ_СуммаНДСРегл; 
	//начало изменений
	ИначеЕсли ВозвратнаяТара.Индекс(СтрокаТабличнойЧасти) >= 0 Тогда
		КоэффициентПересчета = ?(КратностьВзаиморасчетов = 0,1,КурсВзаиморасчетов/КратностьВзаиморасчетов);
		
		ИтогоСумма = (СтрокаТабличнойЧасти.Сумма)*КоэффициентПересчета;
		
		СтрокаТабличнойЧасти.УЗ_СуммаРегл = ИтогоСумма; 
		
	//конец изменений 
	КонецЕсли;
КонецПроцедуры

//----m.ionov@a-prof.ru---

//m.ionov@a-prof.ru 23.09.2014
Процедура ЗаписатьИзменениеСтатусов(Отказ) Экспорт
	
	//Движения по регистру накопления "АП_СтатусыДокументов"
	//начало изменений Ожиганов 08.06.2015 запись будущим периодом 
	//поскольку запись осуществляется следующей  секундой будем брать срез последних на конец дня
	//есть шанс получить несоотвествие но до этого надеюсь не дойдет
	//в противном случае всегда будем наблюдать ошибку запись с такими поля существует
	ТекДата = ТекущаяДата();
	КонДня = КонецДня(ТекущаяДата());
	//конец изменений 
	
	//Движения по регистру накопления "АП_СтатусыДокументов"
	//ДанныеПоСтатусу = РегистрыСведений.АП_СтатусыДокументов.СрезПоследних(ТекущаяДата(), Новый Структура("Документ", Ссылка));
	ДанныеПоСтатусу = РегистрыСведений.АП_СтатусыДокументов.СрезПоследних(КонДня, Новый Структура("Документ", Ссылка));
	
	Если ДанныеПоСтатусу.Количество() = 0 Тогда
		СформируемЗаписьПоРегиструСтатусы(Отказ,ТекДата);
	ИначеЕсли НЕ ДанныеПоСтатусу[0].Статус = СП_СтатусДокумента Тогда
	    СформируемЗаписьПоРегиструСтатусы(Отказ,Макс(ДанныеПоСтатусу[0].Период,ТекДата));
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформируемЗаписьПоРегиструСтатусы(Отказ,ТекДата)

	//мДатаЗаписи = ТекущаяДата();
	мДатаЗаписи = ТекДата;
	
	НаборЗаписей = РегистрыСведений.АП_СтатусыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(мДатаЗаписи);
	
	НаборЗаписей.Прочитать();
	
	//начало изменений Ожиганов 08.06.2015 запись будущим периодом 
	//Если НаборЗаписей.Количество() > 0 Тогда
	Пока НаборЗаписей.Количество() > 0 Цикл
	
		мДатаЗаписи  = мДатаЗаписи + 1;
		//начало изменений Ожиганов 08.06.2015 запись будущим периодом 
		НаборЗаписей.Очистить();
		//конец изменений 
		
		//НаборЗаписей = РегистрыСведений.АП_СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НаборЗаписей.Отбор.Период.Установить(мДатаЗаписи);
		
		НаборЗаписей.Прочитать();
	//КонецЕсли;
	КонецЦикла;
	//конец изменений  
	
//	НаборЗаписей.Прочитать();
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = мДатаЗаписи;
	НоваяСтрока.Документ = Ссылка;
	НоваяСтрока.Статус = СП_СтатусДокумента;
	НоваяСтрока.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
	Попытка		
		НаборЗаписей.Записать();		
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
	КонецПопытки;
	
КонецПроцедуры 
//----m.ionov@a-prof.ru---

//m.ionov@a-prof.ru 08.10.2014
Функция ДоступенСтатусДокумента() Экспорт
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
		И ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад
		И (СкладОрдер.СП_СкладГП ИЛИ СкладОрдер.НСИ_ПодключенКSolvo)
		И СкладОрдер.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция МожноМенятьСоставСтрок() Экспорт
	Если РольДоступна("АП_Администратор") Тогда
		Возврат Истина;
	КонецЕсли;
	
	//m_ionov@mail.ru 06.09.2016
	Если УЗ_ОбменПролайт И Не РольДоступна("МЗ_Администратор") Тогда
		Возврат Ложь;
	КонецЕсли;
	//------- m_ionov@mail.ru -------
	
	Если Не ДоступенСтатусДокумента() ИЛИ Не Проведен Тогда
		Возврат Истина;
	ИначеЕсли Не СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Открыто 
		И Не СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Отменено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Не МожноМенятьСоставСтрок() И Не УЗ_ОбменПролайт Тогда //m_ionov@mail.ru 06.09.2016 - отмену проведения при обмене с Пролайт не запрещаем
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция МожноОтражатьВБУУчете() Экспорт
	Если РольДоступна("АП_Администратор") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ДоступенСтатусДокумента() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если АП_ОбщегоНазначенияСервер.ДоступнаРоль(глЗначениеПеременной("глТекущийПользователь"), Справочники.АП_РолиПользователей.СотрудникБухгалтерии)
		и (СП_СтатусДокумента = Перечисления.СП_СтатусыПоступленияТоваров.Закрыто ИЛИ ОтражатьВБухгалтерскомУчете) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//m.ionov@a-prof.ru 25.02.2015
Функция ЕстьДокументыПоБонусномуАкту(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслуг.ПКК_АктНачисленияБонусов = &ПКК_АктНачисленияБонусов
	               |	И НЕ ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ПКК_АктНачисленияБонусов", ПКК_АктНачисленияБонусов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Бонусный акт " + СокрЛП(ПКК_АктНачисленияБонусов) + " уже используются в документе " + СокрЛП(Результат.Ссылка), Отказ);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//----m.ionov@a-prof.ru---

//начало изменений Ожиганов проведение с 0 количество   
Процедура ПРГ_ФормированиеДвиженийТоварыПолученные(ТаблицаПоТоварам, СтруктураШапкиДокумента, Заголовок, РежимПроведения, Отказ)
	ДвиженияТоварыКПолучению =  Движения.ТоварыКПолучениюНаСклады;
	
	ТаблДвижений  =  ТаблицаПоТоварам.Скопировать(,"Склад,Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Качество,Количество");
	ТаблДвижений.Колонки.Добавить("ДокументПолучения");
	ТаблДвижений.Колонки.Добавить("Регистратор");
	ТаблДвижений.Колонки.Добавить("СтатусПартии");
	ТаблДвижений.ЗаполнитьЗначения(Перечисления.СтатусыПартийТоваров.Купленный,"СтатусПартии");
	ТаблДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Ссылка,"ДокументПолучения,Регистратор");
	
	ДвиженияТоварыКПолучению.мТаблицаДвижений   = ТаблДвижений; 
	ДвиженияТоварыКПолучению.мПериод  			= СтруктураШапкиДокумента.Дата;
	ДвиженияТоварыКПолучению.ВыполнитьПриход();
	//ТаблицаПоТоварам.Колонки.Добавить("ДокументПолучения");
КонецПроцедуры	
//конец изменений 

//начало изменений Ожиганов 29.02.2016 49618 учет доп.соглашений в учетной системе 1С 
Процедура ПРГ_ПроверкаВозможностиПроведенияПоДоговору(СтруктураШапкиДокумента,ТаблицаПоТоварам,ТаблицаОборудование,ТаблицаПоОбъектамСтроительства,ТаблицаПоТаре,Отказ)
	Если Отказ и Не ПараметрыСеанса.ПроведениеДокументов Тогда
		возврат;
	КонецЕсли;	
	
	
	Если не ЗначениеЗаполнено(СтруктураШапкиДокумента.ПРГ_КонтрольЗакупок) ИЛИ Не СтруктураШапкиДокумента.ПРГ_КонтрольЗакупок // Шевченков 20160301 №49721 добавил на проверку заполненности
		или (СтруктураШапкиДокумента.ПРГ_СуммаПоДоговору = 0 и СтруктураШапкиДокумента.ПРГ_КоличествоПоДоговору=0)
		//видимо позже условие на валюту
		Тогда
		возврат 
	КонецЕслИ;	
	
	
	ПРГ_КоличествоПоДоговору = 0;
	ПРГ_СуммаПоДоговору      = 0;
	
	НемспВидном  =  ЗначениеИзСтрокиВнутр("{""#"",a2a4ee36-68b1-47cf-adfa-a102f79aaea0,58:8936005056a963c611e33a53d2cdbceb}"); //10.04 Тара и тарные материалы
	//просчитаем добаввку по текщемц документу
	Для Каждого ТекСтрока ИЗ ТаблицаПоТоварам Цикл
		Если ТекСтрока.видноменклатуры <> НемспВидном Тогда
			ПРГ_КоличествоПоДоговору = ПРГ_КоличествоПоДоговору + ТекСтрока.Количество;
		КонецЕслИ;	
		ПРГ_СуммаПоДоговору = ПРГ_СуммаПоДоговору + ТекСтрока.СуммаВзаиморасчетов;
	КонецЦикла;	
		
	Для Каждого ТекСтрока ИЗ ТаблицаОборудование Цикл
		Если ТекСтрока.видноменклатуры <> НемспВидном Тогда
			ПРГ_КоличествоПоДоговору = ПРГ_КоличествоПоДоговору + ТекСтрока.Количество;
		КонецЕслИ;	
		ПРГ_СуммаПоДоговору = ПРГ_СуммаПоДоговору + ТекСтрока.СуммаВзаиморасчетов;
	КонецЦикла;	
	
	Для Каждого ТекСтрока ИЗ ТаблицаПоОбъектамСтроительства Цикл
		ПРГ_КоличествоПоДоговору = ПРГ_КоличествоПоДоговору + 1;
		ПРГ_СуммаПоДоговору = ПРГ_СуммаПоДоговору + ТекСтрока.СуммаВзаиморасчетов;
	КонецЦикла;	
	
	ПРГ_СуммаПоДоговору = ПРГ_СуммаПоДоговору +  ТаблицаПоТаре.Итог("СуммаВзаиморасчетов");
	
	//вычисли суммы других незакрытых заказов и поступлений
	Запрос = ПРГ_ПолучитьЗапросПозаказамиПост();

	
	Запрос.УстановитьПараметр("ВидНоменклатуры",НемспВидном);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",СтруктураШапкиДокумента.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДокЗаказа",Документы.ЗаказПоставщику.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДокПоступления",Ссылка);
	
	ТаблИтогов = Запрос.Выполнить().Выгрузить();
	ТаблИтогов[0].Количество   = ТаблИтогов[0].Количество   + ПРГ_КоличествоПоДоговору;
	ТаблИтогов[0].СуммаПоВзаим = ТаблИтогов[0].СуммаПоВзаим + ПРГ_СуммаПоДоговору;
	
	ТекстОшибки = "";
	//контроль по сумме
	Если (СтруктураШапкиДокумента.ПРГ_СуммаПоДоговору > 0)
	 и (ТаблИтогов[0].СуммаПоВзаим > СтруктураШапкиДокумента.ПРГ_СуммаПоДоговору)
	 //и СтруктураШапкиДокумента.ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета
		Тогда 
		ТекстОшибки = ТекстОшибки+?(ПустаяСтрока(ТекстОшибки),"",Символы.ПС)+"Превышена сумма договора "+(ТаблИтогов[0].СуммаПоВзаим - СтруктураШапкиДокумента.ПРГ_СуммаПоДоговору)+". Сумма договора "+СтруктураШапкиДокумента.ПРГ_СуммаПоДоговору+"
		|Сумма не закрытых заказов и поступлений по договору "+ТаблИтогов[0].СуммаПоВзаим+".";
	КонецЕсли;	
	
	//контроль по сумме
	Если (СтруктураШапкиДокумента.ПРГ_КоличествоПоДоговору > 0)
	 и (ТаблИтогов[0].Количество > СтруктураШапкиДокумента.ПРГ_КоличествоПоДоговору)
	 //и СтруктураШапкиДокумента.ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета
		Тогда 
		ТекстОшибки = ТекстОшибки+?(ПустаяСтрока(ТекстОшибки),"",Символы.ПС)+"Превышено количество по договору "+(ТаблИтогов[0].Количество - СтруктураШапкиДокумента.ПРГ_КоличествоПоДоговору)+". Количество по договору "+СтруктураШапкиДокумента.ПРГ_КоличествоПоДоговору+"
		|Количество по не закрытым заказам и поступлениям по договору "+ТаблИтогов[0].Количество+".";
	КонецЕсли;	
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = ТекстОшибки+"
		|Используйте другой договор, по которму нет превышения по количеству или сумме!!!";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,Отказ);
	КонецЕсли;	
	
	
КонецПроцедуры	

Функция ПРГ_ПолучитьЗапросПозаказамиПост()
	возврат Новый Запрос("ВЫБРАТЬ
	                     |	ПоступлениеТоваровУслуг.Ссылка						 
	                     |ПОМЕСТИТЬ ТаблПоступлений
	                     |ИЗ
	                     |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                     |ГДЕ
	                     |	ПоступлениеТоваровУслуг.Проведен
	                     |	И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
	                     |	И ПоступлениеТоваровУслуг.Дата >= ДАТАВРЕМЯ(2014, 1, 1)
	                     |;
						 // <- Шевченков 20170726 #68487						 
						 |ВЫБРАТЬ
	                     |	ВозвратТоваровПоставщику.Ссылка						 
	                     |ПОМЕСТИТЬ ТаблВозвратов
	                     |ИЗ
	                     |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	                     |ГДЕ
	                     |	ВозвратТоваровПоставщику.Проведен
	                     |	И ВозвратТоваровПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента
	                     |	И ВозвратТоваровПоставщику.Дата >= ДАТАВРЕМЯ(2014, 1, 1)
	                     |;
						 // ->
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Количество), 0) КАК Количество,
	                     |	ЕСТЬNULL(СУММА(ВложенныйЗапрос.СуммаПоВзаим), 0) КАК СуммаПоВзаим,
	                     |	СУММА(ВложенныйЗапрос.СуммаПоВзаимПоступл) КАК СуммаПоВзаимПоступл,
	                     |	СУММА(ВложенныйЗапрос.КоличествоПоступл) КАК КоличествоПоступл,
	                     |	СУММА(ВложенныйЗапрос.КоличествоЗаказа) КАК КоличествоЗаказа,
	                     |	СУММА(ВложенныйЗапрос.СуммаПоВзаимЗаказа) КАК СуммаПоВзаимЗаказа
	                     |ИЗ
	                     |	(ВЫБРАТЬ
	                     |		СУММА(ПоступлениеТоваровУслугТовары.Количество * ВЫБОР
	                     |				КОГДА ПоступлениеТоваровУслугТовары.Коэффициент > 0
	                     |					ТОГДА ПоступлениеТоваровУслугТовары.Коэффициент
	                     |				ИНАЧЕ 1
	                     |			КОНЕЦ) КАК Количество,
	                     |		0 КАК СуммаПоВзаим,
	                     |		0 КАК СуммаПоВзаимПоступл,
	                     |		СУММА(ПоступлениеТоваровУслугТовары.Количество * ВЫБОР
	                     |				КОГДА ПоступлениеТоваровУслугТовары.Коэффициент > 0
	                     |					ТОГДА ПоступлениеТоваровУслугТовары.Коэффициент
	                     |				ИНАЧЕ 1
	                     |			КОНЕЦ) КАК КоличествоПоступл,
	                     |		0 КАК КоличествоЗаказа,
	                     |		0 КАК СуммаПоВзаимЗаказа
	                     |	ИЗ
	                     |		ТаблПоступлений КАК ТаблПоступлений
	                     |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                     |			ПО ТаблПоступлений.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	                     |				И (ТаблПоступлений.Ссылка <> &ДокПоступления)
	                     |	ГДЕ
	                     |		ПоступлениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
	                     |	
						 // <- Шевченков 20170726 #68487
						 |	ОБЪЕДИНИТЬ ВСЕ						 
						 |	ВЫБРАТЬ
						 |		СУММА(-1 * ВозвратТоваровПоставщикуТовары.Количество * ВЫБОР
						 |				КОГДА ВозвратТоваровПоставщикуТовары.Коэффициент > 0
						 |					ТОГДА ВозвратТоваровПоставщикуТовары.Коэффициент
						 |				ИНАЧЕ 1
						 |			КОНЕЦ),
						 |		0,
						 |		0,
						 |		СУММА(-1 * ВозвратТоваровПоставщикуТовары.Количество * ВЫБОР
						 |				КОГДА ВозвратТоваровПоставщикуТовары.Коэффициент > 0
						 |					ТОГДА ВозвратТоваровПоставщикуТовары.Коэффициент
						 |				ИНАЧЕ 1
						 |			КОНЕЦ),
						 |		0,
						 |		0
						 |	ИЗ
						 |		ТаблВозвратов КАК ТаблВозвратов
						 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
						 |			ПО ТаблВозвратов.Ссылка = ВозвратТоваровПоставщикуТовары.Ссылка
						 |	ГДЕ
						 |		ВозвратТоваровПоставщикуТовары.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
						 |	
						 |	ОБЪЕДИНИТЬ ВСЕ						 
						 |
						 |	ВЫБРАТЬ
						 |		0,
						 |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов,
						 |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов,
						 |		0,
						 |		0,
						 |		0
						 |	ИЗ
						 |		РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
						 |			ГДЕ ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента = &ДоговорКонтрагента
						 |			И ВзаиморасчетыСКонтрагентами.Регистратор Ссылка Документ.ВозвратТоваровПоставщику
						 // ->
						 |	 ОБЪЕДИНИТЬ ВСЕ
						 //|	ВЫБРАТЬ
						 //|		ЗаказыПоставщикамОстатки.КоличествоОстаток,
						 //|		ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток,
						 //|		0,
						 //|		0,
						 //|		ЗаказыПоставщикамОстатки.КоличествоОстаток,
						 //|		ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток
						 //|	ИЗ
						 //|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
						 //|				,
						 //|				ДоговорКонтрагента = &ДоговорКонтрагента
						 //|					И Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры
						 //|					И ЗаказПоставщику <> &ДокЗаказа) КАК ЗаказыПоставщикамОстатки
						 //|	
						 //|	ОБЪЕДИНИТЬ ВСЕ
	                     |	
	                     |	ВЫБРАТЬ
	                     |		0,
	                     |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов,
	                     |		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетов,
	                     |		0,
	                     |		0,
	                     |		0
	                     |	ИЗ
	                     |		ТаблПоступлений КАК ТаблПоступлений
	                     |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	                     |			ПО ТаблПоступлений.Ссылка = ВзаиморасчетыСКонтрагентами.Регистратор
						 |			И (ТаблПоступлений.Ссылка <> &ДокПоступления)
	                     |	
	                     |	ОБЪЕДИНИТЬ ВСЕ
	                     |	
	                     |	ВЫБРАТЬ
	                     |		СУММА(ПоступлениеТоваровУслугОборудование.Количество * ВЫБОР
	                     |				КОГДА ПоступлениеТоваровУслугОборудование.Коэффициент > 0
	                     |					ТОГДА ПоступлениеТоваровУслугОборудование.Коэффициент
	                     |				ИНАЧЕ 1
	                     |			КОНЕЦ),
	                     |		0,
	                     |		0,
	                     |		СУММА(ПоступлениеТоваровУслугОборудование.Количество * ВЫБОР
	                     |				КОГДА ПоступлениеТоваровУслугОборудование.Коэффициент > 0
	                     |					ТОГДА ПоступлениеТоваровУслугОборудование.Коэффициент
	                     |				ИНАЧЕ 1
	                     |			КОНЕЦ),
	                     |		0,
	                     |		0
	                     |	ИЗ
	                     |		ТаблПоступлений КАК ТаблПоступлений
	                     |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	                     |			ПО ТаблПоступлений.Ссылка = ПоступлениеТоваровУслугОборудование.Ссылка
						 |			И (ТаблПоступлений.Ссылка <> &ДокПоступления)
	                     |	
	                     |	ОБЪЕДИНИТЬ ВСЕ
	                     |	
	                     |	ВЫБРАТЬ
	                     |		СУММА(1),
	                     |		0,
	                     |		0,
	                     |		СУММА(1),
	                     |		0,
	                     |		0
	                     |	ИЗ
	                     |		ТаблПоступлений КАК ТаблПоступлений
	                     |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	                     |			ПО ТаблПоступлений.Ссылка = ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка
						 |           И (ТаблПоступлений.Ссылка <> &ДокПоступления)
						 |) КАК ВложенныйЗапрос
						 |			
						 |");
КонецФункции	
	
//конец изменений

// <- Шевченков №51287 20160414
Функция ЕстьСтрокиБезЦеныБлокПроведения(ТаблицаПоТоварам)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПоТоварам.Номенклатура
	|ПОМЕСТИТЬ втТаблицаПоТоварам
	|ИЗ
	|	&ТаблицаПоТоварам КАК ТаблицаПоТоварам
	|ГДЕ
	|	ТаблицаПоТоварам.Цена = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРГ_СлужебныйТаблицаПараметров.Параметр
	|ПОМЕСТИТЬ втПапки
	|ИЗ
	|	Справочник.ПРГ_Служебный.ТаблицаПараметров КАК ПРГ_СлужебныйТаблицаПараметров
	|ГДЕ
	|	ПРГ_СлужебныйТаблицаПараметров.Ссылка = &Исключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблПоТоварам.Номенклатура
	|ИЗ
	|	втТаблицаПоТоварам КАК втТаблПоТоварам
	|ГДЕ
	|	НЕ втТаблПоТоварам.Номенклатура В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					втПапки.Параметр
	|				ИЗ
	|					втПапки КАК втПапки)";
	Запрос.УстановитьПараметр("Исключения", Справочники.ПРГ_Служебный.НайтиПоКоду("000000051"));
	Запрос.УстановитьПараметр("ТаблицаПоТоварам", ТаблицаПоТоварам);
	Рез = Запрос.Выполнить();
	
	Возврат ?(Рез.Пустой(), Ложь, Истина);
	
КонецФункции
// ->

//m_ionov@mail.ru 23.09.2016
Функция РасчитатьСтоимостьПоставкиМолока() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.БазоваяЦена,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ПроцентБелка,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ПроцентЖира,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.МаксимальныйПроцентБелка,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.МаксимальныйПроцентЖира,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.НадбавкаЗаТранспортировку,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ПроцентБелкаВЦене,
	               |	НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ПроцентЖираВЦене,
	               |	ВЫБОР
	               |		КОГДА НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ККб = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ НСИ_УсловияПоставкиСырогоМолокаСрезПоследних.ККб
	               |	КОНЕЦ КАК ККб
	               |ИЗ
	               |	РегистрСведений.НСИ_УсловияПоставкиСырогоМолока.СрезПоследних(
	               |			&ДатаУсловий,
	               |			ДоговорКонтрагента = &ДоговорКонтрагента
	               |				И (ДействуетДо >= &ДействуетДо
				   |				ИЛИ ДействуетДо = &ПустаяДата)) КАК НСИ_УсловияПоставкиСырогоМолокаСрезПоследних";
	Запрос.УстановитьПараметр("ДатаУсловий", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	//m_ionov@mail.ru 13.03.2017
	//В условия поставки сырого молока добавили дату по которую действует условие поставки	
	Запрос.УстановитьПараметр("ДействуетДо", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); //на условия поставки, которые завели до ввода ограничения по дате действия
	//------- m_ionov@mail.ru -------
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Не Результат.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найдены условия поставки сырого молока для контрагента " + СокрЛП(Контрагент) + " по договору " + СокрЛП(ДоговорКонтрагента), Истина, "Расчет стоимости поставки сырого молока", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
		
	Если Результат.ПроцентЖираВЦене > 0 И Результат.ПроцентЖира = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указаны показатели расчета стоимости цены молока, указан % жира в цене, но не указан базовый показатель МДЖ для контрагента " + СокрЛП(Контрагент) + " по договору " + СокрЛП(ДоговорКонтрагента), Истина, "Расчет стоимости поставки сырого молока", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат.ПроцентБелкаВЦене > 0 И Результат.ПроцентБелка = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указаны показатели расчета стоимости цены молока, указан % белка в цене, но не указан базовый показатель МДБ для контрагента " + СокрЛП(Контрагент) + " по договору " + СокрЛП(ДоговорКонтрагента), Истина, "Расчет стоимости поставки сырого молока", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат.ПроцентЖираВЦене > 0 Тогда
		Цж = (Результат.БазоваяЦена*Результат.ПроцентЖираВЦене/100)/Результат.ПроцентЖира;
	Иначе
	    Цж = 0;
	КонецЕсли;
	
	Если Результат.ПроцентЖираВЦене > 0 Тогда
		Цб = (Результат.БазоваяЦена*Результат.ПроцентБелкаВЦене/100)/Результат.ПроцентБелка;
	Иначе
	    Цб = 0;
	КонецЕсли;
	
	Для каждого СтрокаТоваров Из Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТоваров.СерияНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;
		ЦенаМолока = (Цж*МИН(СтрокаТоваров.СерияНоменклатуры.НСИ_МДЖ,Результат.МаксимальныйПроцентЖира) + Цб*МИН(СтрокаТоваров.СерияНоменклатуры.НСИ_МДБ,Результат.МаксимальныйПроцентБелка)*Результат.ККб) + Результат.НадбавкаЗаТранспортировку;
		СтрокаТоваров.Цена = ЦенаМолока;
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТоваров, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТоваров, ЭтотОбъект);
	    	
		ПРГПересчитатьСуммуНакладной(СтрокаТоваров);

	КонецЦикла; 
	
	Возврат Истина;
КонецФункции

//перенес из формы документа
Процедура ПРГПересчитатьСуммуНакладной(ТекСтрока) Экспорт
	Если Не ПРГ_ИспользоватьКолонкиПоНакл Тогда
		возврат;
	КонецЕслИ;	
	Если ТекСтрока.Количество = ТекСтрока.СП_КоличествоПоНакладной 
		и ТекСтрока.СП_КоличествоПоНакладной > 0
	 	и ТекСтрока.Сумма > 0 Тогда
		ТекСтрока.СП_Сумма  = ТекСтрока.Сумма;
		ТекСтрока.СП_НДС    = ТекСтрока.СуммаНДС;
		возврат;
	КонецЕсли; 
	
	ТекСтрока.СП_Сумма = ТекСтрока.Цена * ТекСтрока.СП_КоличествоПоНакладной;
	ПРГПересчитатьСуммуНДСНакладной(ТекСтрока);
КонецПроцедуры	

Процедура ПРГПересчитатьСуммуНДСНакладной(ТекСтрока) Экспорт
	
		ТекСтрока.СП_НДС  = УчетНДС.РассчитатьСуммуНДС(ТекСтрока.СП_Сумма,
	                                                   УчитыватьНДС, СуммаВключаетНДС,
	                                                   УчетНДС.ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС));
КонецПроцедуры
//------- m_ionov@mail.ru -------


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мУказаниеПроектовВТабличнойЧастиДокументов = УправлениеПроектами.УказаниеПроектовВТабличнойЧастиДокументов();

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, Услуги, Оборудование, ОбъектыСтроительства"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");

//начало изменений
мСтруктураПараметровВзаиморасчетовНДФЛ = Новый Структура;
мСтруктураПараметровВзаиморасчетовНДФЛ.Вставить("СтруктураТабличныхЧастей", Новый Структура("Услуги"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");
//конец изменений 

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();

УказаниеСкладов = Константы.УказаниеСкладовВТабличнойЧастиДокументов.Получить();

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
                      Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);
					  
мИспользоватьТару = Константы.ИспользоватьВозвратнуюТару.Получить();

/// Кунов О.В., 27.11.2014 - 
мТабличнаяЧастьМодифицирована = Ложь;
///

//m_ionov@mail.ru 23.09.2016
ПРГ_ИспользоватьКолонкиПоНакл = Ложь;
//------- m_ionov@mail.ru -------