//Blik 211113
// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;

КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПРГ_ДокументыАрхиваМестоположение.Записывать = Истина;
	Движения.ПРГ_ДокументыАрхиваМестоположение.Очистить();
	Для Каждого ТекСтрокаДокументыАрхива Из ДокументыАрхива Цикл
		Движение = Движения.ПРГ_ДокументыАрхиваМестоположение.Добавить();
		Движение.Период = Дата;
		Движение.ДокументАрхива = ТекСтрокаДокументыАрхива.Документ;
		Движение.МестоположениеДокументаАрхива = ТекСтрокаДокументыАрхива.Местоположение;
		
		//установить местоположение в справочнике
		
		
	КонецЦикла;

	
КонецПроцедуры
