Функция ПолучитьКлассКонтрагентаПоСсылке(Ссылка) Экспорт
	
	СтрокаКласса = "Класс не указан";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПРГКлассификацияКонтрагентовСрезПоследних.Период,
	|	ПРГКлассификацияКонтрагентовСрезПоследних.Контрагент,
	|	ПРГКлассификацияКонтрагентовСрезПоследних.ПРГКлассКонтрагента
	|ИЗ
	|	РегистрСведений.ПРГКлассификацияКонтрагентов.СрезПоследних(, Контрагент = &Ссылка) КАК ПРГКлассификацияКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ПРГКлассКонтрагента) Тогда
			СтрокаКласса = Выборка.ПРГКлассКонтрагента;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат СтрокаКласса
	
КонецФункции
