// Формирование сообщения о необходимости проведения рег.операции "Закрытие года",
// в случае изменения ставки налога на прибыль
//
Процедура СообщитьОбИзмененииСтавки(ВходящиеДанные = Неопределено) Экспорт
	
	Если ВходящиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ДатаРеформации = НачалоДня(ВходящиеДанные.Период) - 1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРеформации",    ДатаРеформации);
	Запрос.УстановитьПараметр("ГраницаРеформации", Новый Граница(ДатаРеформации, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",       ВходящиеДанные.Организация);
	
	Массив = Новый Массив;
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивы);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеОбязательства);
	Запрос.УстановитьПараметр("Счета", Массив);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_УчетнаяПолитикаОрганизаций
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ДатаРеформации, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.ПоддержкаПБУ18
	|	И УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ХозрасчетныйОстатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаРеформации,
	|			Счет В ИЕРАРХИИ (&Счета),
	|			,
	|			Организация = &Организация
	|				И Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ХозрасчетныйОстатки.Организация КАК Организация,
	|	ВТ_ХозрасчетныйОстатки.Организация.НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УчетнаяПолитикаОрганизаций КАК ВТ_УчетнаяПолитикаОрганизаций
	|		ПО ВТ_ХозрасчетныйОстатки.Организация = ВТ_УчетнаяПолитикаОрганизаций.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	СокращенноеНаименованиеОрганизации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ШаблонСообщения = НСтр("ru = 'Изменена ставка налога на прибыль.
		|Рекомендуется выполнить регламентную операцию ""Закрытие года""
		|за декабрь %1 года для организации:
		|%2'");
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения, Формат(Год(ДатаРеформации), "ЧГ="),
		СокрЛП(Выборка.СокращенноеНаименованиеОрганизации));
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры
