
#Если Клиент Тогда
	
#КонецЕсли

Процедура ВыгрузитьДанные() Экспорт
	
	Текст = Новый ТекстовыйДокумент; 
	
	Строка = "";
	ТабКолонки = ТЗ.ВыгрузитьКолонки();
	Для каждого СтрКолонка из ТабКолонки.Колонки цикл
		Строка = Строка + СтрКолонка.Заголовок + Символы.Таб;
	КонецЦикла;
	
	Строка = Лев(Строка,СтрДлина(Строка)-1);
	Текст.ДобавитьСтроку(Строка); 
	
	Для каждого стр из ТЗ цикл
		
		#Если Клиент Тогда
        ОбработкаПрерыванияПользователя();
		Состояние("Выгрузка строки " + СокрЛП(ТЗ.Индекс(стр)) + "/" + СокрЛП(ТЗ.Количество()));
		#КонецЕсли
		
		Строка = "";
		Для каждого Кол из стр цикл
			Строка = Строка + Кол + Символы.Таб;
		КонецЦикла;
		Строка = Лев(Строка,СтрДлина(Строка)-1);
		Текст.ДобавитьСтроку(Строка); 
	КонецЦикла;
	
	Текст.Записать(ПутьФайла,"cp866");    	
	
КонецПроцедуры

Процедура ЗаполнитьДанные() Экспорт
	
	ТЗ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланыПродаж.Период,
	               |	ПланыПродаж.Сценарий,
	               |	ПланыПродаж.Номенклатура,
	               |	ПланыПродаж.Контрагент,
	               |	ПланыПродаж.ППП_АдресПоставки КАК АдресПоставки,
	               |	ПланыПродаж.ППП_ТоварнаяКатегория.Код КАК ТоварнаяКатегория,
	               |	ПланыПродаж.ППП_Брендообъем.Код КАК Брендообъем,
	               |	ПланыПродаж.ППП_КаналПродаж КАК КаналПродаж,
	              // |	ПланыПродаж.ППП_ТорговыйПредставитель.Код КАК ТорговыйПредставитель,
	               |	ПланыПродаж.ППП_ПрайсЛист,
	               |	ПланыПродаж.ППП_ВесБрутто КАК ВесБрутто,
	               |	ПланыПродаж.Стоимость КАК Сумма,
	               |	ПланыПродаж.ППП_ВесНетто КАК ВесНетто,
	               |	ПланыПродаж.ППП_Литры КАК Литры,
	               |	ПланыПродаж.ППП_СуммаПрайсЛист,
	               |	ПланыПродаж.ППП_СуммаПовышенияЦен,
	               |	ПланыПродаж.ППП_СуммаПромоАкции,
	               |	ПланыПродаж.ППП_СуммаГросс,
	               |	ПланыПродаж.ППП_СуммаБюджетРетробонусов,
	               |	ПланыПродаж.ППП_СуммаМаркетинговыеУслуги,
	               |	ПланыПродаж.ППП_СуммаЭТК,
	               |	ПланыПродаж.Количество КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &ДатаС И &ДатаПо
	               |	И ПланыПродаж.Сценарий = &Сценарий";
	
	Запрос.УстановитьПараметр("ДатаС", НачалоДня(ДатаС));
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ДатаПо));
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	Результат = ЗАпрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДок Из Результат Цикл
		#Если Клиент Тогда
        ОбработкаПрерыванияПользователя();
		Состояние("Заполнение строки " + СокрЛП(Результат.Индекс(СтрокаДок)) + "/" + СокрЛП(Результат.Количество()));
		#КонецЕсли
		
		 СтрокаТЗ = ТЗ.Добавить();
		 ЗаполнитьЗначенияСвойств(СтрокаТЗ,СтрокаДок);
		 
		 СтрокаТЗ.Период = Формат(СтрокаДок.Период,"ДФ=dd.MM.yyyy");
		 	 
		 СтрокаТЗ.АдресПоставки =  СокрЛП(СтрокаДок.АдресПоставки.КодАдреса);
		 СтрокаТЗ.Отделение     =  СокрЛП(СтрокаДок.АдресПоставки.НСИ_Отделение.Наименование);
		 Если СтрокаТЗ.Отделение = "" тогда
			  СтрокаТЗ.Отделение =  СокрЛП(СтрокаДок.Контрагент.НСИ_Отделение.Наименование);
		 КонецЕсли;
		 СтрокаТЗ.Контрагент = СокрЛП(СтрокаДок.Контрагент.Код);
		 Если СтрокаДок.Номенклатура <> неопределено тогда
			 СтрокаТЗ.Номенклатура = СокрЛП(СтрокаДок.Номенклатура.Код);
		 Иначе 
			 СтрокаТЗ.Номенклатура = "0"
		 КонецЕсли;
		 СтрокаТЗ.КаналПродаж = СокрЛП(СтрокаДок.КаналПродаж.Код);
		 //СтрокаТЗ.Сценарий = СокрЛП(СтрокаДок.Сценарий.Код);
	КонецЦикла; 
	
КонецПроцедуры
