
Процедура ПередЗаписью(Отказ, Замещение)
	
	//{11.03.2016 Островерхий заявка №50104 
	Если Замещение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСпецификацииНоменклатуры.СпецификацияНоменклатуры
		|ИЗ
		|	РегистрСведений.ОсновныеСпецификацииНоменклатуры КАК ОсновныеСпецификацииНоменклатуры
		|ГДЕ
		|	ОсновныеСпецификацииНоменклатуры.Период = &Период
		|	И ОсновныеСпецификацииНоменклатуры.Номенклатура = &Номенклатура
		|	И ОсновныеСпецификацииНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И ОсновныеСпецификацииНоменклатуры.Подразделение = &Подразделение";
		
		Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Отбор.Номенклатура.Значение);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.Период.Значение);
		Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Отбор.Подразделение.Значение);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ЭтотОбъект.Отбор.ХарактеристикаНоменклатуры.Значение);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Описание = "Период:"+Строка(ЭтотОбъект.Отбор.Период.Значение)
				+"; Номенклатура:"+Строка(ЭтотОбъект.Отбор.Номенклатура.Значение)+"-"+Строка(ЭтотОбъект.Отбор.Номенклатура.Значение.УникальныйИдентификатор())
				+"; Подразделение:"+Строка(ЭтотОбъект.Отбор.Подразделение.Значение)+"-"+Строка(ЭтотОбъект.Отбор.Подразделение.Значение.УникальныйИдентификатор())
				+"; Спецификация:"+Строка(ВыборкаДетальныеЗаписи.СпецификацияНоменклатуры)+"-"+Строка(ВыборкаДетальныеЗаписи.СпецификацияНоменклатуры.УникальныйИдентификатор());
			
			ЗаписьЖурналаРегистрации("Удаление данных из РС Основные спецификации номенклатуры",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ОсновныеСпецификацииНоменклатуры,
				,
				Описание, 
				РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		
		КонецЕсли; 
		
	Иначе
		
		//Проверка на то что Выходное издление соответствует устанавливаемой номенклатуре
		Запрос = Новый Запрос;
		//m_ionov@mail.ru 16.11.2016
		//Странная проверка на то что Выходное издление соответствует устанавливаемой номенклатуре,
		//Нужно проверить что это выходное изделение есть в этой спецификации, а не то что ничего другого там нет
		//------- m_ionov@mail.ru -------
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпецификацииНоменклатурыВыходныеИзделия.Номенклатура КАК НоменклатураГП
		|ИЗ
		|	Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
		|ГДЕ
		|	СпецификацииНоменклатурыВыходныеИзделия.Ссылка = &Спецификация
		//m_ionov@mail.ru 16.11.2016
		//|	И НЕ СпецификацииНоменклатурыВыходныеИзделия.Номенклатура = &Номенклатура
		|	И СпецификацииНоменклатурыВыходныеИзделия.Номенклатура = &Номенклатура
		//------- m_ionov@mail.ru -------
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииНоменклатурыВыходныеИзделия.Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Отбор.Номенклатура.Значение);
		Запрос.УстановитьПараметр("Спецификация", ЭтотОбъект[0].СпецификацияНоменклатуры);
		
		//m_ionov@mail.ru 16.11.2016
		//Отказ = НЕ Запрос.Выполнить().Пустой();
		Отказ = Запрос.Выполнить().Пустой();
		//------- m_ionov@mail.ru -------
		
		Если Отказ Тогда
			#Если Клиент Тогда
				Сообщить("Спецификация не соответствует выбранной номенклатуре!",СтатусСообщения.ОченьВажное);
			#КонецЕсли
			
			Описание = "Период:"+Строка(ЭтотОбъект.Отбор.Период.Значение)
				+"; Номенклатура:"+Строка(ЭтотОбъект.Отбор.Номенклатура.Значение)+"-"+Строка(ЭтотОбъект.Отбор.Номенклатура.Значение.УникальныйИдентификатор())
				+"; Подразделение:"+Строка(ЭтотОбъект.Отбор.Подразделение.Значение)+"-"+Строка(ЭтотОбъект.Отбор.Подразделение.Значение.УникальныйИдентификатор())
				+"; Спецификация:"+Строка(ЭтотОбъект[0].СпецификацияНоменклатуры)+"-"+Строка(ЭтотОбъект[0].СпецификацияНоменклатуры.УникальныйИдентификатор());
			
			ЗаписьЖурналаРегистрации("Попытка вставки не корректных данных в РС Основные спецификации номенклатуры",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ОсновныеСпецификацииНоменклатуры,
				,
				Описание, 
				РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецЕсли; 
				
	КонецЕсли; 
	//11.03.2016 Островерхий} 
	
КонецПроцедуры