//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ
// 
//начало изменений Ожиганов 25.05.2015 немножко оптимизируем 
Функция ПРГПолучитьЧислоСубконто(Субк,ТаблСуконто)
	Если Не ЗначениеЗаполнено(Субк) Тогда
		возврат 0;
	КонецЕсли;	
	нз = ТаблСуконто.Найти(Субк.Ключ,"Субконто");
	Если нз = Неопределено Тогда
		нз = ТаблСуконто.Добавить();
		нз.Субконто = Субк.Ключ;
		нз.КолВо 	= Субк.Ключ.ТипЗначения.Типы().Количество();
	КонецЕсли;	
	возврат нз.КолВо;
КонецФункции	
//конец изменений 

// Обработчик события "ПередЗаписью".
// Проверяет возможность изменения записей регистра.
// Проверяет заполнение корреспонденции.
// Замещает пустные значения субконто составного типа значением Неопределено.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Количество()>0 Тогда
	    Заголовок = СокрЛП(ЭтотОбъект.Отбор.Регистратор.Значение);
	Иначе
		Возврат;
	КонецЕсли; 
	//начало изменений Ожиганов 14.05.2015 малость оптимизируем
	ТаблСуконто = Новый ТаблицаЗначений;
	ТаблСуконто.Колонки.Добавить("Субконто");
	ТаблСуконто.Колонки.Добавить("КолВо",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0)));
	ТаблСуконто.Индексы.Добавить("Субконто");
	//конец изменений 
	
	БухгалтерскийУчет.СвернутьНаборЗаписейРегистраБухгалтерии(ЭтотОбъект);
	Для Каждого Проводка Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Проводка.СчетДт) И НЕ Проводка.СчетКт.Забалансовый Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Проводка № "+(Проводка.НомерСтроки+1) +" <"+Проводка.Содержание+">: не заполнен счет дебета.",Отказ,Заголовок);
			
			Если ЗначениеЗаполнено(Проводка.СчетКт) Тогда
				Если ЗначениеЗаполнено(Проводка.СубконтоДт) Тогда
					Для Каждого Субконто Из Проводка.СубконтоКт Цикл
						Сообщить(Субконто);
					КонецЦикла;	
				КонецЕслИ;	
			КонецЕслИ;	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Проводка.СчетКт) И НЕ Проводка.СчетДт.Забалансовый Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Проводка № "+(Проводка.НомерСтроки+1) +" <"+Проводка.Содержание+">: не заполнен счет кредита.",Отказ,Заголовок);
		КонецЕсли;
		
		// Приведение пустых значений субконто составного типа.
		Для Каждого Субконто Из Проводка.СубконтоДт Цикл
			//начало изменений Ожиганов 25.05.2015 немножко оптимизируем 
			//Если Субконто.Ключ.ТипЗначения.Типы().Количество() > 1
			Если  ПРГПолучитьЧислоСубконто(Субконто,ТаблСуконто) > 1
			//конец изменений 	
			   И НЕ ЗначениеЗаполнено(Субконто.Значение) 
			   И НЕ (Субконто.Значение = Неопределено) Тогда
				Проводка.СубконтоДт.Вставить(Субконто.Ключ, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Субконто Из Проводка.СубконтоКт Цикл
			//начало изменений Ожиганов 25.05.2015 немножко оптимизируем 
			//Если Субконто.Ключ.ТипЗначения.Типы().Количество() > 1
			Если ПРГПолучитьЧислоСубконто(Субконто,ТаблСуконто) > 1
			//конец изменений 	
			   И НЕ ЗначениеЗаполнено(Субконто.Значение) 
			   И НЕ (Субконто.Значение = Неопределено) Тогда
				Проводка.СубконтоКт.Вставить(Субконто.Ключ, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()