
Процедура ПередЗаписью(Отказ)
	 
	//ТаблицаНоменклатуры = ПЦ_Ценообразование.ПолучитьНоменклатуруИзОбъектаСкидки(Ссылка);
	//ПолнаяНоменклатура.Загрузить(ТаблицаНоменклатуры);
	
	Если НЕ ЭтоГруппа тогда
	
	ТаблицаПроекты           = Проекты.Выгрузить();
	ТаблицаТоварныеКатегории = ТоварныеКатегории.Выгрузить();
	ТаблицаБрендообъемы      = Брендообъемы.Выгрузить();
	ТаблицаНоменклатура      = Номенклатура.Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ТаблицаПроекты.ПроектГП ПОМЕСТИТЬ ВТ_ТаблицаПроекты из &ТаблицаПроекты КАК ТаблицаПроекты;
	|ВЫБРАТЬ ТаблицаТоварныеКатегории.ТоварнаяКатегория ПОМЕСТИТЬ ВТ_ТаблицаТоварныеКатегории из &ТаблицаТоварныеКатегории КАК ТаблицаТоварныеКатегории;  
	|ВЫБРАТЬ ТаблицаБрендообъемы.Брендообъем ПОМЕСТИТЬ ВТ_ТаблицаБрендообъемы из &ТаблицаБрендообъемы КАК ТаблицаБрендообъемы;  
	|ВЫБРАТЬ ТаблицаНоменклатура.Номенклатура ПОМЕСТИТЬ ВТ_ТаблицаНоменклатура из &ТаблицаНоменклатура КАК ТаблицаНоменклатура;  
	|ВЫБРАТЬ
	|	ОбъектыСкидокПроекты.ПроектГП КАК Проект,
	|	NULL КАК ТоварнаяКатегория,
	|	NULL КАК Брендообъем,
	|	NULL КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ПолнаяПоОбъекту
	|ИЗ
	|	ВТ_ТаблицаПроекты КАК ОбъектыСкидокПроекты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСкидокТоварныеКатегории.ТоварнаяКатегория.Проект,
	|	ОбъектыСкидокТоварныеКатегории.ТоварнаяКатегория,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ТаблицаТоварныеКатегории КАК ОбъектыСкидокТоварныеКатегории
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСкидокБрендообъемы.Брендообъем.ТоварнаяКатегория.Проект,
	|	ОбъектыСкидокБрендообъемы.Брендообъем.ТоварнаяКатегория,
	|	ОбъектыСкидокБрендообъемы.Брендообъем,
	|	NULL
	|ИЗ
	|	ВТ_ТаблицаБрендообъемы КАК ОбъектыСкидокБрендообъемы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСкидокНоменклатура.Номенклатура.Проект,
	|	ОбъектыСкидокНоменклатура.Номенклатура.НСИ_ТоварнаяКатегория,
	|	ОбъектыСкидокНоменклатура.Номенклатура.НСИ_Брендообъем,
	|	ОбъектыСкидокНоменклатура.Номенклатура
	|ИЗ
	|	ВТ_ТаблицаНоменклатура КАК ОбъектыСкидокНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПолнаяПоОбъекту.Проект
	|ПОМЕСТИТЬ ВТ_Проекты
	|ИЗ
	|	ВТ_ПолнаяПоОбъекту КАК ВТ_ПолнаяПоОбъекту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПолнаяПоОбъекту.Проект,
	|	ВТ_ПолнаяПоОбъекту.ТоварнаяКатегория
	|ПОМЕСТИТЬ ВТ_ТоварныеКатегории
	|ИЗ
	|	ВТ_ПолнаяПоОбъекту КАК ВТ_ПолнаяПоОбъекту
	|ГДЕ
	|	НЕ ВТ_ПолнаяПоОбъекту.ТоварнаяКатегория ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПолнаяПоОбъекту.Проект,
	|	ВТ_ПолнаяПоОбъекту.ТоварнаяКатегория,
	|	ВТ_ПолнаяПоОбъекту.Брендообъем
	|ПОМЕСТИТЬ ВТ_Брендообъемы
	|ИЗ
	|	ВТ_ПолнаяПоОбъекту КАК ВТ_ПолнаяПоОбъекту
	|ГДЕ
	|	НЕ ВТ_ПолнаяПоОбъекту.Брендообъем ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПолнаяПоОбъекту.Проект,
	|	ВТ_ПолнаяПоОбъекту.ТоварнаяКатегория,
	|	ВТ_ПолнаяПоОбъекту.Брендообъем,
	|	ВТ_ПолнаяПоОбъекту.Номенклатура
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_ПолнаяПоОбъекту КАК ВТ_ПолнаяПоОбъекту
	|ГДЕ
	|	НЕ ВТ_ПолнаяПоОбъекту.Номенклатура ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Проекты.Проект,
	|	ВТ_ТоварныеКатегории.ТоварнаяКатегория,
	|	ВТ_Брендообъемы.Брендообъем,
	|	ВТ_Номенклатура.Номенклатура
	|ПОМЕСТИТЬ ВТ_ПолнаяСвернутая
	|ИЗ
	|	ВТ_Проекты КАК ВТ_Проекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварныеКатегории КАК ВТ_ТоварныеКатегории
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Брендообъемы КАК ВТ_Брендообъемы
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|				ПО ВТ_Брендообъемы.Брендообъем = ВТ_Номенклатура.Брендообъем
	|			ПО ВТ_ТоварныеКатегории.ТоварнаяКатегория = ВТ_Брендообъемы.ТоварнаяКатегория
	|		ПО ВТ_Проекты.Проект = ВТ_ТоварныеКатегории.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Проект КАК Проект,
	|	Номенклатура.НСИ_ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	Номенклатура.НСИ_Брендообъем КАК Брендообъем,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.СтатусСКЮ
	|ПОМЕСТИТЬ ВТ_КлассификацияНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.СтатусСКЮ <> &СтатусСКЮЗакрыт
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ГотоваяПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолнаяСвернутая.Проект КАК Проект,
	|	ВТ_ПолнаяСвернутая.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ВТ_ПолнаяСвернутая.Брендообъем КАК Брендообъем,
	|	ВТ_КлассификацияНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_КлассификацияНоменклатуры.СтатусСКЮ
	|ИЗ
	|	ВТ_ПолнаяСвернутая КАК ВТ_ПолнаяСвернутая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлассификацияНоменклатуры КАК ВТ_КлассификацияНоменклатуры
	|		ПО ВТ_ПолнаяСвернутая.Проект = ВТ_КлассификацияНоменклатуры.Проект
	|			И (ЕСТЬNULL(ВТ_ПолнаяСвернутая.ТоварнаяКатегория, ВТ_КлассификацияНоменклатуры.ТоварнаяКатегория) = ВТ_КлассификацияНоменклатуры.ТоварнаяКатегория)
	|			И (ЕСТЬNULL(ВТ_ПолнаяСвернутая.Брендообъем, ВТ_КлассификацияНоменклатуры.Брендообъем) = ВТ_КлассификацияНоменклатуры.Брендообъем)
	|			И (ЕСТЬNULL(ВТ_ПолнаяСвернутая.Номенклатура, ВТ_КлассификацияНоменклатуры.Номенклатура) = ВТ_КлассификацияНоменклатуры.Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Проект,
	|	ТоварнаяКатегория,
	|	Брендообъем,
	|	Номенклатура";
	
	АП_НастройкиПодсистемы = РегистрыСведений.АП_НастройкаПодсистемыПродаж.Выбрать();
	мСтатусГПЗакрыт = Справочники.ПРГ_СтатусыНоменклатуры.ПустаяСсылка();
	Если АП_НастройкиПодсистемы.Следующий() Тогда	
		мСтатусГПЗакрыт = АП_НастройкиПодсистемы.СтатусГПЗакрыт;	
	КонецЕсли;
	
	//Запрос.УстановитьПараметр("ОбъектСкидки",ОбъектСкидки);
	Запрос.УстановитьПараметр("ТаблицаПроекты",ТаблицаПроекты);
	Запрос.УстановитьПараметр("ТаблицаТоварныеКатегории",ТаблицаТоварныеКатегории);
	Запрос.УстановитьПараметр("ТаблицаБрендообъемы",ТаблицаБрендообъемы);
	Запрос.УстановитьПараметр("ТаблицаНоменклатура",ТаблицаНоменклатура);
	Запрос.УстановитьПараметр("ГотоваяПродукция",Справочники.Номенклатура.НайтиПоНаименованию("Готовая продукция"));
	Запрос.УстановитьПараметр("СтатусСКЮЗакрыт",мСтатусГПЗакрыт);
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	ПолнаяНоменклатура.Загрузить(ТаблицаНоменклатуры);
	
	КонецЕсли;
	
КонецПроцедуры	