
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Затраты.Итог("Сумма") <> ЗатратыНаПродукцию.Итог("Сумма") Тогда 
		Отказ = Истина;
		Сообщить("отличаются итоговые суммы затрат и затрат на продукцию", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	//Для Каждого л
	
	
	Если Движения.НезавершенноеПроизводствоМеждународныйУчет.Модифицированность() Тогда 
		Движения.НезавершенноеПроизводствоМеждународныйУчет.Записать();
	КонецЕсли;
	Если Движения.Международный.Модифицированность() Тогда 
		Движения.Международный.Записать();
	КонецЕсли;
	
КонецПроцедуры
