////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ДанныеАвтоматическогоЗаполненияПодготовлены(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтролируемыеСделкиОрганизаций.Регистратор
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция УведомлениеЗаполнено(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &Уведомление
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПодготовитьДанныеАвтоматическогоЗаполнения(Уведомление) Экспорт
	
	МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);
	
	ТаблицаСделок = ПолучитьТаблицуСделок();
	
	ТаблицаСделок.Очистить();
	ДобавитьСделкиРеализацииТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиРеализацииОтгруженныхТоваров(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияДопРасходов(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиРеализацииУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПолученияУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиАктаОбОказанииУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияТоваровУслугВНТТ(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПередачиОС(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПередачиНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомитентуОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомиссионераОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровПоставщику(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровОтПокупателя(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиКорректировкиРеализации(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиКорректировкиПоступления(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ТаблицаСделок.Колонки.Добавить("Уведомление", Новый ОписаниеТипов("ДокументСсылка.УведомлениеОКонтролируемыхСделках"));
	ТаблицаСделок.ЗаполнитьЗначения(Уведомление, "Уведомление");
	
	КонтролируемыеСделкиНаборЗаписей = РегистрыНакопления.КонтролируемыеСделкиОрганизаций.СоздатьНаборЗаписей();
	КонтролируемыеСделкиНаборЗаписей.Отбор.Регистратор.Значение = Уведомление;

	КонтролируемыеСделкиНаборЗаписей.Загрузить(ТаблицаСделок);
	
	НачатьТранзакцию();
	КонтролируемыеСделкиНаборЗаписей.Записать();
	ОбъектУведомление = Уведомление.ПолучитьОбъект();
	ОбъектУведомление.ДатаФормированияСпискаСделок = ТекущаяДатаСеанса();
	ОбъектУведомление.Записать();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СформироватьКонтролируемыеСделкиУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	
	ТаблицаЛистов1А = ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.Уведомление КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемыеСделки.ПериодСделки КАК ДатаСовершенияСделки,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.Контрагент КАК Контрагент,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.СделкаСНезависимымПосредником КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	КонтролируемыеСделки.СуммаБезНДСВРублях КАК Стоимость,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК Строка135СделкаСРезидентомОЭЗ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ КАК КодНаименованияСделки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)) КАК СпособОпределенияЦеныСделки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """") КАК КодУсловийПоставки,
	|	КонтролируемыеСделки.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемыеСделки.ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделки.ТипКонтролируемойСделки КАК ТипСделки,
	|	КонтролируемыеСделки.Грузоотправитель,
	|	КонтролируемыеСделки.Грузополучатель,
	|	КонтролируемыеСделки.Валюта,
	|	КонтролируемыеСделки.РасчетныйДокумент,
	|	КонтролируемыеСделки.Количество,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоТНВЭД, """") КАК КодТНВЭД,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКП, """") КАК КодОКП,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКВЭД, """") КАК КодОКВЭД,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки КАК СтранаПроисхожденияПредметаСделки
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОбщейСумме КАК КонтрагентыКонтролируемыеПоОбщейСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоНДПИ КАК КонтрагентыКонтролируемыеПоНДПИ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоСпецРежиму КАК КонтрагентыКонтролируемыеПоСпецРежиму
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоПрибыли КАК КонтрагентыКонтролируемыеПоПрибыли
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОЭЗ КАК КонтрагентыКонтролируемыеПоОЭЗ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделки.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделки.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.ПредметСделки = ПредметыКонтролируемыхСделок.ПредметСделки
	|ГДЕ
	|	КонтролируемыеСделки.ГоловнойКонтрагент В
	|			(ВЫБРАТЬ
	|				КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|			ИЗ
	|				КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме)
	|	И (КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ИЛИ КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|				И НЕ КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ГоловнойКонтрагент,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметСделки,
	|	Строка121СтороныВзаимозависимыПоКодексу,
	|	Строка122СделкаВОбластиВнешнейТорговли,
	|	Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	Строка124СделкаСНезависимымПосредником,
	|	Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	Строка132СделкаСПлательщикомНДПИ,
	|	Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	Строка135СделкаСРезидентомОЭЗ,
	|	КодНаименованияСделки,
	|	ТипВзаимозависимости,
	|	ТипПредметаСделки,
	|	НаименованиеПредметаСделки,
	|	ТипСделки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	КлючСделки = Новый Структура("Контрагент, ДоговорКонтрагента, ПредметСделки, Строка121СтороныВзаимозависимыПоКодексу, 
			|Строка122СделкаВОбластиВнешнейТорговли, Строка123СделкаСКонтрагентомСЛьготнымНалогообложением, 
			|Строка124СделкаСНезависимымПосредником, Строка131СуммаДоходовПоСделкамПревышаетПредел, Строка132СделкаСПлательщикомНДПИ,
			|Строка133СделкаСКонтрагентомНаСпецрежимах, Строка134СделкаСПлательщикомНалогаНаПрибыль,
			|Строка135СделкаСРезидентомОЭЗ, ТипВзаимозависимости, ТипПредметаСделки, НаименованиеПредметаСделки, КодНаименованияСделки, ТипСделки");
	
	СтруктураКлючевыхПолей = Новый Структура();
	СтруктураКлючевыхПолей.Вставить("РасчетныйДокумент");
	СтрокаСверткиТаблицыСделок = "";
	Для Каждого РеквизитСделки Из Метаданные.Документы.КонтролируемаяСделка.ТабличныеЧасти.Сделки.Реквизиты Цикл
		Если РеквизитСделки.Имя <> "Количество" И РеквизитСделки.Имя <> "Стоимость" Тогда
			СтруктураКлючевыхПолей.Вставить(РеквизитСделки.Имя);
			СтрокаСверткиТаблицыСделок = СтрокаСверткиТаблицыСделок 
				+ ?(СтрокаСверткиТаблицыСделок = "","",", ") + РеквизитСделки.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ГруппироватьСделкиСОдинаковойЦеной") Тогда
		СтруктураКлючевыхПолей.Удалить("ДатаСовершенияСделки");
		СтруктураКлючевыхПолей.Удалить("РасчетныйДокумент");
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций;
	
	ТаблицаСделокЛиста1А = Документы.КонтролируемаяСделка.ПустаяСсылка().Сделки.Выгрузить();
	ТаблицаСделокЛиста1А.Колонки.Добавить("РасчетныйДокумент", МетаданныеРегистра.Измерения.РасчетныйДокумент.Тип);
	ТекущийНомерЛиста1А = 1;
	
	ДокументСделки = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если ДокументСделки = Неопределено ИЛИ
			НЕ КлючСделкиСовпадает(Выборка, КлючСделки) Тогда
			
			ЗаполнитьЗначенияСвойств(КлючСделки, Выборка);
			
			Если ДокументСделки <> Неопределено Тогда
				ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
				ДокументСделки.Записать();
				ТаблицаСделокЛиста1А.Очистить();
				ДокументСделки = Неопределено;
				ТекущийНомерЛиста1А = ТекущийНомерЛиста1А + 1;
			КонецЕсли;
			
			Отбор = Новый Структура("Контрагент, ДоговорКонтрагента, ПредметСделки, Используется",
				КлючСделки.Контрагент, КлючСделки.ДоговорКонтрагента, КлючСделки.ПредметСделки, Ложь);
			ДокументыСделок = ТаблицаЛистов1А.НайтиСтроки(Отбор);
			Если ДокументыСделок.Количество()>0 Тогда
				Для Каждого СтрокаДокументовСделок Из ДокументыСделок Цикл
					Если КлючСделкиСовпадает(СтрокаДокументовСделок, КлючСделки) Тогда
						ДокументСделки = СтрокаДокументовСделок.Сделка.ПолучитьОбъект();
						ДокументСделки.ПометкаУдаления = Ложь;
						СтрокаДокументовСделок.Используется = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокументСделки = Неопределено Тогда
				ДокументСделки = Документы.КонтролируемаяСделка.СоздатьДокумент();
				ДокументСделки.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			
			ДокументСделки.Номер = ТекущийНомерЛиста1А;
			ЗаполнитьЗначенияСвойств(ДокументСделки, Выборка);
			
			СписокКодовСтороныСделки = КонтролируемыеСделкиПовтИсп.ПолучитьСоответствиеКодовСтороныСделки().Получить(Выборка.КодНаименованияСделки);
			Если СписокКодовСтороныСделки.Количество() = 1 Тогда
				ДокументСделки.КодСтороныСделки = СписокКодовСтороныСделки[0].Значение;
			ИначеЕсли СписокКодовСтороныСделки.Количество() > 1 Тогда
				ДокументСделки.КодСтороныСделки = ?(Выборка.ТипСделки = Перечисления.ТипыКонтролируемыхСделок.ПолученДоход, СписокКодовСтороныСделки[0].Значение, СписокКодовСтороныСделки[1].Значение);
			КонецЕсли;
			ДокументСделки.КомментарийКПункту7 = "";
			ДокументСделки.СуммаДоходов = 0;
			ДокументСделки.СуммаДоходовРегулируемых = 0;
			ДокументСделки.СуммаРасходов = 0;
			ДокументСделки.СуммаРасходовРегулируемых = 0;
			
			ДокументСделки.Сделки.Очистить();
			
		КонецЕсли;
		
		НоваяСделка = ТаблицаСделокЛиста1А.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСделка, Выборка);
		ЗаполнитьАдресаСделки(НоваяСделка, Выборка.Грузоотправитель, Выборка.Грузополучатель);
	КонецЦикла;
	
	Если ДокументСделки <> Неопределено Тогда
		ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
		ДокументСделки.Записать();
		ДокументСделки = Неопределено;
	КонецЕсли;
	
	ОбъектУведомление = Уведомление.ПолучитьОбъект();
	ОбъектУведомление.ДатаЗаполненияУведомления = ТекущаяДатаСеанса();
	ОбъектУведомление.Записать();
	
КонецПроцедуры

Функция ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОбщейСуммыСделок,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокНДПИ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокСпецРежим,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокПрибыль,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокОЭЗ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокИностранныхНезависимыхЛиц,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МинимальнаяГраницаДляВключенияСделокВУведомление
	|ИЗ
	|	РегистрСведений.ГраницыКонтролируемостиСделок.СрезПоследних(КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД), ) КАК ГраницыКонтролируемостиСделокСрезПоследних";
	
	ГраницыКонтролируемостиСделок = Новый Структура("ГраницаОбщейСуммыСделок, ГраницаСуммыСделокНДПИ, ГраницаСуммыСделокСпецРежим, 
		|ГраницаСуммыСделокПрибыль, ГраницаСуммыСделокОЭЗ, ГраницаСуммыСделокИностранныхНезависимыхЛиц, МинимальнаяГраницаДляВключенияСделокВУведомление", 0, 0, 0, 0, 0, 0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ГраницыКонтролируемостиСделок, Выборка);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Параметры.Вставить("Организация", ПараметрыУведомления.Организация);
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	Запрос.Параметры.Вставить("ГраницаОбщейСуммыСделок", ГраницыКонтролируемостиСделок.ГраницаОбщейСуммыСделок);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокНДПИ",  ГраницыКонтролируемостиСделок.ГраницаСуммыСделокНДПИ);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокСпецРежим", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокСпецРежим);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокПрибыль", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокПрибыль);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокОЭЗ", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокОЭЗ);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокИностранныхНезависимыхЛиц", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокИностранныхНезависимыхЛиц);
	Запрос.Параметры.Вставить("МинимальнаяГраницаДляВключенияСделокВУведомление", ГраницыКонтролируемостиСделок.МинимальнаяГраницаДляВключенияСделокВУведомление);
	Запрос.Параметры.Вставить("УчитыватьСпецрежимДляПосредников", ?(ПараметрыУведомления.ОтчетныйГод < Дата(2014,1,1), Ложь, Истина));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ОтчетныйГод КАК Период,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ПОМЕСТИТЬ УчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ОтчетныйГод, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Период,
	|	УчетнаяПолитикаОрганизаций.Организация,
	|	УчетнаяПолитикаОрганизаций.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И УчетнаяПолитикаОрганизаций.Период > &ОтчетныйГод
	|	И УчетнаяПолитикаОрганизаций.Период <= КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитика.Период КАК НачалоПериода,
	|	УчетнаяПолитика.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(УчетнаяПолитика1.Период, КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД))), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				И Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлательщикНалогаНаПрибыль
	|ПОМЕСТИТЬ УчетнаяПолитикаПоПериодам
	|ИЗ
	|	УчетнаяПолитика КАК УчетнаяПолитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитика КАК УчетнаяПолитика1
	|		ПО УчетнаяПолитика.Организация = УчетнаяПолитика1.Организация
	|			И УчетнаяПолитика.Период < УчетнаяПолитика1.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО УчетнаяПолитика.Организация = Организации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетнаяПолитика.Организация,
	|	УчетнаяПолитика.Период,
	|	УчетнаяПолитика.СистемаНалогообложения,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				И Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода,
	|	ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УчетнаяПолитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеКонтрагенты.Контрагент КАК Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаРегистрации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|				ИЛИ ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентЗарегистрированВРФ,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ УчастникиКонтролируемыхСделок
	|ИЗ
	|	КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО (УчастникиКонтролируемыхСделок.Контрагент = КонтролируемыеКонтрагенты.Контрагент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УведомлениеОКонтролируемыхСделках.Организация КАК Организация,
	|	УведомлениеОКонтролируемыхСделках.Ссылка КАК Уведомление,
	|	КонтролируемыеСделкиОрганизаций.Период КАК ПериодСделки,
	|	УведомлениеОКонтролируемыхСделках.ОтчетныйГод,
	|	КонтролируемыеСделкиОрганизаций.Контрагент КАК Контрагент,
	|	УчастникиКонтролируемыхСделок.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемыеСделкиОрганизаций.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделкиОрганизаций.СуммаБезНДСВРублях КАК СуммаБезНДСВРублях,
	|	УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаПоПериодам.ПлательщикНалогаНаПрибыль <> ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомНалогаНаПрибыль, ЛОЖЬ)
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредметыКонтролируемыхСделок.ЯвляетсяТоваромМировойБиржевойТорговли, ЛОЖЬ)
	|				И НЕ УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				И ЕСТЬNULL(ПредметыКонтролируемыхСделок.ОблагаетсяНДПИПоПроцентнойСтавке, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНДПИ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ЗарегистрированВОЭЗ, ЛОЖЬ) <> ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЗарегистрированВОЭЗ, ЛОЖЬ)
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемыеСделкиОрганизаций.ОперацияОблагаетсяЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|					И ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СделкаОблагаетсяЕНВД, ЛОЖЬ)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомЕСХН, ЛОЖЬ)
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСПлательщикомЕСХН,
	|	ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) КАК ТипВзаимозависимости,
	|	КонтролируемыеСделкиОрганизаций.ТипПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ЕдиницаИзмерения,
	|	КонтролируемыеСделкиОрганизаций.СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки,
	|	КонтролируемыеСделкиОрганизаций.Грузоотправитель,
	|	КонтролируемыеСделкиОрганизаций.Грузополучатель,
	|	КонтролируемыеСделкиОрганизаций.НаименованиеПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.Валюта,
	|	КонтролируемыеСделкиОрганизаций.Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСНезависимымПосредником
	|ПОМЕСТИТЬ КонтролируемыеСделки
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОКонтролируемыхСделках КАК УведомлениеОКонтролируемыхСделках
	|		ПО КонтролируемыеСделкиОрганизаций.Уведомление = УведомлениеОКонтролируемыхСделках.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаПоПериодам КАК УчетнаяПолитикаПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = УчетнаяПолитикаПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= УчетнаяПолитикаПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= УчетнаяПолитикаПоПериодам.ОкончаниеПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = ВзаимозависимыеЛицаПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.Период >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам КАК СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.ПредметСделки = ПредметыКонтролируемыхСделок.ПредметСделки
	|ГДЕ
	|	УведомлениеОКонтролируемыхСделках.Ссылка = &Уведомление
	|	И КонтролируемыеСделкиОрганизаций.Уведомление = &Уведомление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыПоМинимальнойСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) > &МинимальнаяГраницаДляВключенияСделокВУведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОбщейСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаОбщейСуммыСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоНДПИ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокНДПИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоСпецРежиму
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|			ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокСпецРежим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоПрибыли
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокПрибыль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОЭЗ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокОЭЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|			ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокИностранныхНезависимыхЛиц";
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоКонтролируемымСделкам() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтролируемаяСделка.Номер КАК НомерЛиста1А,
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке,
	|	КонтролируемаяСделка.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
	|			ТОГДА ""1""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости)
	|			ТОГДА ""2""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка100Взаимозависимость,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка121СтороныВзаимозависимыПоКодексу
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка122СделкаВОбластиВнешнейТорговли
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка124СделкаСНезависимымПосредником
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка131СуммаДоходовПоСделкамПревышаетПредел
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка132СделкаСПлательщикомНДПИ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка133СделкаСКонтрагентомНаСпецрежимах
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Cтрока134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка135СделкаСРезидентомОЭЗ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка135СделкаСРезидентомОЭЗ,
	|	КонтролируемаяСделка.КодНаименованияСделки КАК Строка210КодНаименованияСделки,
	|	КонтролируемаяСделка.КодСтороныСделки КАК Строка211КодСтороныСделки,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СпособОпределенияЦеныСделки.ЦенаЯвляетсяРегулируемой
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка220ПризнакОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКПризнакуОпределенияЦеныСделки, """") КАК Строка220_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки, """") = """"
	|			ТОГДА ""0""
	|		ИНАЧЕ КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки
	|	КОНЕЦ КАК Строка230КодОпределенияЦены,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийККодуОпределенияЦеныСделки, """") КАК Строка230_1Комментарий,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодМетодаЦенообразования, """") КАК Строка240КодМетодовЦенообразования,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКМетодуЦенообразования, """") КАК Строка240_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации251, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка251,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации252, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка252,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации253, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка253,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации254, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка254,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации255, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка255,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации256, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка256,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации257, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка257,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации258, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка258,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации259, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка259,
	|	2 КАК Строка260КоличествоУчастниковСделки,
	|	КонтролируемаяСделка.КомментарийКПункту7 КАК Строка260_1Комментарий,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходов КАК ЧИСЛО(15, 0)) КАК Строка300СуммаДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка301СуммаРегулируемыхДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходов КАК ЧИСЛО(15, 0)) КАК Строка310СуммаРасходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка311СуммаРегулируемыхРасходов,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|			ТОГДА Контрагенты.ГоловнойКонтрагент
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	Контрагенты.ЮрФизЛицо КАК ТипКонтрагента,
	|	КонтролируемаяСделка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемаяСделка.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемаяСделка.КодТНВЭД КАК КодТНВЭД,
	|	КонтролируемаяСделка.КодОКП КАК КодОКП,
	|	КонтролируемаяСделка.КодОКВЭД КАК КодОКВЭД,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|				И КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|		ИНАЧЕ КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки
	|ПОМЕСТИТЬ Листы1А
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтролируемаяСделка.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &УведомлениеОКонтролируемойСделке
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемаяСделкаСделки.Ссылка КАК Сделка,
	|	Листы1А.НомерЛиста1А КАК НомерЛиста1А,
	|	КонтролируемаяСделкаСделки.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА 1
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|			ТОГДА 2
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|			ТОГДА 3
	|	КОНЕЦ КАК Строка020ТипПредмета,
	|	Листы1А.НаименованиеПредметаСделки КАК Строка030НаименованиеПредмета,
	|	Листы1А.КодТНВЭД КАК Строка040КодПоТНВЭД,
	|	Листы1А.КодОКП КАК Строка043КодПоОКП,
	|	Листы1А.КодОКВЭД КАК Строка045КодОКВЭД,
	|	Листы1А.Контрагент КАК Контрагент,
	|	Листы1А.ДоговорКонтрагента.Номер КАК Строка060НомерДоговора,
	|	Листы1А.ДоговорКонтрагента.Дата КАК Строка065ДатаДоговора,
	|	ЕСТЬNULL(Листы1А.СтранаПроисхожденияПредметаСделки.Код, """") КАК Строка070КодСтраныПроисхождения,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаОтправкиТовара.Код, """") КАК Строка080КодСтраныОтправки,
	|	КонтролируемаяСделкаСделки.КодРегионаОтправкиТовара КАК Строка080КодРегионаОтправки,
	|	КонтролируемаяСделкаСделки.ГородОтправкиТовара КАК Строка080ГородОтправки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктОтправкиТовара КАК Строка080НаселенныйПунктОтправки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаСовершенияСделки.Код, """") КАК Строка090КодСтраныСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодРегионаСовершенияСделки КАК Строка090КодРегионаСовершенияСделки,
	|	КонтролируемаяСделкаСделки.ГородСовершенияСделки КАК Строка090ГородСовершенияСделки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктСовершенияСделки КАК Строка090НаселенныйПунктСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодУсловийПоставки КАК Строка100КодУсловийПоставки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.ЕдиницаИзмерения.Код, """") КАК Строка110КодЕдиницыИзмерения,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Количество КАК ЧИСЛО(15, 0)) КАК Строка120Количество,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Цена КАК ЧИСЛО(15, 0)) КАК Строка130Цена,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Стоимость КАК ЧИСЛО(15, 0)) КАК Строка140Стоимость,
	|	КонтролируемаяСделкаСделки.ДатаСовершенияСделки КАК Строка150ДатаСовершения,
	|	Листы1А.ТипКонтрагента КАК ТипКонтрагента
	|ПОМЕСТИТЬ Листы1Б
	|ИЗ
	|	Документ.КонтролируемаяСделка.Сделки КАК КонтролируемаяСделкаСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Листы1А КАК Листы1А
	|		ПО КонтролируемаяСделкаСделки.Ссылка = Листы1А.Сделка
	|ГДЕ
	|	КонтролируемаяСделкаСделки.Ссылка В
	|			(ВЫБРАТЬ
	|				Листы1А.Сделка
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Строка020ТипОрганизации,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ УчастникиКонтролируемыхСделок.СтранаРегистрации.Код
	|	КОНЕЦ КАК Строка030КакКодСтраныРегистрации,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК Строка040Наименование,
	|	Контрагенты.ИНН КАК Строка050ИНН,
	|	Контрагенты.КПП КАК Строка060КПП,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.РегистрационныйНомерВСтранеРегистрации, """") КАК Строка070РегНомерВСтрокеРегистрации,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодНалогоплательщикаВСтранеРегистрации, """") КАК Строка080КодНалогВСтранеРегистрации,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Строка090АдресИностраннойОрганизации
	|ПОМЕСТИТЬ Раздел2
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО Контрагенты.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Листы1А.Контрагент
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица, """") КАК Строка020КодВидаДеятельности,
	|	Контрагенты.ИНН КАК Строка030ИНН,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ГражданствоФизЛиц.Страна КАК ГражданствоФизЛицСтрана,
	|	КонтактнаяИнформация.Поле1 КАК КонтактнаяИнформацияПоле1,
	|	КонтактнаяИнформация.Поле2 КАК КонтактнаяИнформацияПоле2,
	|	КонтактнаяИнформация.Поле3 КАК КонтактнаяИнформацияПоле3,
	|	КонтактнаяИнформация.Поле4 КАК КонтактнаяИнформацияПоле4,
	|	КонтактнаяИнформация.Поле5 КАК КонтактнаяИнформацияПоле5,
	|	КонтактнаяИнформация.Поле6 КАК КонтактнаяИнформацияПоле6,
	|	КонтактнаяИнформация.Поле7 КАК КонтактнаяИнформацияПоле7,
	|	КонтактнаяИнформация.Поле8 КАК КонтактнаяИнформацияПоле8,
	|	КонтактнаяИнформация.Поле9 КАК КонтактнаяИнформацияПоле9,
	|	КонтактнаяИнформация.Поле10 КАК КонтактнаяИнформацияПоле10,
	|	КонтактнаяИнформация.Представление КАК КонтактнаяИнформацияПредставление,
	|	КонтактнаяИнформацияЗаРФ.Поле1 КАК КонтактнаяИнформацияЗаРФПоле1,
	|	КонтактнаяИнформацияЗаРФ.Представление КАК КонтактнаяИнформацияЗаРФПредставление,
	|	ПаспортныеДанныеФизЛиц.ДокументВид,
	|	ПаспортныеДанныеФизЛиц.ДокументСерия,
	|	ПаспортныеДанныеФизЛиц.ДокументНомер,
	|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи,
	|	ФИОФизЛиц.Фамилия,
	|	ФИОФизЛиц.Имя,
	|	ФИОФизЛиц.Отчество
	|ПОМЕСТИТЬ Раздел3
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ГражданствоФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформация.Объект)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЗаРФ
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияЗаРФ.Объект)
	|			И (КонтактнаяИнформацияЗаРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияЗаРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ПаспортныеДанныеФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ПаспортныеДанныеФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ФИОФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ФИОФизЛиц.ФизЛицо)
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Листы1А.Контрагент
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)";
	
	Возврат(ТекстЗапроса);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДГОТОВКИ ДАННЫХ АВТОМАТИЧЕСКОГО ЗАПОЛНЕНИЯ

Процедура ЗаполнитьТаблицуСделокЛиста1А(Лист1А, ТаблицаСделок, СписокПолейСделки, СтруктураКлючевыхПолей)
	
	ТаблицаСделок.Свернуть(СписокПолейСделки + ", РасчетныйДокумент", "Количество, Стоимость");
	Для Каждого Сделка Из ТаблицаСделок Цикл
		Сделка.Цена = ?(Сделка.Количество = 0, Сделка.Стоимость, Сделка.Стоимость/Сделка.Количество);
	КонецЦикла;
	
	ТаблицаСделок.Сортировать("ДатаСовершенияСделки");
	
	Листы1Б = ТаблицаСделок.СкопироватьКолонки();
	
	СделкаДокумента = Неопределено;
	Для Каждого Сделка Из ТаблицаСделок Цикл
		Если (Сделка.Количество <> 0) ИЛИ (Сделка.Стоимость <> 0) Тогда
			
			Если СделкаДокумента = Неопределено 
				ИЛИ Лист1А.ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.Товар
				ИЛИ НЕ СделкиСовпадают(СделкаДокумента, Сделка, СтруктураКлючевыхПолей) Тогда
				СделкаДокумента = Листы1Б.Добавить();
				ЗаполнитьЗначенияСвойств(СделкаДокумента, Сделка, , "Количество, Стоимость");
			КонецЕсли;
			СделкаДокумента.Количество = СделкаДокумента.Количество + Сделка.Количество;
			СделкаДокумента.Стоимость = СделкаДокумента.Стоимость + Сделка.Стоимость;
			СделкаДокумента.ДатаСовершенияСделки = Сделка.ДатаСовершенияСделки;
		КонецЕсли;
	КонецЦикла;
	
	Лист1А.Сделки.Загрузить(Листы1Б);
	
КонецПроцедуры

Функция СделкиСовпадают(Сделка1, Сделка2, СтруктураКлючевыхПолей)
	
	Для Каждого Поле Из СтруктураКлючевыхПолей Цикл
		Если Сделка1[Поле.Ключ] <> Сделка2[Поле.Ключ] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление)
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаСрезПоследних.Организация КАК Организация,
	|	ВзаимозависимыеЛицаСрезПоследних.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаСрезПоследних.ЗарегистрированВОЭЗ
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаГоловныеКонтрагенты
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица.СрезПоследних(&НачалоПериода, Организация В (&СписокОрганизаций)) КАК ВзаимозависимыеЛицаСрезПоследних
	|ГДЕ
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛица.Период,
	|	ВзаимозависимыеЛица.Организация,
	|	ВзаимозависимыеЛица.Контрагент,
	|	ВзаимозависимыеЛица.ТипВзаимозависимости,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛица.ЗарегистрированВОЭЗ
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|ГДЕ
	|	ВзаимозависимыеЛица.Период > &НачалоПериода
	|	И ВзаимозависимыеЛица.Период <= &ОкончаниеПериода
	|	И ВзаимозависимыеЛица.Организация В(&СписокОрганизаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация КАК Организация,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент КАК ГоловнойКонтрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЗарегистрированВОЭЗ
	|ПОМЕСТИТЬ ВзаимозависимыеЛица
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация,
	|	Контрагенты.Ссылка,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЗарегистрированВОЭЗ
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент = Контрагенты.ГоловнойКонтрагент
	|			И (Контрагенты.ОбособленноеПодразделение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаПоПериодамВсе.Организация,
	|	ВзаимозависимыеЛицаПоПериодамВсе.НачалоПериода,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ОкончаниеПериода,
	|	ВзаимозависимыеЛицаПоПериодамВсе.Контрагент,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ГоловнойКонтрагент,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НевзаимозависимыйПосредник,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЗарегистрированВОЭЗ
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаПоПериодам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаимозависимыеЛица.Организация КАК Организация,
	|		ВзаимозависимыеЛица.НачалоПериода КАК НачалоПериода,
	|		КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(ВзаимозависимыеЛица1.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|		ВзаимозависимыеЛица.Контрагент КАК Контрагент,
	|		ВзаимозависимыеЛица.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|		ВзаимозависимыеЛица.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН КАК ЯвляетсяПлательщикомЕСХН,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|		ВзаимозависимыеЛица.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ
	|	ИЗ
	|		ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛица КАК ВзаимозависимыеЛица1
	|			ПО ВзаимозависимыеЛица.Организация = ВзаимозависимыеЛица1.Организация
	|				И ВзаимозависимыеЛица.Контрагент = ВзаимозависимыеЛица1.Контрагент
	|				И ВзаимозависимыеЛица.НачалоПериода < ВзаимозависимыеЛица1.НачалоПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаимозависимыеЛица.Организация,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|		ВзаимозависимыеЛица.ТипВзаимозависимости,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ,
	|		ВзаимозависимыеЛица.ЗарегистрированВОЭЗ,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД,
	|		ВзаимозависимыеЛица.НачалоПериода,
	|		ВзаимозависимыеЛица.Контрагент,
	|		ВзаимозависимыеЛица.ГоловнойКонтрагент) КАК ВзаимозависимыеЛицаПоПериодамВсе
	|ГДЕ
	|	ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВзаимозависимыеЛицаПоПериодамВсе.Организация,
	|	ВзаимозависимыеЛицаПоПериодамВсе.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.Организация КАК Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.ЗарегистрированВОЭЗ
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделок
	|ИЗ
	|	РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.СрезПоследних(&НачалоПериода, Организация В (&СписокОрганизаций)) КАК СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Период,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ
	|ИЗ
	|	РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок
	|ГДЕ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Период > &НачалоПериода
	|	И СведенияОбОрганизацииДляКонтролируемыхСделок.Период <= &ОкончаниеПериода
	|	И СведенияОбОрганизацииДляКонтролируемыхСделок.Организация В(&СписокОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода КАК НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделок1.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам
	|ИЗ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок1
	|		ПО СведенияОбОрганизацииДляКонтролируемыхСделок.Организация = СведенияОбОрганизацииДляКонтролируемыхСделок1.Организация
	|			И СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода < СведенияОбОрганизацииДляКонтролируемыхСделок1.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчастникиКонтролируемыхСделок.Контрагент,
	|	УчастникиКонтролируемыхСделок.Контрагент КАК ГоловнойКонтрагент,
	|	УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ИностранныеКонтрагенты
	|ИЗ
	|	РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|ГДЕ
	|	УчастникиКонтролируемыхСделок.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка,
	|	УчастникиКонтролируемыхСделок.Контрагент,
	|	УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ИЗ
	|	РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО УчастникиКонтролируемыхСделок.Контрагент = Контрагенты.ГоловнойКонтрагент
	|			И (Контрагенты.ОбособленноеПодразделение)
	|ГДЕ
	|	УчастникиКонтролируемыхСделок.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчастникиКонтролируемыхСделок.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредметыКонтролируемыхСделок.ПредметСделки КАК ПредметСделки
	|ПОМЕСТИТЬ ТоварыМировойБиржевойТорговли
	|ИЗ
	|	РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|ГДЕ
	|	ПредметыКонтролируемыхСделок.ЯвляетсяТоваромМировойБиржевойТорговли = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВзаимозависимыеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВзаимозависимыеЛицаГоловныеКонтрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеКонтрагенты.Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент
	|ПОМЕСТИТЬ КонтролируемыеКонтрагенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаимозависимыеЛицаПоПериодам.Контрагент КАК Контрагент,
	|		ВзаимозависимыеЛицаПоПериодам.ГоловнойКонтрагент КАК ГоловнойКонтрагент
	|	ИЗ
	|		ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ИностранныеКонтрагенты.Контрагент,
	|		ИностранныеКонтрагенты.ГоловнойКонтрагент
	|	ИЗ
	|		ИностранныеКонтрагенты КАК ИностранныеКонтрагенты) КАК КонтролируемыеКонтрагенты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КонтролируемыеКонтрагенты.Контрагент";
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление)
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.КонтролируемаяСделка"));
	ТаблицаСделок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	РеквизитыСделки = Метаданные.Документы.КонтролируемаяСделка.Реквизиты;
	Для Каждого Реквизит Из РеквизитыСделки Цикл
		ТаблицаСделок.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип));
	КонецЦикла;
	
	ДокументыСделок = Документы.КонтролируемаяСделка.Выбрать( , , Новый Структура("УведомлениеОКонтролируемойСделке", Уведомление));
	Пока ДокументыСделок.Следующий() Цикл
		ДокументСделка = ДокументыСделок.ПолучитьОбъект();
		СтрокаСделок = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделок, ДокументСделка);
		СтрокаСделок.Сделка = ДокументСделка.Ссылка;
		ДокументСделка.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	ТаблицаСделок.Индексы.Добавить("Контрагент, ДоговорКонтрагента, ПредметСделки, Используется");
	
	Возврат ТаблицаСделок;
	
КонецФункции

Функция КлючСделкиСовпадает(Сделка, КлючСделки) 
	
	Для Каждого Ключ Из КлючСделки Цикл
		Если Сделка[Ключ.Ключ] <> Ключ.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТаблицуСделок()
	
	ОписаниеТиповРасчетныхДокументов = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.РасчетныйДокумент.Тип;
	ОписаниеТиповПредметовСделки = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.ПредметСделки.Тип;
	ОписаниеГрузоотправителя = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузоотправитель.Тип;
	ОписаниеГрузополучателя  = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузополучатель.Тип;
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСделок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаСделок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаСделок.Колонки.Добавить("ДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаСделок.Колонки.Добавить("РасчетныйДокумент", ОписаниеТиповРасчетныхДокументов);
	ТаблицаСделок.Колонки.Добавить("ПредметСделки", ОписаниеТиповПредметовСделки);
	ТаблицаСделок.Колонки.Добавить("ТипПредметаСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПредметовКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("НаименованиеПредметаСделки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(512)));
	ТаблицаСделок.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСделок.Колонки.Добавить("СтранаПроисхожденияПредметаСделки", Новый ОписаниеТипов("СправочникСсылка.КлассификаторСтранМира"));
	ТаблицаСделок.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперацииКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаСделок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаСделок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаСделок.Колонки.Добавить("ЦенаВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВВалютеРасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВВалютеРасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("ТипКонтролируемойСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("ТоварМировойБиржевойТорговли", Новый ОписаниеТипов("Булево"));
	ТаблицаСделок.Колонки.Добавить("ОперацияОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	
	ТаблицаСделок.Колонки.Добавить("Грузоотправитель", ОписаниеГрузоотправителя);
	ТаблицаСделок.Колонки.Добавить("Грузополучатель", ОписаниеГрузополучателя);
	
	Возврат ТаблицаСделок;
	
КонецФункции

Процедура ЗаполнитьАдресаСделки(СтруктураАдресов, Грузоотправитель, Грузополучатель)
	
	ЗапросКонтактнойИнформации = Новый Запрос();
	ЗапросКонтактнойИнформации.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5,
	|	КонтактнаяИнформация.Поле6,
	|	КонтактнаяИнформация.Поле7,
	|	КонтактнаяИнформация.Поле8,
	|	КонтактнаяИнформация.Поле9,
	|	КонтактнаяИнформация.Поле10,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид В (&Виды)";
	
	
	ВидыКонтактнойИнформации = Новый Массив();
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	ЗапросКонтактнойИнформации.УстановитьПараметр("Виды", ВидыКонтактнойИнформации);
	
	Если Грузоотправитель <> Неопределено Тогда
		//Получим почтовый адрес грузоотправителя
		ЗапросКонтактнойИнформации.Параметры.Вставить("Объект", Грузоотправитель);
		ВыборкаАдреса = ЗапросКонтактнойИнформации.Выполнить().Выбрать();
		Если ВыборкаАдреса.Следующий() Тогда
			АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(ВыборкаАдреса);
			Если АдресРФ Тогда
				СтруктураАдресов.СтранаОтправкиТовара = Справочники.КлассификаторСтранМира.Россия;
				СтруктураАдресов.КодРегионаОтправкиТовара = РегламентированнаяОтчетность.КодРегионаПоНазванию(ВыборкаАдреса.Поле2);
				СтруктураАдресов.ГородОтправкиТовара  = ВыборкаАдреса.Поле4;
				СтруктураАдресов.НаселенныйПунктОтправкиТовара = ВыборкаАдреса.Поле5;
			Иначе
				СтруктураАдресов.СтранаОтправкиТовара = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(ВыборкаАдреса.Поле1));
				СтруктураАдресов.КодРегионаОтправкиТовара = "";
				СтруктураАдресов.ГородОтправкиТовара  = "";
				СтруктураАдресов.НаселенныйПунктОтправкиТовара = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Грузополучатель <> Неопределено Тогда
		//Получим почтовый адрес грузоотправителя
		ЗапросКонтактнойИнформации.Параметры.Вставить("Объект", Грузополучатель);
		ВыборкаАдреса = ЗапросКонтактнойИнформации.Выполнить().Выбрать();
		Если ВыборкаАдреса.Следующий() Тогда
			АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(ВыборкаАдреса);
			Если АдресРФ Тогда
				СтруктураАдресов.СтранаСовершенияСделки = Справочники.КлассификаторСтранМира.Россия;
				СтруктураАдресов.КодРегионаСовершенияСделки = РегламентированнаяОтчетность.КодРегионаПоНазванию(ВыборкаАдреса.Поле2);
				СтруктураАдресов.ГородСовершенияСделки  = ВыборкаАдреса.Поле4;
				СтруктураАдресов.НаселенныйПунктСовершенияСделки = ВыборкаАдреса.Поле5;
			Иначе
				СтруктураАдресов.СтранаСовершенияСделки = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(ВыборкаАдреса.Поле1));
				СтруктураАдресов.КодРегионаСовершенияСделки = "";
				СтруктураАдресов.ГородСовершенияСделки  = "";
				СтруктураАдресов.НаселенныйПунктСовершенияСделки = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемаяСделка, ТаблицаДокумента, КомиссионныеТовары)
	
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура("РасчетныйДокумент",КонтролируемаяСделка.РасчетныйДокумент) );
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		ТаблицаСделокДокумента = ПолучитьТаблицуСделок();
		ТаблицаСделокДокумента.Колонки.Добавить("ВключатьСоставСделок", Новый ОписаниеТипов("Булево"));
		
		Для Каждого ВыборкаСтрок Из НайденныеСтроки Цикл
			
			Количество = ?(ВыборкаСтрок.Количество=0, 1, ВыборкаСтрок.Количество);
			КоличествоВУчете = ВыборкаСтрок.КоличествоВУчете;
			СуммаБезНДС = ВыборкаСтрок.СуммаБезНДС;
			СуммаБезНДСВРублях = ?(КонтролируемаяСделка.РасчетыВВалюте, ВыборкаСтрок.СуммаБезНДСВРублях, ВыборкаСтрок.СуммаБезНДС);
			СуммаНДС = ВыборкаСтрок.СуммаНДС;
			СуммаНДСВРублях = ?(КонтролируемаяСделка.РасчетыВВалюте, ВыборкаСтрок.СуммаНДСВРублях, ВыборкаСтрок.СуммаНДС);
			
			Если КомиссионныеТовары <> Неопределено Тогда
				//получим количество комиссионного товара
				ОтборКомиссионныхТоваров = Новый Структура("Сделка, ПредметСделки, СерияНоменклатуры",
					ВыборкаСтрок.Сделка, ВыборкаСтрок.ПредметСделки, ВыборкаСтрок.СерияНоменклатуры);
				НайденыеТоварыКомитентов = КомиссионныеТовары.НайтиСтроки(ОтборКомиссионныхТоваров);
				
				//Проверяем на существование записи о продаже товаров комитента с ненулевым количеством
				//и знаком остатка, совпадающим со знаком сделки (не подходит случай, когда количество товаров комитента больше нуля, а количество товаров в сделке - больше нуля)
				Если НайденыеТоварыКомитентов.Количество()>0
					И НайденыеТоварыКомитентов[0].Количество <> 0
					И НайденыеТоварыКомитентов[0].Количество * КоличествоВУчете > 0 Тогда
					
					КоличествоКомиссионныхТоваров = ?(НайденыеТоварыКомитентов[0].Количество>0,
							Мин(НайденыеТоварыКомитентов[0].Количество, КоличествоВУчете),
							Макс(НайденыеТоварыКомитентов[0].Количество, КоличествоВУчете));
					
					Сделка = ТаблицаСделокДокумента.Добавить();
					Сделка.Период                     = КонтролируемаяСделка.Период;
					Сделка.Организация                = КонтролируемаяСделка.Организация;
					Сделка.Контрагент                 = КонтролируемаяСделка.Контрагент;
					Сделка.ДоговорКонтрагента         = КонтролируемаяСделка.ДоговорКонтрагента;
					Сделка.РасчетныйДокумент          = КонтролируемаяСделка.РасчетныйДокумент;
					Сделка.ПредметСделки              = ВыборкаСтрок.ПредметСделки;
					Сделка.ТипПредметаСделки          = ВыборкаСтрок.ТипПредметаСделки;
					Сделка.НаименованиеПредметаСделки = ВыборкаСтрок.НаименованиеПредметаСделки;
					Сделка.СтранаПроисхожденияПредметаСделки = ВыборкаСтрок.СтранаПроисхождения;
					Сделка.ВключатьСоставСделок       = Ложь;
					Сделка.ХозяйственнаяОперация      = ВыборкаСтрок.ХозяйственнаяОперация;
					Сделка.Валюта                     = КонтролируемаяСделка.ВалютаДокумента;
					Сделка.ЕдиницаИзмерения           = ВыборкаСтрок.ЕдиницаИзмеренияПоКлассификатору;
					Сделка.Количество                 = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * Количество, 2);
					Сделка.СтавкаНДС                  = ВыборкаСтрок.СтавкаНДС;
					Сделка.СуммаБезНДСВРублях         = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаБезНДСВРублях, 2);
					Сделка.СуммаНДСВРублях            = 0;
					Сделка.СуммаБезНДСВВалютеРасчетов = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаБезНДС, 2);
					Сделка.СуммаНДСВВалютеРасчетов    = 0;
					Сделка.ТипКонтролируемойСделки    = ВыборкаСтрок.ТипКонтролируемойСделки;
					Если ВыборкаСтрок.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
						Сделка.Грузоотправитель           = КонтролируемаяСделка.Грузоотправитель;
					КонецЕсли;
					Сделка.Грузополучатель            = КонтролируемаяСделка.Грузополучатель;
					Сделка.ТоварМировойБиржевойТорговли = ВыборкаСтрок.ТоварМировойБиржевойТорговли;
					Сделка.ОперацияОблагаетсяЕНВД     = ВыборкаСтрок.ОперацияОблагаетсяЕНВД;
					
					НайденыеТоварыКомитентов[0].Количество = НайденыеТоварыКомитентов[0].Количество - КоличествоКомиссионныхТоваров;
					Количество         = Количество - Сделка.Количество;
					СуммаБезНДС        = СуммаБезНДС - Сделка.СуммаБезНДСВВалютеРасчетов;
					СуммаБезНДСВРублях = СуммаБезНДСВРублях - Сделка.СуммаБезНДСВРублях;
					СуммаНДС           = СуммаНДС - Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаНДС, 2);
					СуммаНДСВРублях    = СуммаНДСВРублях - Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаНДСВРублях, 2);
				КонецЕсли;
			КонецЕсли;
			
			Если Количество<>0 ИЛИ СуммаБезНДС<>0 ИЛИ СуммаНДС<>0 ИЛИ СуммаБезНДСВРублях<> 0 ИЛИ СуммаНДСВРублях <> 0 Тогда
				Сделка = ТаблицаСделокДокумента.Добавить();
				Сделка.Период                     = КонтролируемаяСделка.Период;
				Сделка.Организация                = КонтролируемаяСделка.Организация;
				Сделка.Контрагент                 = КонтролируемаяСделка.Контрагент;
				Сделка.ДоговорКонтрагента         = КонтролируемаяСделка.ДоговорКонтрагента;
				Сделка.РасчетныйДокумент          = КонтролируемаяСделка.РасчетныйДокумент;
				Сделка.ПредметСделки              = ВыборкаСтрок.ПредметСделки;
				Сделка.ТипПредметаСделки          = ВыборкаСтрок.ТипПредметаСделки;
				Сделка.НаименованиеПредметаСделки = ВыборкаСтрок.НаименованиеПредметаСделки;
				Сделка.СтранаПроисхожденияПредметаСделки = ВыборкаСтрок.СтранаПроисхождения;
				Сделка.ВключатьСоставСделок       = ВыборкаСтрок.ВключатьСоставСделок;
				Сделка.ХозяйственнаяОперация      = ВыборкаСтрок.ХозяйственнаяОперация;
				Сделка.Валюта                     = КонтролируемаяСделка.ВалютаДокумента;
				Сделка.ЕдиницаИзмерения           = ВыборкаСтрок.ЕдиницаИзмеренияПоКлассификатору;
				Сделка.Количество                 = Количество;
				Сделка.СтавкаНДС                  = ВыборкаСтрок.СтавкаНДС;
				Сделка.СуммаБезНДСВРублях         = СуммаБезНДСВРублях;
				Сделка.СуммаНДСВРублях            = СуммаНДСВРублях;
				Сделка.СуммаБезНДСВВалютеРасчетов = СуммаБезНДС;
				Сделка.СуммаНДСВВалютеРасчетов    = СуммаНДС;
				Сделка.ТипКонтролируемойСделки    = ВыборкаСтрок.ТипКонтролируемойСделки;
				Сделка.ТоварМировойБиржевойТорговли = ВыборкаСтрок.ТоварМировойБиржевойТорговли;
				Сделка.ОперацияОблагаетсяЕНВД     = ВыборкаСтрок.ОперацияОблагаетсяЕНВД;
				
				Если ВыборкаСтрок.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
					Сделка.Грузоотправитель           = КонтролируемаяСделка.Грузоотправитель;
				КонецЕсли;
				Сделка.Грузополучатель            = КонтролируемаяСделка.Грузополучатель;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СделкаДокумента Из ТаблицаСделокДокумента Цикл
			Если (СделкаДокумента.ТоварМировойБиржевойТорговли И КонтролируемаяСделка.ИностранныйКонтрагент)
					ИЛИ КонтролируемаяСделка.ВзаимозависимыеЛица
					ИЛИ КонтролируемаяСделка.ЗарегистрированВСтранеСЛьготнымНалогообложением Тогда
					Если СделкаДокумента.ВключатьСоставСделок
						И (СделкаДокумента.СуммаБезНДСВРублях <> 0
							ИЛИ СделкаДокумента.СуммаНДСВРублях <> 0
							ИЛИ СделкаДокумента.Количество <> 0) Тогда
					Сделка = ТаблицаСделок.Добавить();
					ЗаполнитьЗначенияСвойств(Сделка, СделкаДокумента);
					Сделка.ЦенаВРублях = Сделка.СуммаБезНДСВРублях / Сделка.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента)
	
	СделкиДокумента.Колонки.Добавить("СуммаБезНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	СделкиДокумента.Колонки.Добавить("СуммаНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого ДокументСделки Из РублевыеСуммыСделок Цикл
		
		ВсегоВРублях = ДокументСделки.ВсегоВРублях;
		СуммаНДСВРублях =ДокументСделки.СуммаНДСВРублях;
		
		СтрокиДокумента = СделкиДокумента.НайтиСтроки(Новый Структура("Сделка",ДокументСделки.Сделка));
		Если СтрокиДокумента.Количество() > 0 Тогда
			
			СуммыВсегоВВалюте = Новый Массив(СтрокиДокумента.Количество());
			СуммыНДСВВалюте   = Новый Массив(СтрокиДокумента.Количество());
			Для К=0 По СтрокиДокумента.Количество()-1 Цикл
				СуммыВсегоВВалюте[К] = СтрокиДокумента[К].СуммаБезНДС + СтрокиДокумента[К].СуммаНДС;
				СуммыНДСВВалюте[К]   = СтрокиДокумента[К].СуммаНДС;
			КонецЦикла;
			
			//Подсчитаем рублевые суммы документа
			РаспределениеСуммВсего = ОбщегоНазначения.РаспределитьПропорционально(ВсегоВРублях, СуммыВсегоВВалюте);
			РаспределениеСуммНДС   = ОбщегоНазначения.РаспределитьПропорционально(СуммаНДСВРублях, СуммыНДСВВалюте);
			
			Если РаспределениеСуммВсего <> Неопределено Тогда
				Для К=0 По СтрокиДокумента.Количество()-1 Цикл
					СуммаНДС = ?(РаспределениеСуммНДС = Неопределено,0, РаспределениеСуммНДС[К]);
					СтрокиДокумента[К].СуммаБезНДСВРублях = РаспределениеСуммВсего[К] - СуммаНДС;
					СтрокиДокумента[К].СуммаНДСВРублях = СуммаНДС;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСделкиРеализацииТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = РеализацияТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Сделка,
	|	РеализацияТоваровУслугТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.Коэффициент / РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО РеализацияТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг),
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиРеализацииОтгруженныхТоваров(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияОтгруженныхТоваров.Организация КАК Организация,
	|	РеализацияОтгруженныхТоваров.Дата КАК Период,
	|	РеализацияОтгруженныхТоваров.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументОтгрузки,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = РеализацияОтгруженныхТоваров.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияОтгруженныхТоваров.Контрагент)
	|			И РеализацияОтгруженныхТоваров.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияОтгруженныхТоваров.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияОтгруженныхТоваров.Контрагент)
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.Организация В(&СписокОрганизаций)
	|	И РеализацияОтгруженныхТоваров.Дата >= &НачалоПериода
	|	И РеализацияОтгруженныхТоваров.Дата <= &ОкончаниеПериода
	|	И РеализацияОтгруженныхТоваров.Проведен = ИСТИНА
	|	И РеализацияОтгруженныхТоваров.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияОтгруженныхТоваров.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК Сделка,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.Коэффициент / РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО РеализацияТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Сделка,
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	|	ПоступлениеТоваровУслугТовары.Количество * ПоступлениеТоваровУслугТовары.Коэффициент / ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг),
	|	ПоступлениеТоваровУслугУслуги.Количество,
	|	ПоступлениеТоваровУслугУслуги.Количество,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугОборудование.Номенклатура,
	|	ПоступлениеТоваровУслугОборудование.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров),
	|	ПоступлениеТоваровУслугОборудование.Количество,
	|	ПоступлениеТоваровУслугОборудование.Количество * ПоступлениеТоваровУслугОборудование.Коэффициент / ПоступлениеТоваровУслугОборудование.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ПоступлениеТоваровУслугОборудование.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугОборудование.Сумма - ПоступлениеТоваровУслугОборудование.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугОборудование.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугОборудование.СтавкаНДС,
	|	ПоступлениеТоваровУслугОборудование.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	ПоступлениеТоваровУслугОборудование.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугОборудование.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугОборудование.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугОборудование.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугОбъектыСтроительства.ОбъектСтроительства,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.ОбъектСтроительства.Наименование,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеОбъектовСтроительства),
	|	1,
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Сумма - ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугОбъектыСтроительства.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СтавкаНДС,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияДопРасходов(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеДопРасходов.Организация,
	|	ПоступлениеДопРасходов.Дата КАК Период,
	|	ПоступлениеДопРасходов.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеДопРасходов.Контрагент,
	|	ПоступлениеДопРасходов.Организация КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеДопРасходов.ВалютаДокумента,
	|	ПоступлениеДопРасходов.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПоступлениеДопРасходов.Содержание,
	|	ПоступлениеДопРасходов.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеДопРасходов.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеДопРасходов.Контрагент)
	|			И ПоступлениеДопРасходов.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеДопРасходов.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеДопРасходов.Контрагент)
	|ГДЕ
	|	ПоступлениеДопРасходов.Организация В(&СписокОрганизаций)
	|	И ПоступлениеДопРасходов.Дата >= &НачалоПериода
	|	И ПоступлениеДопРасходов.Дата <= &ОкончаниеПериода
	|	И ПоступлениеДопРасходов.Проведен = ИСТИНА
	|	И ПоступлениеДопРасходов.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеДопРасходов.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент КАК Сделка,
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеДополнительныхУслуг.Номенклатура КАК ПредметСделки,
	|	ПоступлениеДополнительныхУслуг.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	СУММА(ПоступлениеДополнительныхУслуг.Количество) КАК Количество,
	|	СУММА(ПоступлениеДополнительныхУслуг.Количество) КАК КоличествоВУчете,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) КАК ЕдиницаИзмеренияПоКлассификатору,
	|	СУММА(ПоступлениеДополнительныхУслуг.СуммаБезНДС) КАК СуммаБезНДС,
	|	ПоступлениеДополнительныхУслуг.СтавкаНДС,
	|	СУММА(ПоступлениеДополнительныхУслуг.СуммаНДС) КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеДопРасходов.Ссылка КАК РасчетныйДокумент,
	|		НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|		ПоступлениеДопРасходов.Содержание КАК Содержание,
	|		1 КАК Количество,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходов.Сумма - ПоступлениеДопРасходов.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходов.Сумма
	|		КОНЕЦ КАК СуммаБезНДС,
	|		ПоступлениеДопРасходов.СтавкаНДС КАК СтавкаНДС,
	|		ПоступлениеДопРасходов.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходов.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходов.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеДопРасходовТовары.Ссылка,
	|		НЕОПРЕДЕЛЕНО,
	|		ДокументыКонтролируемыхСделок.Содержание,
	|		0,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходовТовары.Сумма - ПоступлениеДопРасходовТовары.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходовТовары.Сумма
	|		КОНЕЦ,
	|		ДокументыКонтролируемыхСделок.СтавкаНДС,
	|		ПоступлениеДопРасходовТовары.СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходовТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходовТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеДопРасходовОборудование.Ссылка,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка),
	|		ДокументыКонтролируемыхСделок.Содержание,
	|		0,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходовОборудование.Сумма - ПоступлениеДопРасходовОборудование.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходовОборудование.Сумма
	|		КОНЕЦ,
	|		ДокументыКонтролируемыхСделок.СтавкаНДС,
	|		ПоступлениеДопРасходовОборудование.СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов.Оборудование КАК ПоступлениеДопРасходовОборудование
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходовОборудование.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходовОборудование.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)) КАК ПоступлениеДополнительныхУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент,
	|	ПоступлениеДополнительныхУслуг.Номенклатура,
	|	ПоступлениеДополнительныхУслуг.Содержание,
	|	ПоступлениеДополнительныхУслуг.СтавкаНДС,
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДобавитьСделкиРеализацииУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияУслугПоПереработке.Организация КАК Организация,
	|	РеализацияУслугПоПереработке.Дата КАК Период,
	|	РеализацияУслугПоПереработке.Ссылка КАК РасчетныйДокумент,
	|	РеализацияУслугПоПереработке.Контрагент КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПоПереработке.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПоПереработке.Контрагент
	|		ИНАЧЕ РеализацияУслугПоПереработке.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияУслугПоПереработке.ВалютаДокумента,
	|	РеализацияУслугПоПереработке.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = РеализацияУслугПоПереработке.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияУслугПоПереработке.Контрагент)
	|			И РеализацияУслугПоПереработке.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияУслугПоПереработке.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияУслугПоПереработке.Контрагент)
	|ГДЕ
	|	РеализацияУслугПоПереработке.Организация В(&СписокОрганизаций)
	|	И РеализацияУслугПоПереработке.Дата >= &НачалоПериода
	|	И РеализацияУслугПоПереработке.Дата <= &ОкончаниеПериода
	|	И РеализацияУслугПоПереработке.Проведен = ИСТИНА
	|	И РеализацияУслугПоПереработке.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияУслугПоПереработке.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработкеПродукция.Ссылка КАК Сделка,
	|	РеализацияУслугПоПереработкеПродукция.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияУслугПоПереработкеПродукция.Номенклатура КАК ПредметСделки,
	|	РеализацияУслугПоПереработкеПродукция.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	РеализацияУслугПоПереработкеПродукция.Количество,
	|	РеализацияУслугПоПереработкеПродукция.Количество КАК КоличествоВУчете,
	|	РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияУслугПоПереработкеПродукция.Сумма - РеализацияУслугПоПереработкеПродукция.СуммаНДС
	|		ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияУслугПоПереработкеПродукция.СтавкаНДС,
	|	РеализацияУслугПоПереработкеПродукция.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработкеПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияУслугПоПереработкеПродукция.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияУслугПоПереработкеПродукция.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияУслугПоПереработкеПродукция.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработкеУслуги.Ссылка,
	|	РеализацияУслугПоПереработкеУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура,
	|	РеализацияУслугПоПереработкеУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг),
	|	РеализацияУслугПоПереработкеУслуги.Количество,
	|	РеализацияУслугПоПереработкеУслуги.Количество,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	|	КОНЕЦ,
	|	РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	|	РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = РеализацияУслугПоПереработкеУслуги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО (РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет)
	|ГДЕ
	|	РеализацияУслугПоПереработкеУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиАктаОбОказанииУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.Организация КАК Организация,
	|	Акт.Дата КАК Период,
	|	Акт.Ссылка КАК РасчетныйДокумент,
	|	Акт.Контрагент КАК Контрагент,
	|	Акт.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Неопределено КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Акт.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Акт.Контрагент
	|		ИНАЧЕ Акт.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Акт.ВалютаДокумента,
	|	Акт.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	Акт.КурсВзаиморасчетов,
	|	Акт.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Акт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = Акт.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = Акт.Контрагент)
	|			И Акт.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И Акт.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = Акт.Контрагент)
	|ГДЕ
	|	Акт.Организация В(&СписокОрганизаций)
	|	И Акт.Дата >= &НачалоПериода
	|	И Акт.Дата <= &ОкончаниеПериода
	|	И Акт.Проведен = ИСТИНА
	|	И Акт.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И Акт.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК Сделка,
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура КАК ПредметСделки,
	|	АктОбОказанииПроизводственныхУслугУслуги.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество КАК КоличествоВУчете,
	|	АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	|		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО АктОбОказанииПроизводственныхУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНМА.Организация КАК Организация,
	|	ПоступлениеНМА.Дата КАК Период,
	|	ПоступлениеНМА.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеНМА.Контрагент КАК Контрагент,
	|	ПоступлениеНМА.Организация КАК Грузополучатель,
	|	ПоступлениеНМА.Контрагент КАК Грузоотправитель,
	|	ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеНМА.ВалютаДокумента,
	|	ПоступлениеНМА.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеНМА.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеНМА.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеНМА.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеНМА.Контрагент)
	|			И ПоступлениеНМА.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеНМА.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеНМА.Контрагент)
	|ГДЕ
	|	ПоступлениеНМА.Организация В(&СписокОрганизаций)
	|	И ПоступлениеНМА.Дата >= &НачалоПериода
	|	И ПоступлениеНМА.Дата <= &ОкончаниеПериода
	|	И ПоступлениеНМА.Проведен = ИСТИНА
	|	И ПоступлениеНМА.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеНМА.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеНМА.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка КАК Сделка,
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеНМАНематериальныеАктивы.НематериальныйАктив КАК ПредметСделки,
	|	ПоступлениеНМАНематериальныеАктивы.НематериальныйАктив.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеНематериальныхАктивов) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеНМАНематериальныеАктивы.Сумма - ПоступлениеНМАНематериальныеАктивы.СуммаНДС
	|		ИНАЧЕ ПоступлениеНМАНематериальныеАктивы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеНМАНематериальныеАктивы.СтавкаНДС,
	|	ПоступлениеНМАНематериальныеАктивы.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеНМА.НематериальныеАктивы КАК ПоступлениеНМАНематериальныеАктивы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеНМАНематериальныеАктивы.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПередачиОС(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаОС.Организация КАК Организация,
	|	ПередачаОС.Дата КАК Период,
	|	ПередачаОС.Ссылка КАК РасчетныйДокумент,
	|	ПередачаОС.Контрагент КАК Контрагент,
	|	ПередачаОС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПередачаОС.Организация
	|		ИНАЧЕ ПередачаОС.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПередачаОС.Контрагент
	|		ИНАЧЕ ПередачаОС.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ПередачаОС.ВалютаДокумента,
	|	ПередачаОС.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПередачаОС.КурсВзаиморасчетов,
	|	ПередачаОС.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПередачаОС.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаОС.Контрагент)
	|			И ПередачаОС.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаОС.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПередачаОС.Контрагент)
	|ГДЕ
	|	ПередачаОС.Организация В(&СписокОрганизаций)
	|	И ПередачаОС.Дата >= &НачалоПериода
	|	И ПередачаОС.Дата <= &ОкончаниеПериода
	|	И ПередачаОС.Проведен = ИСТИНА
	|	И ПередачаОС.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПередачаОС.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК РасчетныйДокумент,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаОСОС.Ссылка КАК Сделка,
	|	ПередачаОСОС.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ПередачаОСОС.ОсновноеСредство КАК ПредметСделки,
	|	ПередачаОСОС.ОсновноеСредство.Наименование КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияОсновныхСредств) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	|		ИНАЧЕ ПередачаОСОС.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПередачаОСОС.СтавкаНДС,
	|	ПередачаОСОС.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ПередачаОСОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаОСОС.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПередачаОСОС.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПередачиНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаНМА.Организация КАК Организация,
	|	ПередачаНМА.Дата КАК Период,
	|	ПередачаНМА.Ссылка КАК РасчетныйДокумент,
	|	ПередачаНМА.Контрагент КАК Контрагент,
	|	ПередачаНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПередачаНМА.Организация КАК Грузоотправитель,
	|	ПередачаНМА.Контрагент КАК Грузополучатель,
	|	ПередачаНМА.ВалютаДокумента,
	|	ПередачаНМА.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПередачаНМА.КурсВзаиморасчетов,
	|	ПередачаНМА.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаНМА КАК ПередачаНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПередачаНМА.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаНМА.Контрагент)
	|			И ПередачаНМА.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаНМА.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПередачаНМА.Контрагент)
	|ГДЕ
	|	ПередачаНМА.Организация В(&СписокОрганизаций)
	|	И ПередачаНМА.Дата >= &НачалоПериода
	|	И ПередачаНМА.Дата <= &ОкончаниеПериода
	|	И ПередачаНМА.Проведен = ИСТИНА
	|	И ПередачаНМА.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПередачаНМА.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаНМА.Ссылка КАК Сделка,
	|	ПередачаНМА.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ПередачаНМА.НематериальныйАктив КАК ПредметСделки,
	|	ПередачаНМА.НематериальныйАктив.Наименование КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияОсновныхСредств) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	|		ИНАЧЕ ПередачаНМА.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПередачаНМА.СтавкаНДС,
	|	ПередачаНМА.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПередачаНМА КАК ПередачаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаНМА.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПередачаНМА.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.СуммаВключаетНДС,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомитентуОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Дата КАК Период,
	|	ОтчетКомитентуОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Грузополучатель,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ОтчетКомитентуОПродажах.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомитентуОПродажах.Контрагент)
	|			И ОтчетКомитентуОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомитентуОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомитентуОПродажах.Контрагент)
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомитентуОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомитентуОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомитентуОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка КАК Сделка,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК ПредметСделки,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.СуммаБезНДС КАК СуммаБезНДС,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.СуммаНДС КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаБезНДС
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ОтчетКомитентуОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка) КАК ОтчетКомитентуОПродажахТоварыСгрупированный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ПО (ОтчетКомитентуОПродажах.Ссылка = ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО (ОтчетКомитентуОПродажах.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет)
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.Дата КАК Период,
	|	ОтчетКомиссионераОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионераОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ОтчетКомиссионераОПродажах.СчетУчетаРасчетовЗаПосредническиеУслуги КАК СчетУчетаРасчетов,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ОтчетКомиссионераОПродажах.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионераОПродажах.Контрагент)
	|			И ОтчетКомиссионераОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомиссионераОПродажах.Контрагент)
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомиссионераОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионераОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомиссионераОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент;";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка КАК Сделка,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ПредметСделки,
	|	""Комиссионное вознаграждение"" КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.СуммаБезНДС КАК СуммаБезНДС,
	|	ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.СуммаНДС КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОтчетКомиссионераОПродажахТовары.Ссылка КАК Ссылка,
	|		СУММА(ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		СУММА(ВЫБОР
	|				КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|					ТОГДА ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения - ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения
	|				ИНАЧЕ ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения
	|			КОНЕЦ) КАК СуммаБезНДС
	|	ИЗ
	|		Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ОтчетКомиссионераОПродажахТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомиссионераОПродажахТовары.Ссылка) КАК ОтчетКомиссионераОПродажахТоварыСгрупированный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ПО (ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка)
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";

	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровПоставщику(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК ДокументВозврата,
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыПоступленияИВозврата
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВозвратТоваровПоставщикуТовары.ДокументПоступления = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщику.Организация В(&СписокОрганизаций)
	|	И ВозвратТоваровПоставщику.Дата >= &НачалоПериода
	|	И ВозвратТоваровПоставщику.Проведен = ИСТИНА
	|	И ВозвратТоваровПоставщику.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВозвратТоваровПоставщику.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ВозвратТоваровПоставщикуТовары.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И ВозвратТоваровПоставщикуТовары.ДокументПоступления <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыПоступленияИВозврата.ДокументВозврата,
	|	ДокументыПоступленияИВозврата.СуммаВключаетНДС,
	|	ДокументыПоступленияИВозврата.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыВозврата
	|ИЗ
	|	ДокументыПоступленияИВозврата КАК ДокументыПоступленияИВозврата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыПоступленияИВозврата.ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыПоступленияИВозврата.ДокументПоступления
	|			ИЗ
	|				ДокументыПоступленияИВозврата КАК ДокументыПоступленияИВозврата)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		-НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Ссылка КАК Сделка,
	|	ВозвратТоваровПоставщикуТовары.ДокументПоступления КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК ПредметСделки,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	-ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	|	-ВозвратТоваровПоставщикуТовары.Количество * ВозвратТоваровПоставщикуТовары.Коэффициент / ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА -(ВозвратТоваровПоставщикуТовары.Сумма - ВозвратТоваровПоставщикуТовары.СуммаНДС)
	|		ИНАЧЕ -ВозвратТоваровПоставщикуТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	|	-ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыВозврата КАК ДокументыВозврата
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ДокументыВозврата.ДокументВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВозвратТоваровПоставщикуТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ВозвратТоваровПоставщикуТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыПоступленияИВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыВозврата";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровОтПокупателя(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратТоваровОтПокупателя.Ссылка КАК ДокументВозврата,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровОтПокупателя.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыРеализацииИВозврата
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВозвратТоваровОтПокупателяТовары.ДокументПартии = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Организация В(&СписокОрганизаций)
	|	И ВозвратТоваровОтПокупателя.Дата >= &НачалоПериода
	|	И ВозвратТоваровОтПокупателя.Проведен = ИСТИНА
	|	И ВозвратТоваровОтПокупателя.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВозвратТоваровОтПокупателя.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ВозвратТоваровОтПокупателяТовары.ДокументПартии ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ВозвратТоваровОтПокупателяТовары.ДокументПартии <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРеализации,
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыРеализацииИВозврата.ДокументВозврата,
	|	ДокументыРеализацииИВозврата.СуммаВключаетНДС,
	|	ДокументыРеализацииИВозврата.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыВозврата
	|ИЗ
	|	ДокументыРеализацииИВозврата КАК ДокументыРеализацииИВозврата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыРеализацииИВозврата.ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = РеализацияТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыРеализацииИВозврата.ДокументРеализации
	|			ИЗ
	|				ДокументыРеализацииИВозврата КАК ДокументыРеализацииИВозврата)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		-НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыВозврата.ДокументВозврата
	|				ИЗ
	|					ДокументыВозврата КАК ДокументыВозврата
	|				ГДЕ
	|					ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка КАК Сделка,
	|	ВозвратТоваровОтПокупателяТовары.ДокументПартии КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК ПредметСделки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	-ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
	|	-ВозвратТоваровОтПокупателяТовары.Количество * ВозвратТоваровОтПокупателяТовары.Коэффициент / ВозвратТоваровОтПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА -(ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС)
	|		ИНАЧЕ -ВозвратТоваровОтПокупателяТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	-ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыВозврата КАК ДокументыВозврата
	|		ПО (ДокументыВозврата.ДокументВозврата = ВозвратТоваровОтПокупателяТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ВозвратТоваровОтПокупателяТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыРеализацииИВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыВозврата";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиРеализации(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК ДокументКорректировки,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаРеализации.ВалютаДокумента,
	|	КорректировкаРеализации.ДокументРеализации
	|ПОМЕСТИТЬ ДокументыКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Организация В(&СписокОрганизаций)
	|	И КорректировкаРеализации.Дата >= &НачалоПериода
	|	И КорректировкаРеализации.Проведен = ИСТИНА
	|	И КорректировкаРеализации.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И КорректировкаРеализации.КорректироватьБУиНУ = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки,
	|	ДокументыКорректировки.СуммаВключаетНДС,
	|	ДокументыКорректировки.ДокументРеализации
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки";
	
	ТаблицаКорректировок = Новый ТаблицаЗначений();
	ТаблицаКорректировок.Колонки.Добавить("ДокументКорректировки", Новый ОписаниеТипов("ДокументСсылка.КорректировкаРеализации"));
	ТаблицаКорректировок.Колонки.Добавить("СуммаВключаетНДС", Новый ОписаниеТипов("Булево"));
	ТаблицаКорректировок.Колонки.Добавить("ДокументРеализации", Метаданные.Документы.КорректировкаРеализации.Реквизиты.ИсправляемыйДокументРеализации.Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКорректировок = ТаблицаКорректировок.Добавить();
		СтрокаКорректировок.ДокументКорректировки = Выборка.ДокументКорректировки;
		СтрокаКорректировок.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
		СтрокаКорректировок.ДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(Выборка.ДокументРеализации, Истина);
	КонецЦикла;

	Запрос.Параметры.Вставить("ДокументыКорректировкиИРеализации", ТаблицаКорректировок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКорректировкиИРеализации.ДокументКорректировки КАК ДокументКорректировки,
	|	ДокументыКорректировкиИРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации КАК ДокументРеализации
	|ПОМЕСТИТЬ ДокументыКорректировкиИРеализации
	|ИЗ
	|	&ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРеализации,
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = РеализацияТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИРеализации.ДокументРеализации
	|			ИЗ
	|				ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акт.Организация,
	|	Акт.Ссылка,
	|	Акт.Дата,
	|	Акт.Контрагент,
	|	Акт.ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Акт.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Акт.Контрагент
	|		ИНАЧЕ Акт.Грузополучатель
	|	КОНЕЦ,
	|	Акт.ВалютаДокумента,
	|	Акт.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ),
	|	Акт.КурсВзаиморасчетов,
	|	Акт.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Акт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = Акт.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = Акт.Контрагент)
	|			И Акт.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И Акт.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = Акт.Контрагент)
	|ГДЕ
	|	Акт.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИРеализации.ДокументРеализации
	|			ИЗ
	|				ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации)
	|	И Акт.Организация В(&СписокОрганизаций)
	|	И Акт.Дата >= &НачалоПериода
	|	И Акт.Дата <= &ОкончаниеПериода
	|	И Акт.Проведен = ИСТИНА
	|	И Акт.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И Акт.ОтражатьВБухгалтерскомУчете = ИСТИНА";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКорректировки.ДокументКорректировки
	|				ИЗ
	|					ДокументыКорректировки КАК ДокументыКорректировки
	|				ГДЕ
	|					ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоРеализацииОрганизации.Регистратор,
	|		РасчетыПоРеализацииОрганизации.СуммаНДС,
	|		0
	|	ИЗ
	|		РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|	ГДЕ
	|		РасчетыПоРеализацииОрганизации.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКорректировки.ДокументКорректировки
	|				ИЗ
	|					ДокументыКорректировки КАК ДокументыКорректировки
	|				ГДЕ
	|					ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка КАК Сделка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	КорректировкаРеализацииТовары.Номенклатура КАК ПредметСделки,
	|	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	-КорректировкаРеализацииТовары.КоличествоДоИзменения КАК Количество,
	|	-КорректировкаРеализацииТовары.КоличествоДоИзменения * КорректировкаРеализацииТовары.Коэффициент / КорректировкаРеализацииТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаРеализацииТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СуммаБезНДС,
	|	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДС,
	|	-КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаРеализацииТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаРеализацииТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаРеализацииТовары.Количество,
	|	КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.Коэффициент / КорректировкаРеализацииТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	КорректировкаРеализацииТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаРеализацииТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаРеализацииТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	КорректировкаРеализацииУслуги.СодержаниеДоИзменения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	-КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	-КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаРеализацииУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|	-КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииУслуги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	КорректировкаРеализацииУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.СтавкаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииУслуги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировки";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиПоступления(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка КАК ДокументКорректировки,
	|	КорректировкаПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаПоступления.ВалютаДокумента,
	|	КорректировкаПоступления.ДокументПоступления
	|ПОМЕСТИТЬ ДокументыКорректировки
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Организация В(&СписокОрганизаций)
	|	И КорректировкаПоступления.Дата >= &НачалоПериода
	|	И КорректировкаПоступления.Проведен = ИСТИНА
	|	И КорректировкаПоступления.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И КорректировкаПоступления.КорректироватьБУиНУ = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки,
	|	ДокументыКорректировки.СуммаВключаетНДС,
	|	ДокументыКорректировки.ДокументПоступления
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки";
	
	ТаблицаКорректировок = Новый ТаблицаЗначений();
	ТаблицаКорректировок.Колонки.Добавить("ДокументКорректировки", Новый ОписаниеТипов("ДокументСсылка.КорректировкаПоступления"));
	ТаблицаКорректировок.Колонки.Добавить("СуммаВключаетНДС", Новый ОписаниеТипов("Булево"));
	ТаблицаКорректировок.Колонки.Добавить("ДокументПоступления", Метаданные.Документы.КорректировкаПоступления.Реквизиты.ИсправляемыйДокументПоступления.Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКорректировок = ТаблицаКорректировок.Добавить();
		СтрокаКорректировок.ДокументКорректировки = Выборка.ДокументКорректировки;
		СтрокаКорректировок.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
		СтрокаКорректировок.ДокументПоступления = УчетНДС.ПолучитьИсправляемыйДокументПоступления(Выборка.ДокументПоступления, Истина);
	КонецЦикла;

	Запрос.Параметры.Вставить("ДокументыКорректировкиИПоступления", ТаблицаКорректировок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКорректировкиИПоступления.ДокументКорректировки КАК ДокументКорректировки,
	|	ДокументыКорректировкиИПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ ДокументыКорректировкиИПоступления
	|ИЗ
	|	&ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеТоваровУслуг.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИПоступления.ДокументПоступления
	|			ИЗ
	|				ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления)
	|	И ПоступлениеТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКорректировки.ДокументКорректировки
	|				ИЗ
	|					ДокументыКорректировки КАК ДокументыКорректировки
	|				ГДЕ
	|					ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоПриобретениюОрганизации.Регистратор,
	|		РасчетыПоПриобретениюОрганизации.СуммаНДС,
	|		0
	|	ИЗ
	|		РегистрСведений.РасчетыПоПриобретениюОрганизации КАК РасчетыПоПриобретениюОрганизации
	|	ГДЕ
	|		РасчетыПоПриобретениюОрганизации.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКорректировки.ДокументКорректировки
	|				ИЗ
	|					ДокументыКорректировки КАК ДокументыКорректировки
	|				ГДЕ
	|					ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Ссылка КАК Сделка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	КорректировкаПоступленияТовары.Номенклатура КАК ПредметСделки,
	|	КорректировкаПоступленияТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	-КорректировкаПоступленияТовары.КоличествоДоИзменения КАК Количество,
	|	-КорректировкаПоступленияТовары.КоличествоДоИзменения * КорректировкаПоступленияТовары.Коэффициент / КорректировкаПоступленияТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	КорректировкаПоступленияТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаПоступленияТовары.СуммаДоИзменения - КорректировкаПоступленияТовары.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаПоступленияТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СуммаБезНДС,
	|	КорректировкаПоступленияТовары.СтавкаНДСДоИзменения КАК СтавкаНДС,
	|	-КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	КорректировкаПоступленияТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаПоступленияТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаПоступленияТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки) 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаПоступленияТовары.Количество,
	|	КорректировкаПоступленияТовары.Количество * КорректировкаПоступленияТовары.Коэффициент / КорректировкаПоступленияТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	КорректировкаПоступленияТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаПоступленияТовары.Сумма
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.СтавкаНДС,
	|	КорректировкаПоступленияТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	КорректировкаПоступленияТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаПоступленияТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаПоступленияТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияУслуги.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияУслуги.Номенклатура,
	|	КорректировкаПоступленияУслуги.СодержаниеДоИзменения КАК Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	-КорректировкаПоступленияУслуги.КоличествоДоИзменения,
	|	-КорректировкаПоступленияУслуги.КоличествоДоИзменения,
	|	КорректировкаПоступленияУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаПоступленияУслуги.СуммаДоИзменения - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаПоступленияУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	КорректировкаПоступленияУслуги.СтавкаНДСДоИзменения,
	|	-КорректировкаПоступленияУслуги.СуммаНДСДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияУслуги.Ссылка)
	|ГДЕ
	|	КорректировкаПоступленияУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияУслуги.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияУслуги.Номенклатура,
	|	КорректировкаПоступленияУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаПоступленияУслуги.Количество,
	|	КорректировкаПоступленияУслуги.Количество,
	|	КорректировкаПоступленияУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаПоступленияУслуги.Сумма
	|	КОНЕЦ,
	|	КорректировкаПоступленияУслуги.СтавкаНДС,
	|	КорректировкаПоступленияУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияУслуги.Ссылка)
	|ГДЕ
	|	КорректировкаПоступленияУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировкиИПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировки";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.Дата КАК Период,
	|	ОтчетКомиссионераОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	ОтчетКомиссионераОПродажах.Контрагент КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ОтчетКомиссионераОПродажах.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионераОПродажахПокупатели.Покупатель)
	|			И ОтчетКомиссионераОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомиссионераОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионераОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомиссионераОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТовары.Ссылка КАК Сделка,
	|	ОтчетКомиссионераОПродажахТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК ПредметСделки,
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.РасчетныйДокумент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
	|	ОтчетКомиссионераОПродажахТовары.Количество * ОтчетКомиссионераОПродажахТовары.Коэффициент / ОтчетКомиссионераОПродажахТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ОтчетКомиссионераОПродажахТовары.Сумма - ОтчетКомиссионераОПродажахТовары.СуммаНДС
	|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО (ОтчетКомиссионераОПродажахПокупатели.КлючСтроки = ОтчетКомиссионераОПродажахТовары.КлючСтроки)
	|			И (ОтчетКомиссионераОПродажахПокупатели.Ссылка = ОтчетКомиссионераОПродажахТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			И (ДокументыКонтролируемыхСделок.Контрагент = ОтчетКомиссионераОПродажахПокупатели.Покупатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ОтчетКомиссионераОПродажахТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ОтчетКомиссионераОПродажахТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ЛОЖЬ КАК ИностранныйКонтрагент,
	|	ЛОЖЬ КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДополнитьРегистрыНастроекДляУведомления(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.Контрагент
	|ПОМЕСТИТЬ СписокКонтрагентов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокКонтрагентов.Контрагент,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5,
	|	КонтактнаяИнформация.Поле6,
	|	КонтактнаяИнформация.Поле7,
	|	КонтактнаяИнформация.Поле8,
	|	КонтактнаяИнформация.Поле9,
	|	КонтактнаяИнформация.Поле10
	|ИЗ
	|	СписокКонтрагентов КАК СписокКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО СписокКонтрагентов.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО СписокКонтрагентов.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	УчастникиКонтролируемыхСделок.Контрагент ЕСТЬ NULL ";
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписейУчастники = РегистрыСведений.УчастникиКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписейУчастники.Добавить();
		Запись.Контрагент = Выборка.Контрагент;
		
		АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(Выборка);
		Если АдресРФ Тогда
			Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.Россия;
		Иначе
			Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(Выборка.Поле1));
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейУчастники.Количество()>0 Тогда
		НаборЗаписейУчастники.Записать(Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки
	|ПОМЕСТИТЬ СписокПредметов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПредметов.ПредметСделки,
	|	СписокПредметов.ПредметСделки.ОКП.Код КАК КодПоОКП
	|ИЗ
	|	СписокПредметов КАК СписокПредметов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО (ПредметыКонтролируемыхСделок.ПредметСделки = СписокПредметов.ПредметСделки)
	|ГДЕ
	|	ПредметыКонтролируемыхСделок.ПредметСделки ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписейПредметы = РегистрыСведений.ПредметыКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПредметСделки) Тогда
			Запись = НаборЗаписейПредметы.Добавить();
			Запись.ПредметСделки = Выборка.ПредметСделки;
			Запись.КодПоОКП = Выборка.КодПоОКП;
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейПредметы.Количество()>0 Тогда
		НаборЗаписейПредметы.Записать(Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.Организация КАК Организация,
	|	КонтролируемыеСделкиОрганизаций.Контрагент,
	|	КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента,
	|	КонтролируемыеСделкиОрганизаций.Регистратор.ОтчетныйГод КАК ОтчетныйГод
	|ПОМЕСТИТЬ СписокПредметов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПредметов.Организация,
	|	СписокПредметов.Контрагент,
	|	СписокПредметов.ДоговорКонтрагента,
	|	СписокПредметов.ОтчетныйГод
	|ИЗ
	|	СписокПредметов КАК СписокПредметов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО СписокПредметов.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И СписокПредметов.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И СписокПредметов.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|ГДЕ
	|	ДоговорыУчастниковКонтролируемыхСделок.Организация ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписейДоговоры = РегистрыСведений.ДоговорыУчастниковКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписейДоговоры.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	
	Если НаборЗаписейДоговоры.Количество()>0 Тогда
		НаборЗаписейДоговоры.Записать(Ложь);
	КонецЕсли;


КонецПроцедуры

Процедура ДобавитьСделкиПолученияУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолучениеУслугПоПереработке.Организация,
	|	ПолучениеУслугПоПереработке.Дата КАК Период,
	|	ПолучениеУслугПоПереработке.Ссылка КАК РасчетныйДокумент,
	|	ПолучениеУслугПоПереработке.Контрагент,
	|	ПолучениеУслугПоПереработке.Организация КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ПолучениеУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПолучениеУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПолучениеУслугПоПереработке.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПолучениеУслугПоПереработке.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПолучениеУслугПоПереработке КАК ПолучениеУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПолучениеУслугПоПереработке.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПолучениеУслугПоПереработке.Контрагент)
	|			И ПолучениеУслугПоПереработке.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПолучениеУслугПоПереработке.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПолучениеУслугПоПереработке.Контрагент)
	|ГДЕ
	|	ПолучениеУслугПоПереработке.Организация В(&СписокОрганизаций)
	|	И ПолучениеУслугПоПереработке.Дата >= &НачалоПериода
	|	И ПолучениеУслугПоПереработке.Дата <= &ОкончаниеПериода
	|	И ПолучениеУслугПоПереработке.Проведен = ИСТИНА
	|	И ПолучениеУслугПоПереработке.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПолучениеУслугПоПереработке.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если Метаданные.Документы.ПолучениеУслугПоПереработке.ТабличныеЧасти.Товары.Реквизиты.Найти("Сумма") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ПолучениеУслугПоПереработкеТовары.Ссылка КАК Сделка,
		|	ПолучениеУслугПоПереработкеТовары.Ссылка КАК РасчетныйДокумент,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
		|	ПолучениеУслугПоПереработкеТовары.Номенклатура КАК ПредметСделки,
		|	ПолучениеУслугПоПереработкеТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
		|	ИСТИНА КАК ВключатьСоставСделок,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
		|	ПолучениеУслугПоПереработкеТовары.Количество,
		|	ПолучениеУслугПоПереработкеТовары.Количество КАК КоличествоВУчете,
		|	ПолучениеУслугПоПереработкеТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
		|	ВЫБОР
		|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
		|			ТОГДА ПолучениеУслугПоПереработкеТовары.Сумма - ПолучениеУслугПоПереработкеТовары.СуммаНДС
		|		ИНАЧЕ ПолучениеУслугПоПереработкеТовары.Сумма
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ПолучениеУслугПоПереработкеТовары.СтавкаНДС,
		|	ПолучениеУслугПоПереработкеТовары.СуммаНДС,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
		|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
		|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
		|ИЗ
		|	Документ.ПолучениеУслугПоПереработке.Товары КАК ПолучениеУслугПоПереработкеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
		|		ПО ПолучениеУслугПоПереработкеТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
		|ГДЕ
		|	ПолучениеУслугПоПереработкеТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
		|			ИЗ
		|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка КАК Сделка,
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПолучениеУслугПоПереработкеУслуги.Номенклатура КАК ПредметСделки,
	|	ПолучениеУслугПоПереработкеУслуги.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	ПолучениеУслугПоПереработкеУслуги.Количество,
	|	ПолучениеУслугПоПереработкеУслуги.Количество КАК КоличествоВУчете,
	|	ПолучениеУслугПоПереработкеУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПолучениеУслугПоПереработкеУслуги.Сумма - ПолучениеУслугПоПереработкеУслуги.СуммаНДС
	|		ИНАЧЕ ПолучениеУслугПоПереработкеУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПолучениеУслугПоПереработкеУслуги.СтавкаНДС,
	|	ПолучениеУслугПоПереработкеУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПолучениеУслугПоПереработке.Услуги КАК ПолучениеУслугПоПереработкеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПолучениеУслугПоПереработкеУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияТоваровУслугВНТТ(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТ.Организация КАК Организация,
	|	ПоступлениеТоваровУслугВНТТ.Дата КАК Период,
	|	ПоступлениеТоваровУслугВНТТ.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслугВНТТ.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслугВНТТ.Организация КАК Грузополучатель,
	|	ПоступлениеТоваровУслугВНТТ.Контрагент КАК Грузоотправитель,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслугВНТТ.ВалютаДокумента,
	|	ПоступлениеТоваровУслугВНТТ.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ КАК ПоступлениеТоваровУслугВНТТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеТоваровУслугВНТТ.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслугВНТТ.Контрагент)
	|			И ПоступлениеТоваровУслугВНТТ.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслугВНТТ.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслугВНТТ.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТ.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслугВНТТ.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслугВНТТ.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслугВНТТ.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслугВНТТ.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеТоваровУслугВНТТ.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка КАК Сделка,
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеТоваровУслугВНТТТовары.Номенклатура КАК ПредметСделки,
	|	ПоступлениеТоваровУслугВНТТТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугВНТТТовары.Количество КАК Количество,
	|	ПоступлениеТоваровУслугВНТТТовары.Количество * ПоступлениеТоваровУслугВНТТТовары.Коэффициент / ПоступлениеТоваровУслугВНТТТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ПоступлениеТоваровУслугВНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугВНТТТовары.Сумма - ПоступлениеТоваровУслугВНТТТовары.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугВНТТТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеТоваровУслугВНТТТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугВНТТТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ПоступлениеТоваровУслугВНТТТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ПоступлениеТоваровУслугВНТТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугВНТТТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугВНТТТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугВНТТТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка,
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугВНТТУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугВНТТУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг),
	|	ПоступлениеТоваровУслугВНТТУслуги.Количество,
	|	ПоступлениеТоваровУслугВНТТУслуги.Количество,
	|	ПоступлениеТоваровУслугВНТТУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугВНТТУслуги.Сумма - ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугВНТТУслуги.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугВНТТУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугВНТТУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугВНТТУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры
