
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПРГ_ДопРабочеВремяСотрудников.Записывать = Истина;
	Движения.ПРГ_ДопРабочеВремяСотрудников.Очистить();
	
		Для Каждого ТекСтрокаТабель Из Табель Цикл
			Для сч=1 По день(КонецМесяца(период)) Цикл
				
				Движение = Движения.ПРГ_ДопРабочеВремяСотрудников.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = ТекСтрокаТабель.Сотрудник;
				Движение.Период = Дата(год(Период),месяц(Период),сч);
				Движение.Длительность = ТекСтрокаТабель["д"+строка(сч)];
			КонецЦикла;
		КонецЦикла;
	
КонецПроцедуры
