//m_ionov@mail.ru 11.10.2016
Перем ПРГ_ИсппользуетсяБлокМолочногоПроизводства Экспорт;
//------- m_ionov@mail.ru -------

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование серии по значениям реквизитов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование() Экспорт

	Строка = "";

	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Строка = Строка + СерийныйНомер + ", ";
	КонецЕсли;

	Если ЗначениеЗаполнено(СрокГодности) Тогда
		Строка = Строка + Формат(СрокГодности,"ДФ=""дд.ММ.гггг""") + ", ";
	КонецЕсли;

	Если ЗначениеЗаполнено(НомерГТД) Тогда
		Строка = Строка + СокрЛП(НомерГТД.Код) + ", ";
	КонецЕсли;

	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		Строка = Строка + СтранаПроисхождения.Наименование + ", ";
	КонецЕсли;

	Строка = Лев(Строка, СтрДлина(Строка) - 2);

	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Свойства не назначены>";
	КонецЕсли;

	Возврат Строка;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ОсновноеИзображение = Неопределено;
		
	КонецЕсли;
	
	//m_ionov@mail.ru 01.09.2016
	УЗ_Накладная = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	НСИ_МДЖ_ТТН = 0;
	НСИ_МДБ_ТТН = 0;
	НСИ_МДСВ_ТТН = 0;
	УЗ_Секция = 0;
	//------- m_ionov@mail.ru -------
	
КонецПроцедуры

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда

		// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
		Если НомерГТД <> Ссылка.НомерГТД
		 ИЛИ СтранаПроисхождения <> Ссылка.СтранаПроисхождения Тогда

			Если ПолныеПрава.СерииНоменклатуры_СуществуютСсылки(Ссылка) Тогда

				Сообщить("Существуют документы, проведенные по серии """ + Наименование + """.
						 |Реквизиты ""Номер ГТД"" и ""Страна происхождения"" не могут быть изменены, элемент не записан.", 
						 СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

/// Кунов О.В., 25.10.2016 - 58422
Функция ПолучитьОбязательныеПоказатели() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПРГ_ВидыПоказателейДляГруппировокНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппировкаНоменклатуры.Установить(Владелец.ГруппировкаНоменклатуры);
	НаборЗаписей.Прочитать();
	
	Результат = НаборЗаписей.Выгрузить();
	
	Возврат Результат;
	
КонецФункции
///

//m_ionov@mail.ru 11.10.2016
ПРГ_ИсппользуетсяБлокМолочногоПроизводства = ПРГ_ДопФункцииКлиентСервер.ПРГ_ИсппользуетсяБлокМолочногоПроизводства();
//------- m_ionov@mail.ru -------