#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость
    |ПОМЕСТИТЬ СтоимостьОСОстаткиИОбороты
    |ИЗ
    |   РегистрНакопления.СтоимостьОС.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(ОсновноеСредство).* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   РегСведенияОбОС.ОсновноеСредство КАК ОсновноеСредство,
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость
    |ПОМЕСТИТЬ РегСведенияОбОС
    |ИЗ
    |   РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
    |   МестонахождениеОС.МОЛ КАК МОЛ,
    |   МестонахождениеОС.Местонахождение КАК Местонахождение
    |ПОМЕСТИТЬ МестонахождениеОС
    |ИЗ
    |   РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаКон, ) КАК МестонахождениеОС
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
    |   ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
    |   РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   СтоимостьОСОстаткиИОбороты.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство.Код КАК ИнвентарныйНомер,
    |   МестонахождениеОС.МОЛ КАК МОЛ,
    |   МестонахождениеОС.Местонахождение КАК Подразделение
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
    |{ВЫБРАТЬ
    |   ОсновноеСредство.*,
    |   ИнвентарныйНомер,
    |   МОЛ.*,
    |   Подразделение.*,
    |   СпособНачисления,
    |   ДатаВводаВЭксплуатацию,
    |   ПервоначальнаяСтоимость,
    |   СтоимостьНачальныйОстаток,
    |   СтоимостьКонечныйОстаток,
    |   СтоимостьОборот,
    |   АмортизацияНачальныйОстаток,
    |   АмортизацияКонечныйОстаток,
    |   АмортизацияОборот,
    |   ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
    |ИЗ
    |   СтоимостьОСОстаткиИОбороты КАК СтоимостьОСОстаткиИОбороты
    |       {ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК РегСостояниеОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство
    |           И (РегСостояниеОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))}
    |       {ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС КАК РегСведенияОбОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство}
    |       {ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство}
	|	//СОЕДИНЕНИЯ
    |{ГДЕ
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
    |   РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   (СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство.Код КАК ИнвентарныйНомер,
    |   МестонахождениеОС.МОЛ.* КАК МОЛ,
    |   МестонахождениеОС.Местонахождение.* КАК Подразделение
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
    |{УПОРЯДОЧИТЬ ПО
    |   ОсновноеСредство.*,
    |   ИнвентарныйНомер,
    |   МОЛ.*,
    |   Подразделение.*,
    |   СпособНачисления,
    |   ДатаВводаВЭксплуатацию,
    |   ПервоначальнаяСтоимость,
    |   СтоимостьНачальныйОстаток,
    |   СтоимостьКонечныйОстаток,
    |   СтоимостьОборот,
    |   АмортизацияНачальныйОстаток,
    |   АмортизацияКонечныйОстаток,
    |   АмортизацияОборот,
    |   ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
    |ИТОГИ
    |   МАКСИМУМ(СпособНачисления),
    |   МАКСИМУМ(ДатаВводаВЭксплуатацию),
    |   СУММА(СтоимостьНачальныйОстаток),
    |   СУММА(СтоимостьКонечныйОстаток),
    |   СУММА(СтоимостьОборот),
    |   СУММА(АмортизацияНачальныйОстаток),
    |   СУММА(АмортизацияКонечныйОстаток),
    |   СУММА(АмортизацияОборот),
    |   СУММА(ОстаточнаяСтоимость),
    |   СУММА(ПервоначальнаяСтоимость),
    |   МАКСИМУМ(ИнвентарныйНомер),
    |   МАКСИМУМ(МОЛ)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
    |ПО
    |   ОБЩИЕ,
    |   Подразделение
    |{ИТОГИ ПО
    |   ОсновноеСредство.*,
    |   Подразделение.*,
    |   МОЛ.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", "ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиБух(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
    |   СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость
    |ПОМЕСТИТЬ СтоимостьОСОстаткиИОбороты
    |ИЗ
    |   РегистрНакопления.СтоимостьОСБухгалтерскийУчет.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(ОсновноеСредство).* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   РегСведенияОбОС.ОсновноеСредство КАК ОсновноеСредство,
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
    |   РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
    |   РегСведенияОбОС.Организация
    |ПОМЕСТИТЬ РегСведенияОбОС
    |ИЗ
    |   РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
    |   МестонахождениеОС.МОЛ КАК МОЛ,
    |   МестонахождениеОС.Местонахождение КАК Местонахождение,
    |   МестонахождениеОС.Организация
    |ПОМЕСТИТЬ МестонахождениеОС
    |ИЗ
    |   РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК МестонахождениеОС
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
    |   СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
    |   ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
    |   РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
    |   РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
    |   МестонахождениеОС.МОЛ КАК МОЛ,
    |   МестонахождениеОС.Местонахождение КАК Подразделение
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
    |{ВЫБРАТЬ
    |   ОсновноеСредство.*,
    |   Организация.*,
    |   МОЛ.*,
    |   Подразделение.*,
    |   ИнвентарныйНомер,
    |   СпособНачисления,
    |   ДатаВводаВЭксплуатацию,
    |   ПервоначальнаяСтоимость,
    |   СтоимостьНачальныйОстаток,
    |   СтоимостьКонечныйОстаток,
    |   СтоимостьОборот,
    |   АмортизацияНачальныйОстаток,
    |   АмортизацияКонечныйОстаток,
    |   АмортизацияОборот,
    |   ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
    |ИЗ
    |   СтоимостьОСОстаткиИОбороты КАК СтоимостьОСОстаткиИОбороты
    |       {ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК РегСостояниеОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство
    |           И СтоимостьОСОстаткиИОбороты.Организация = РегСостояниеОС.Организация
    |           И (РегСостояниеОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))}
    |       {ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС КАК РегСведенияОбОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство
    |           И СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОС.Организация}
    |       {ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
    |       ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
    |           И СтоимостьОСОстаткиИОбороты.Организация = МестонахождениеОС.Организация}
	|	//СОЕДИНЕНИЯ
    |{ГДЕ
    |   СтоимостьОСОстаткиИОбороты.Организация.* КАК Организация,
    |   МестонахождениеОС.МОЛ.* КАК МОЛ,
    |   МестонахождениеОС.Местонахождение.* КАК Подразделение,
    |   РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
    |   РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
    |   СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   (СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
    |   РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
    |   РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
    |{УПОРЯДОЧИТЬ ПО
    |   ОсновноеСредство.*,
    |   Организация.*,
    |   МОЛ.*,
    |   Подразделение.*,
    |   ИнвентарныйНомер,
    |   СпособНачисления,
    |   ДатаВводаВЭксплуатацию,
    |   ПервоначальнаяСтоимость,
    |   СтоимостьНачальныйОстаток,
    |   СтоимостьКонечныйОстаток,
    |   СтоимостьОборот,
    |   АмортизацияНачальныйОстаток,
    |   АмортизацияКонечныйОстаток,
    |   АмортизацияОборот,
    |   ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
    |ИТОГИ
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(МОЛ),
    |   СУММА(СтоимостьНачальныйОстаток),
    |   СУММА(СтоимостьКонечныйОстаток),
    |   СУММА(СтоимостьОборот),
    |   СУММА(АмортизацияНачальныйОстаток),
    |   СУММА(АмортизацияКонечныйОстаток),
    |   СУММА(АмортизацияОборот),
    |   СУММА(ПервоначальнаяСтоимость),
    |   СУММА(ОстаточнаяСтоимость)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
    |ПО
    |   ОБЩИЕ,
    |   Подразделение
    |{ИТОГИ ПО
    |   ОсновноеСредство.*,
    |   Организация.*,
    |   Подразделение.*,
    |   МОЛ.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Подразделение", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", "ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиБух()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиНал(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость
	|ПОМЕСТИТЬ СтоимостьОСОстаткиИОбороты
	|ИЗ
	|	РегистрНакопления.СтоимостьОСНалоговыйУчет.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(ОсновноеСредство).* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОС.ОсновноеСредство КАК ОсновноеСредство,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РегСведенияОбОС.Организация
	|ПОМЕСТИТЬ РегСведенияОбОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОСНУ.ОсновноеСредство КАК ОсновноеСредство,
	|	РегСведенияОбОСНУ.МетодНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОСНУ.Организация
	|ПОМЕСТИТЬ РегСведенияОбОСНУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОСНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	МестонахождениеОС.Местонахождение КАК Местонахождение,
	|	МестонахождениеОС.Организация
	|ПОМЕСТИТЬ МестонахождениеОС
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК МестонахождениеОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
	|	РегСведенияОбОСНУ.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	МестонахождениеОС.Местонахождение КАК Подразделение
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	ДатаВводаВЭксплуатацию,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	СтоимостьОСОстаткиИОбороты КАК СтоимостьОСОстаткиИОбороты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК РегСостояниеОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство
	|			И СтоимостьОСОстаткиИОбороты.Организация = РегСостояниеОС.Организация
	|			И (РегСостояниеОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию))}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС КАК РегСведенияОбОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство
	|			И СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОС.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОСНУ КАК РегСведенияОбОСНУ
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОСНУ.ОсновноеСредство
	|			И СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОСНУ.Организация}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|			И СтоимостьОСОстаткиИОбороты.Организация = МестонахождениеОС.Организация}
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	СтоимостьОСОстаткиИОбороты.Организация.* КАК Организация,
	|	МестонахождениеОС.МОЛ.* КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.* КАК Подразделение,
	|	РегСведенияОбОСНУ.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСостояниеОС.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	(СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	ДатаВводаВЭксплуатацию,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(МОЛ),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(ОстаточнаяСтоимость)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ,
	|	Подразделение
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	Подразделение.*,
	|	МОЛ.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение");
	
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Подразделение", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", "ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиНал()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиМСФО(ДополнительныеПараметры = Неопределено)
	//начало изменений ДС МСФО 11.12.2013
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	// is ЯннуровВФ нач 20140918
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	НаКонец.ОсновноеСредство,
	//|	НаКонец.Организация,
	//|	НаКонец.МетодНачисленияАмортизации КАК СпособНачисленияАмортизации,
	//|	НаКонец.ПервоначальнаяСтоимость КАК СтоимостьКонечныйОстаток,
	//|	НаКонец.СуммаНачисленнойАмортизации КАК АмортизацияКонечныйОстаток,
	//|	НаКонец.МОЛ,
	//|	НаКонец.МестонахождениеОбъекта КАК Подразделение,
	//|	ЕСТЬNULL(НаНачало.ПервоначальнаяСтоимость, 0) КАК СтоимостьНачальныйОстаток,
	//|	ЕСТЬNULL(НаНачало.СуммаНачисленнойАмортизации, 0) КАК АмортизацияНачальныйОстаток,
	//|	ЕСТЬNULL(Первоначально.ПервоначальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
	//|	Первоначально.Период КАК ДатаВводаВЭксплуатацию,
	//|	НаКонец.ОсновноеСредство.Код КАК ИнвентарныйНомер,
	//|	НаКонец.СчетЗатрат
	//|ПОМЕСТИТЬ ОС_МСФО
	//|ИЗ
	//|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаКон, ) КАК НаКонец
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаНач, ) КАК НаНачало
	//|		ПО НаКонец.ОсновноеСредство = НаНачало.ОсновноеСредство
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПервых(ДАТАВРЕМЯ(1, 1, 1), ) КАК Первоначально
	//|		ПО НаКонец.ОсновноеСредство = Первоначально.ОсновноеСредство
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ОС_МСФО.ОсновноеСредство КАК ОсновноеСредство,
	//|	ОС_МСФО.Организация КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(ОС_МСФО.ОсновноеСредство),
	//|	ОС_МСФО.СпособНачисленияАмортизации КАК СпособНачисления,
	//|	ОС_МСФО.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	//|	ОС_МСФО.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	//|	ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьОборот,
	//|	ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	//|	ОС_МСФО.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	//|	ОС_МСФО.АмортизацияКонечныйОстаток - ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияОборот,
	//|	ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	//|	ОС_МСФО.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	//|	ОС_МСФО.ИнвентарныйНомер КАК ИнвентарныйНомер,
	//|	ОС_МСФО.МОЛ КАК МОЛ,
	//|	ОС_МСФО.Подразделение КАК Подразделение,
	//|	ОС_МСФО.СчетЗатрат КАК СчетЗатрат
	//|	//ПОЛЯ_СВОЙСТВА
	//|	//ПОЛЯ_КАТЕГОРИИ
	//|{ВЫБРАТЬ
	//|	ОсновноеСредство.*,
	//|	Организация.*,
	//|	МОЛ.*,
	//|	Подразделение.*,
	//|	ИнвентарныйНомер,
	//|	СпособНачисления,
	//|	ДатаВводаВЭксплуатацию,
	//|	ПервоначальнаяСтоимость,
	//|	СтоимостьНачальныйОстаток,
	//|	СтоимостьКонечныйОстаток,
	//|	СтоимостьОборот,
	//|	АмортизацияНачальныйОстаток,
	//|	АмортизацияКонечныйОстаток,
	//|	АмортизацияОборот,
	//|	ОстаточнаяСтоимость,
	//|	СчетЗатрат.*
	//|	//ПСЕВДОНИМЫ_СВОЙСТВА
	//|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	//|}
	//|ИЗ
	//|	ОС_МСФО КАК ОС_МСФО
	//|	//СОЕДИНЕНИЯ
	//|{ГДЕ
	//|	ОС_МСФО.Организация.* КАК Организация,
	//|	ОС_МСФО.ОсновноеСредство.* КАК ОсновноеСредство,
	//|	ОС_МСФО.МОЛ.* КАК МОЛ,
	//|	ОС_МСФО.Подразделение.* КАК Подразделение,
	//|	ОС_МСФО.СпособНачисленияАмортизации КАК СпособНачисления,
	//|	ОС_МСФО.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	//|	ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	//|	ОС_МСФО.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	//|	(ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.СтоимостьНачальныйОстаток) КАК СтоимостьОборот,
	//|	ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	//|	ОС_МСФО.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	//|	(ОС_МСФО.АмортизацияКонечныйОстаток - ОС_МСФО.АмортизацияНачальныйОстаток) КАК АмортизацияОборот,
	//|	(ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	//|	ОС_МСФО.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	//|	ОС_МСФО.ИнвентарныйНомер КАК ИнвентарныйНомер,
	//|	ОС_МСФО.СчетЗатрат.*
	//|	//УСЛОВИЯ_СВОЙСТВА
	//|	//УСЛОВИЯ_КАТЕГОРИИ
	//|}
	//|{УПОРЯДОЧИТЬ ПО
	//|	ОсновноеСредство.*,
	//|	Организация.*,
	//|	МОЛ.*,
	//|	Подразделение.*,
	//|	ИнвентарныйНомер,
	//|	СпособНачисления,
	//|	ДатаВводаВЭксплуатацию,
	//|	ПервоначальнаяСтоимость,
	//|	СтоимостьНачальныйОстаток,
	//|	СтоимостьКонечныйОстаток,
	//|	СтоимостьОборот,
	//|	АмортизацияНачальныйОстаток,
	//|	АмортизацияКонечныйОстаток,
	//|	АмортизацияОборот,
	//|	ОстаточнаяСтоимость,
	//|	СчетЗатрат.*
	//|	//ПСЕВДОНИМЫ_СВОЙСТВА
	//|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	//|}
	//|ИТОГИ
	//|	МАКСИМУМ(СпособНачисления),
	//|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	//|	СУММА(СтоимостьНачальныйОстаток),
	//|	СУММА(СтоимостьКонечныйОстаток),
	//|	СУММА(СтоимостьОборот),
	//|	СУММА(АмортизацияНачальныйОстаток),
	//|	СУММА(АмортизацияКонечныйОстаток),
	//|	СУММА(АмортизацияОборот),
	//|	СУММА(ОстаточнаяСтоимость),
	//|	СУММА(ПервоначальнаяСтоимость),
	//|	МАКСИМУМ(ИнвентарныйНомер),
	//|	МАКСИМУМ(МОЛ),
	//|	МАКСИМУМ(СчетЗатрат)
	//|	//ИТОГИ_СВОЙСТВА
	//|	//ИТОГИ_КАТЕГОРИИ
	//|ПО
	//|	ОБЩИЕ,
	//|	Подразделение
	//|{ИТОГИ ПО
	//|	ОсновноеСредство.*,
	//|	Организация.*,
	//|	Подразделение.*,
	//|	МОЛ.*
	//|	//ПСЕВДОНИМЫ_СВОЙСТВА
	//|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	//|}";
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредстваМеждународныйУчет.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредстваМеждународныйУчет.ис_Лизинг КАК Лизинг,
	|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	|	МИНИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК МинПериод,
	|	МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК МаксПериод
	|ПОМЕСТИТЬ втПоступленияОС
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
	|ГДЕ
	|	(ОсновныеСредстваМеждународныйУчет.Период <= &ДатаКонца
	|			ИЛИ &ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредстваМеждународныйУчет.ОсновноеСредство,
	|	ОсновныеСредстваМеждународныйУчет.ис_Лизинг,
	|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втПоступленияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(ПерваяСтрока.Период) КАК ДатаВводаВЭксплуатацию,
	|	СУММА(ПоследняяСтрока.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость
	|ПОМЕСТИТЬ втПервоначальнаяСтоимостьОС
	|ИЗ
	|	втПоступленияОС КАК втПоступленияОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ПерваяСтрока
	|		ПО втПоступленияОС.ОсновноеСредство = ПерваяСтрока.ОсновноеСредство
	|			И втПоступленияОС.МинПериод = ПерваяСтрока.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ПоследняяСтрока
	|		ПО втПоступленияОС.ОсновноеСредство = ПоследняяСтрока.ОсновноеСредство
	|			И втПоступленияОС.МаксПериод = ПоследняяСтрока.Период
	|ГДЕ
	|	втПоступленияОС.Лизинг ЕСТЬ НЕ NULL 
	|	И втПоступленияОС.ДатаПринятияКУчету ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	втПоступленияОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НаКонец.ОсновноеСредство КАК ОсновноеСредство,
	|	НаКонец.Организация,
	|	НаКонец.МетодНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	НаКонец.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	НаКонец.МОЛ,
	|	НаКонец.МестонахождениеОбъекта КАК Подразделение,
	|	ЕСТЬNULL(Договоры.Наименование, """") КАК НомерДоговора,
	|	ЕСТЬNULL(Стоимость.СуммаКонечныйОстаток, 0) КАК СтоимостьКонечныйОстаток,
	|	ЕСТЬNULL(-Амортизация.СуммаКонечныйОстаток, 0) КАК АмортизацияКонечныйОстаток,
	|	ЕСТЬNULL(Стоимость.СуммаНачальныйОстаток, 0) КАК СтоимостьНачальныйОстаток,
	|	ЕСТЬNULL(-Амортизация.СуммаНачальныйОстаток, 0) КАК АмортизацияНачальныйОстаток,
	|	ЕСТЬNULL(втПервоначальнаяСтоимостьОС.ПервоначальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(Амортизация.СуммаОборотДт, 0) КАК АмортизацияПриход,
	|	ЕСТЬNULL(Амортизация.СуммаОборотКт, 0) КАК АмортизацияРасход,
	|	втПервоначальнаяСтоимостьОС.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	НаКонец.ОсновноеСредство.Код КАК ИнвентарныйНомер,
	|	НаКонец.ОсновноеСредство.ГруппаОС КАК ГруппаУчетаОС,
	|	НаКонец.СчетЗатрат,
	|	НаКонец.СчетУчета
	|ПОМЕСТИТЬ ОС_МСФО
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ДатаКон, ) КАК НаКонец
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальнаяСтоимостьОС КАК втПервоначальнаяСтоимостьОС
	|		ПО НаКонец.ОсновноеСредство = втПервоначальнаяСтоимостьОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Международный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Международный.ОсновныеСредства)), , {(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства)).* КАК ОсновноеСредство}) КАК Стоимость
	|		ПО НаКонец.ОсновноеСредство = Стоимость.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Международный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Международный._АмортизацияОсновныхСредств)), , {(ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства)).* КАК ОсновноеСредство}) КАК Амортизация
	|		ПО НаКонец.ОсновноеСредство = Амортизация.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО НаКонец.ОсновноеСредство = Договоры.ДС_ОбъектДоговора
	|ГДЕ НЕ Договоры.ВидВзаиморасчетов В(&ИсключаемыеВидыВзаиморасчетов) ИЛИ Договоры.ВидВзаиморасчетов ЕСТЬ NULL
	//|ГДЕ
	//|	НаКонец.Состояние = &Состояние
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОС_МСФО.ОсновноеСредство КАК ОсновноеСредство,
	|	ОС_МСФО.ГруппаУчетаОС КАК ГруппаУчетаОС,
	|	ОС_МСФО.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(ОС_МСФО.ОсновноеСредство),
	|	ОС_МСФО.СпособНачисленияАмортизации КАК СпособНачисления,
	|	ОС_МСФО.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ОС_МСФО.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ОС_МСФО.НомерДоговора КАК НомерДоговора,
	|	ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	ОС_МСФО.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьОборот,
	|	ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	ОС_МСФО.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	ОС_МСФО.АмортизацияКонечныйОстаток - ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияОборот,
	|	-ОС_МСФО.АмортизацияПриход КАК АмортизацияПриход,
	|	ОС_МСФО.АмортизацияРасход КАК АмортизацияРасход,
	|	ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	|	ОС_МСФО.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ОС_МСФО.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОС_МСФО.МОЛ КАК МОЛ,
	|	ОС_МСФО.Подразделение КАК Подразделение,
	|	ОС_МСФО.СчетЗатрат КАК СчетЗатрат,
	|	ОС_МСФО.СчетУчета КАК СчетУчета
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	ДатаВводаВЭксплуатацию,
	|	СрокПолезногоИспользования,
	|	НомерДоговора,
	|	ГруппаУчетаОС,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	АмортизацияПриход,
	|	АмортизацияРасход,
	|	ОстаточнаяСтоимость,
	|	СчетЗатрат.*,
	|	СчетУчета.*}
	|ИЗ
	|	ОС_МСФО КАК ОС_МСФО
	|{ГДЕ
	|	ОС_МСФО.Организация.* КАК Организация,
	|	ОС_МСФО.ОсновноеСредство.* КАК ОсновноеСредство,
	|	ОС_МСФО.МОЛ.* КАК МОЛ,
	|	ОС_МСФО.Подразделение.* КАК Подразделение,
	|	ОС_МСФО.СпособНачисленияАмортизации КАК СпособНачисления,
	|	ОС_МСФО.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ОС_МСФО.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ОС_МСФО.НомерДоговора,
	|	ОС_МСФО.ГруппаУчетаОС,
	|	ОС_МСФО.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	ОС_МСФО.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	(ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.СтоимостьНачальныйОстаток) КАК СтоимостьОборот,
	|	ОС_МСФО.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	ОС_МСФО.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	(ОС_МСФО.АмортизацияКонечныйОстаток - ОС_МСФО.АмортизацияНачальныйОстаток) КАК АмортизацияОборот,
	|	ОС_МСФО.АмортизацияПриход КАК АмортизацияПриход,
	|	ОС_МСФО.АмортизацияРасход КАК АмортизацияРасход,
	|	(ОС_МСФО.СтоимостьКонечныйОстаток - ОС_МСФО.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	|	ОС_МСФО.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ОС_МСФО.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОС_МСФО.СчетЗатрат.*,
	|	ОС_МСФО.СчетУчета.*}
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	ДатаВводаВЭксплуатацию,
	|	СрокПолезногоИспользования,
	|	НомерДоговора,
	|	ГруппаУчетаОС,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	АмортизацияПриход,
	|	АмортизацияРасход,
	|	ОстаточнаяСтоимость,
	|	СчетЗатрат.*,
	|	СчетУчета.*}
	|ИТОГИ
	|	МАКСИМУМ(ГруппаУчетаОС),
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(СрокПолезногоИспользования),
	|	МАКСИМУМ(НомерДоговора),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(АмортизацияПриход),
	|	СУММА(АмортизацияРасход),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ПервоначальнаяСтоимость),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(МОЛ),
	|	МАКСИМУМ(СчетЗатрат),
	|	МАКСИМУМ(СчетУчета)
	|ПО
	|	ОБЩИЕ,
	|	Подразделение
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	Подразделение.*,
	|	МОЛ.*}";
	// is ЯннуровВФ кон 20140918
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ОС_МСФО.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования", "Срок полезного использования");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияПриход", 				"Амортизация приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияРасход", 				"Амортизация расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СчетЗатрат","Счет затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СчетУчета","Счет учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "НомерДоговора","Номер договора");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ГруппаУчетаОС","Группа учета ОС");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	//УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияРасход",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияПриход",           "выбытие",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Состояние", Перечисления.ВидыСостоянийОС.ВведеноВЭксплуатацию);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Подразделение", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокПолезногоИспользования", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СчетЗатрат", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СчетУчета", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("НомерДоговора", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ГруппаУчетаОС", "ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокПолезногоИспользования",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ИнвентарныйНомер",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СчетЗатрат",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СчетУчета",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("НомерДоговора",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ГруппаУчетаОС",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//конец изменений ДС МСФО 11.12.2013
КонецПроцедуры // УстановитьНачальныеНастройкиМСФО()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним) + " "
		+ ?(ВидУчета = 1, "(бухгалтерский учет)",
		  ?(ВидУчета = 2, "(налоговый учет)",
		  ?(ВидУчета = 3, "(международный учет)", "(управленческий учет)")));
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "";

	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	Если      ВидУчета = 1 Тогда // Бух.
		УстановитьНачальныеНастройкиБух(ДополнительныеПараметры);
	ИначеЕсли ВидУчета = 2 Тогда // Нал.
		УстановитьНачальныеНастройкиНал(ДополнительныеПараметры);
	//начало изменений ДС МСФО 11.12.2013	
	ИначеЕсли ВидУчета = 3 Тогда // МСФО
		УстановитьНачальныеНастройкиМСФО(ДополнительныеПараметры);
	//конец изменений ДС МСФО 11.12.2013
	Иначе // Упр
		УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	КонДата = Дата(УниверсальныйОтчет.ДатаКон);
	КонДата = КонецДня(?(КонДата = Дата('00010101000000'), Дата('39991231235959'), КонДата));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата", Дата(УниверсальныйОтчет.ДатаНач));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата", КонДата);
	
	ИсключаемыеВидыВзаиморасчетов = Новый Массив;
	ИсключаемыеВидыВзаиморасчетов.Добавить(Справочники.ВидыВзаиморасчетов.ШТРАФЫ_ПЕНИ_НЕУСТОЙК);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "ИсключаемыеВидыВзаиморасчетов", ИсключаемыеВидыВзаиморасчетов);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
