Перем мУдалятьДвижения;

Процедура СформироватьДвижения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРГ_ВводСведенийОАттестицииСотрудниковШЕПодлежащиеАттестации.ШЕ КАК ШЕ,
	|	ПРГ_ВводСведенийОАттестицииСотрудниковШЕПодлежащиеАттестации.Ссылка.ВидАттестации КАК ВидАттестации
	|ИЗ
	|	Документ.ПРГ_ВводСведенийОАттестицииСотрудников.ШЕПодлежащиеАттестации КАК ПРГ_ВводСведенийОАттестицииСотрудниковШЕПодлежащиеАттестации
	|ГДЕ
	|	ПРГ_ВводСведенийОАттестицииСотрудниковШЕПодлежащиеАттестации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей       = РегистрыСведений.ПРГ_СведенияОбАттестацииСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ШЕ = Выборка.ШЕ;
		НоваяЗапись.ВидАттестации  = Выборка.ВидАттестации;
		НоваяЗапись.ВидОперацииДокумента = Ссылка.ВидОперации;
		НоваяЗапись.Регистратор = Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать();       
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения и  Движения.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru = 'Проведение документа """ + СокрЛП(Ссылка) + """: '");
	
	СтрСообщения = "";
	
	//проверим заполнение	
	Если не ЗначениеЗаполнено(ВидАттестации) Тогда
		Отказ = Истина;
		СтрСообщения = "Не указан вид аттестации!!!";
	КонецЕсли;
	Если ШЕПодлежащиеАттестации.Количество() = 0 Тогда
		Отказ = Истина;
		Если не СтрСообщения = "" Тогда
			СтрСообщения = СтрСообщения+Символы.ПС + "Не заполнена таблица с шататными единицами, подлежащими аттестации!!!";
		Иначе
			СтрСообщения = "Не заполнена таблица с шататными единицами, подлежащими аттестации!!!";
		КонецЕсли;
	КонецЕсли;
	Если не Отказ тогда
		СформироватьДвижения();
	Иначе
		Сообщить("Проведение НЕВОЗМОЖНО!!!"+Символы.ПС+СтрСообщения);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

