
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СуммыПоПоказателямPL 
	Движения.СуммыПоПоказателямPL.Записывать = Истина;
	Движения.СуммыПоПоказателямPL.Очистить();
	Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
		Если (ТекСтрокаПоказатели.СуммаПроизводства<>0) или (ТекСтрокаПоказатели.СуммаРеализации<>0) тогда
			Движение = Движения.СуммыПоПоказателямPL.Добавить();
			Движение.Период = Дата;
			Движение.ПоказательPL = ТекСтрокаПоказатели.ПоказательPL;
			Движение.КодPL = ТекСтрокаПоказатели.КодPL;
			Движение.КодГруппыPL = ТекСтрокаПоказатели.КодГруппыPL;
			Движение.Счет = ТекСтрокаПоказатели.Счет;
			Движение.Статья = ТекСтрокаПоказатели.Статья;
			Движение.ЦентрУчетаЗатрат = ТекСтрокаПоказатели.ЦентрУчетаЗатрат;
			Движение.Регистр = ТекСтрокаПоказатели.Регистр;
			Движение.ПоПроизводству = ТекСтрокаПоказатели.ПоПроизводству;
			Движение.ПоРеализации = ТекСтрокаПоказатели.ПоРеализации;
			Движение.СуммаПроизводства = ТекСтрокаПоказатели.СуммаПроизводства;
			Движение.СуммаРеализации = ТекСтрокаПоказатели.СуммаРеализации;
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
