
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
                                          
// Выполняет запись в регистр сведений "УСЗ_КалендарьРаботыСклада" данных из временной таблицы
///////////////////////////////////////////////////////////////{ООО "Автоматизация-Л" ДОРАБОТКА
// Измайлова Полина 20.06.2011 13:32 добавлен параметр процедуры "ПроизводственныйКалендарь"                                          
Процедура ЗаписатьИзТаблицыВРегистр(ТаблицаРегистра,ГодЗаписи,Склад) Экспорт

    // Очистим старые данные за год
    НаборЗаписей = РегистрыСведений.УСЗ_КалендарьРаботыСклада.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Значение		 = ГодЗаписи;
	НаборЗаписей.Отбор.Год.Использование = Истина;
    
    НаборЗаписей.Отбор.Склад.Значение		 = Склад;
    НаборЗаписей.Отбор.Склад.Использование = Истина;

    НаборЗаписей.Прочитать();
    
    ЕстьЗаписиВРегистре = НаборЗаписей.Количество() > 0;
    
    // Запишем новые данные за год
    Если ЕстьЗаписиВРегистре Тогда
    	Для каждого Запись Из НаборЗаписей Цикл
    		СтрокаТаблицы = ТаблицаРегистра.Найти(Запись.ДатаКалендаря,"ДатаКалендаря");
    		Запись.ВидДня = СтрокаТаблицы.ВидДня;
    	КонецЦикла; 
    Иначе
    	Для Каждого СтрокаТаблицы ИЗ ТаблицаРегистра Цикл
    		НоваяЗаписьРегистра = НаборЗаписей.Добавить();
    		НоваяЗаписьРегистра.Склад 		  = Склад;
    		НоваяЗаписьРегистра.ДатаКалендаря = СтрокаТаблицы.ДатаКалендаря;
    		НоваяЗаписьРегистра.Год			  = Год(СтрокаТаблицы.ДатаКалендаря);
    		НоваяЗаписьРегистра.ВидДня		  = СтрокаТаблицы.ВидДня;
    	КонецЦикла; 
    КонецЕсли;
    
    // запишем набор записей
    НаборЗаписей.Записать();
			
КонецПроцедуры
