
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		//Проверим чтобы указанные статьи больше ничего не использовались в спрвочнике
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтатьиЗатрат", СтатьиЗатрат.ВыгрузитьКолонку("СтатьяЗатрат"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Запрос.Текст = "ВЫБРАТЬ
		                |	УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.Ссылка,
		                |	УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.СтатьяЗатрат
		                |ИЗ
		                |	Справочник.УЗ_ПоказателиАнализаСебестоимости.СтатьиЗатрат КАК УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат
		                |ГДЕ
		                |	НЕ УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.Ссылка = &Ссылка
		                |	И УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.СтатьяЗатрат В (&СтатьиЗатрат)";
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке("Статья затрат " + СокрЛП(Результат.СтатьяЗатрат) + " уже указана в элементе " + СокрЛП(Результат.Ссылка), Отказ);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
