//Blik 140317 63242 н
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		ОбъектыПечати.ЗагрузитьЗначения(ПараметрыПечати);
		ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Печать") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Печать", "Печать",
			ПечатьПриказНаМО(МассивОбъектов, ПараметрыПечати), ,
			"Документ.itilprofКомплектацияАктивов.ПечатьКомплектации");
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПечатьПриказНаМО(МассивОбъектов, ПараметрыПечати) Экспорт
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьМО";
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		// запоминаем области макета
		Макет = ПолучитьМакет("ПечатьМО");
		Для каждого Ссылка из МассивОбъектов Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
			// получаем данные для печати
			ВыборкаДляШапкиИПодвала = СформироватьЗапросДляПечати("ПоРеквизитамДокумента",ссылка).Выбрать();
			ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента",ссылка).Выбрать();
			
			// подсчитываем количество страниц документа - для корректного разбиения на страницы
			ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
			
			
			Если ВсегоСтрокДокумента = 1 Тогда
				Если ВыборкаДляШапкиИПодвала.Следующий() Тогда
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Шапка документа.
					ОбластьМакета.Параметры.НазваниеОрганизации	= Врег(СокрЛП(Строка(ВыборкаДляШапкиИПодвала.НазваниеОрганизации)));
					ОбластьМакета.Параметры.ДолжностьРуководителя=ПРГ_Обработки.ПолучитьДолжностьРуководителя(Ссылка);
					ОбластьМакета.Параметры.ФИОРуководителя=ПРГ_Обработки.ПолучитьПодписьРуководителя(Ссылка);
					ОбластьМакета.Параметры.Город="г. Липецк";
					
					//НазваниеПериода=ПредставлениеПериода(НачалоДня(СсылкаНаОбъект.ДатаНачалаБП), КонецДня(СсылкаНаОбъект.ДатаОкончанияБП));
					
				КонецЕсли;
				
				Пока ВыборкаРаботники.Следующий() Цикл
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
					ОбластьМакета.Параметры.ВремяОсвобожденияС = Лев(СокрЛП(Строка(Формат(ВыборкаРаботники.ВремяОсвобожденияС, "ДЛФ=В"))),5); 
					ОбластьМакета.Параметры.ВремяОсвобожденияПо = Лев(СокрЛП(Строка(Формат(ВыборкаРаботники.ВремяОсвобожденияПо, "ДЛФ=В"))),5);
					ОбластьМакета.Параметры.ДатаОсвобожения = Формат(ВыборкаРаботники.ДатаОсвобожения, "ДЛФ=Д");
					
					//ОбластьМакета.Параметры.ПодразделениеРаботника=ПолучитьДопофисСлужбуОтделПодразделения(ВыборкаРаботники.ПодразделениеРаботника);//+ Dansur  04.04.2013 9:48:39
					
					//Если НЕ УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), НРег(Формат(ВыборкаПоДокументу.НачалоПогашения,"ДФ='ММММ гггг'")), 2, , ПериодПогашения) тогда
					//	
					//КонецЕсли;
					//в теле приказа склоняем падеж 4
					РезультатСклонения = "";
					//Если УниверсальныеМеханизмы.Просклонять(ПолучитьКомпонентуСклонения("глКомпонентаСклоненияФИО"), ВыборкаРаботники.Сотрудник, 4,ВыборкаРаботники.Пол, РезультатСклонения) Тогда
						РезультатСклонения = ПадежФИО(СокрЛП(Строка(ВыборкаРаботники.СотрудникФИО)),4,Ложь," ");
					Если не РезультатСклонения="" Тогда
						ОбластьМакета.Параметры.СотрудникФИО1	= РезультатСклонения
					КонецЕсли;
					//в основании приказа склоняем падеж 2
					РезультатСклонения = "";
						РезультатСклонения = ПадежФИО(СокрЛП(Строка(ВыборкаРаботники.СотрудникФИО)),2,Ложь," ");
					Если не РезультатСклонения="" Тогда
						ОбластьМакета.Параметры.СотрудникФИО2	= РезультатСклонения
					КонецЕсли;

					ТабДокумент.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
			Иначе
				сч=0;
				Пока ВыборкаРаботники.Следующий() Цикл
					Если сч>0 Тогда
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					Если ВыборкаДляШапкиИПодвала.Следующий() Тогда
						
						ОбластьМакета.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Шапка документа.
						ОбластьМакета.Параметры.НазваниеОрганизации	= Врег(СокрЛП(Строка(ВыборкаДляШапкиИПодвала.НазваниеОрганизации)));
						ОбластьМакета.Параметры.ДолжностьРуководителя=ПРГ_Обработки.ПолучитьДолжностьРуководителя(Ссылка);
						ОбластьМакета.Параметры.ФИОРуководителя=ПРГ_Обработки.ПолучитьПодписьРуководителя(Ссылка);
						ОбластьМакета.Параметры.Город="г. Липецк";
						
						
						//НазваниеПериода=ПредставлениеПериода(НачалоДня(СсылкаНаОбъект.ДатаНачалаБП), КонецДня(СсылкаНаОбъект.ДатаОкончанияБП));
						
					КонецЕсли;
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
					//ОбластьМакета.Параметры.ПодразделениеРаботника=ПолучитьДопофисСлужбуОтделПодразделения(ВыборкаРаботники.ПодразделениеРаботника);//+ Dansur  04.04.2013 9:48:39
					
					//Если НЕ УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), НРег(Формат(ВыборкаПоДокументу.НачалоПогашения,"ДФ='ММММ гггг'")), 2, , ПериодПогашения) тогда
					//	
					//КонецЕсли;
					//в теле приказа склоняем падеж 4
					РезультатСклонения = "";
						РезультатСклонения = ПадежФИО(СокрЛП(Строка(ВыборкаРаботники.СотрудникФИО)),4,Ложь," ");
					Если не РезультатСклонения="" Тогда
						ОбластьМакета.Параметры.СотрудникФИО1	= РезультатСклонения
					КонецЕсли;
                    //в основании приказа склоняем падеж 3
					РезультатСклонения = "";
						РезультатСклонения = ПадежФИО(СокрЛП(Строка(ВыборкаРаботники.СотрудникФИО)),3,Ложь," ");
					Если не РезультатСклонения="" Тогда
						ОбластьМакета.Параметры.СотрудникФИО2	= РезультатСклонения
					КонецЕсли;
					
					ТабДокумент.Вывести(ОбластьМакета);
					сч=сч+1;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;	
		ТабДокумент.АвтоМасштаб=Истина;
		Возврат ТабДокумент;
		//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 0, Ложь, ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка,"Приказ МО "));
		
	КонецФункции
	
	Функция СформироватьЗапросДляПечати(Режим,ссылка)
		
		Запрос = Новый Запрос;
		
		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента",	Ссылка.Дата);
		
		Если Режим = "ПоРеквизитамДокумента" Тогда
			
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница",Ссылка.Организация);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Запрос.Текст = ФормированиеПечатныхФормЗК.ПолучитьТекстЗапросаПоОтветственнымЛицам(
			"ДатаДокумента",
			"ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
			|И СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ОтветственныеЛицаОрганизаций.Должность КАК ДолжностьРуководителя,
			|	ОтветственныеЛицаОрганизаций.НаименованиеОтветственногоЛица КАК ФИОРуководителя,
			|	ПРГ_ОтражениеВремениОтсутствия.Дата,
			|	ПРГ_ОтражениеВремениОтсутствия.Номер КАК Номер,
			|	ПРГ_ОтражениеВремениОтсутствия.Организация.НаименованиеПолное КАК НазваниеОрганизации
			|ИЗ
			|	Документ.ПРГ_ОтражениеВремениОтсутствия КАК ПРГ_ОтражениеВремениОтсутствия
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеОбОтветственномЛице КАК ОтветственныеЛицаОрганизаций
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ПРГ_ОтражениеВремениОтсутствия.Ссылка = &Ссылка";
			
		ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
			
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Ссылка.Организация));
			Запрос.УстановитьПараметр("ВидИРВ", Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Медицинский Осмотр"));
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.Сотрудник как Сотрудник,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.Дата как ДатаОсвобожения,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.Часов,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.ВидИРВ,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.Сотрудник.Наименование КАК СотрудникФИО,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.ВремяОтсутствияС КАК ВремяОсвобожденияС,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.ВремяОтсутствияПо КАК ВремяОсвобожденияПо,
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.Сотрудник.Физлицо.Пол КАК Пол
			|ИЗ
			|	Документ.ПРГ_ОтражениеВремениОтсутствия.Сотрудники КАК ПРГ_ОтражениеВремениОтсутствияСотрудники
			|ГДЕ
			|	ПРГ_ОтражениеВремениОтсутствияСотрудники.ВидИРВ = &ВидИРВ
			|	И ПРГ_ОтражениеВремениОтсутствияСотрудники.Ссылка = &Ссылка";
			
		Иначе
			Возврат Неопределено;
			
		КонецЕсли;
		
		Возврат Запрос.Выполнить();
		
	КонецФункции // СформироватьЗапросДляПечати()
#КонецЕсли
     Функция ПадежФИО(Знач ФИО,Падеж=1,ТолькоИнициалы=Ложь, Знач пРазделитель=".") 
         Если ТипЗнч(ФИО)<>Тип("Строка") Тогда
             Сообщить("Неверная строка передана ""падежу ФИО!"""); Возврат ФИО;
         КонецЕсли;
 
         // уберем множественные пробелы
        Пока Найти(ФИО,"  ") Цикл
             ФИО=СокрЛП(СтрЗаменить(ФИО,"  "," "));
		КонецЦикла;
		 
		 Если ТипЗнч(Падеж)=Тип("Строка") Тогда
             пад=СокрЛП(НРег(Лев(Падеж,1))); 
             Если Найти("ирдвтп",пад)=0 Тогда
                 Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
             КонецЕсли;
         ИначеЕсли ТипЗнч(Падеж)=Тип("Число") Тогда
             Если (Падеж<1) или (Падеж>6) Тогда
                 Сообщить("Неверный падеж передан ""падежу ФИО""!"); Возврат ФИО;
             КонецЕсли; 
             пад=Падеж-1;
         КонецЕсли;
 
         ФИО=СокрЛП(НРег(ФИО)); // так удобнее
 
         // свой анализатор состава
         Фамилия="";
         Для й=1 По СтрДлина(ФИО) Цикл
             символс=Сред(ФИО,й,1);
             Если символс=" " Тогда Прервать КонецЕсли;
             Фамилия=Фамилия+символс;
         КонецЦикла;
         ы=й+1; // перешли пробел
         Имя="";
         Для й=ы По СтрДлина(ФИО) Цикл
             символс=Сред(ФИО,й,1);
             Если символс=" " Тогда Прервать КонецЕсли;
             Имя=Имя+символс;
         КонецЦикла;
         ы=й+1; // перешли второй пробел
         Отчество="";
         Для й=ы По СтрДлина(ФИО) Цикл
             символс=Сред(ФИО,й,1);
             Если символс=" " Тогда Прервать КонецЕсли;
             Отчество=Отчество+символс;
         КонецЦикла;
 
         // теперь имеем раздельно Фамилию, Имя и Отчество. 
         // начинается собственно блок анализа содержания и падежей
 
         // вернем, если сам именительный. Если установлен возврат ТолькоИнициалы, то преобразуем в инициалы
         Если (Лев(Падеж,1)="И") или (Падеж=1) Тогда 
             Если НЕ ТолькоИнициалы или Найти(ФИО, ".") Тогда 
                 Возврат ФИО; // либо уже преобразованная строка, либо не нужно преобразовывать
             КонецЕсли;
             НовоеФИО = ТРег(Фамилия) + " " + Врег(Лев(Имя,1)) + пРазделитель + Врег(Лев(Отчество,1)) + пРазделитель;
             Возврат СокрЛП(НовоеФИО); // на тот случай, если разделитель пробел. Последний срежем
         КонецЕсли;
 
 
         // проанализируем пол М/Ж
         Если Прав(Отчество,1)="а" Тогда Пол="Ж" Иначе Пол="М" КонецЕсли;
 
         // создадим структуру таблицы, хранящей окончания слов
         ток=Новый ТаблицаЗначений;
         ТипСтроки=Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(3));
         ТипЧисла=Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
         ток.Колонки.Добавить("СтарОк",ТипСтроки); // старое окончание 2 символа
         // колонки, хранящие новые окончания слов
         ток.Колонки.Добавить("р"); // родительный
         ток.Колонки.Добавить("д"); // дательный
         ток.Колонки.Добавить("в"); // винительный
         ток.Колонки.Добавить("т"); // творительный
         ток.Колонки.Добавить("п"); // предложный
         // для указания, сколько букв с конца слова отсечь,
         ток.Колонки.Добавить("КолвоСрез",ТипЧисла); // кол-во срезаемых букв
 
         Гласные="аеэоуиыяюьъ"; // список гласных букв в виде строки
 
         // ======== обработаем фамилию ==========
         // заполним таблицу данными для фамилии
 
         Если пол="М" Тогда
             строток=ток.Добавить(); // иванов
             строток.СтарОк="*s";
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
             строток.КолвоСрез=0;
 
             строток=ток.Добавить(); // красинский
             строток.СтарОк="*й"; 
             строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="им"; строток.п="ом";
             строток.КолвоСрез=2; 
 
             строток=ток.Добавить(); // всемогущий
             строток.СтарОк="щий"; 
             строток.р="его"; строток.д="ему"; строток.в="его"; строток.т="им"; строток.п="ем";
             строток.КолвоСрез=2; 
 
             строток=ток.Добавить(); // белый
             строток.СтарОк="ый";
             строток.р="ого"; строток.д="ому"; строток.в="ого"; строток.т="ым"; строток.п="ом";
             строток.КолвоСрез=2;
 
             строток=ток.Добавить(); // палей
             строток.СтарОк="*й";
             строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
             строток.КолвоСрез=1;
 
             строток=ток.Добавить(); // рабинович
             строток.СтарОк="*ч";
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
             строток.КолвоСрез=0;
 
             строток=ток.Добавить(); // починок, зализняк
             строток.СтарОк="*к";
             строток.р="ка"; строток.д="ку"; строток.в="ка"; строток.т="ком"; строток.п="ке";
             строток.КолвоСрез=2;
 
             строток=ток.Добавить(); // шинкарь
             строток.СтарОк="*ь";
             строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
             строток.КолвоСрез=1;
 
             строток=ток.Добавить(); // перельман, оганесян
             строток.СтарОк="*н";
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
             строток.КолвоСрез=0;
 
             строток=ток.Добавить(); // баранкин
             строток.СтарОк="ин";
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ым"; строток.п="е";
             строток.КолвоСрез=0;
 
         ИначеЕсли Пол="Ж" Тогда 
             строток=ток.Добавить(); // склодовская
             строток.СтарОк="ая";
             строток.р="ой"; строток.д="ой"; строток.в="ую"; строток.т="ой"; строток.п="ой";
             строток.КолвоСрез=2;
 
             строток=ток.Добавить(); // иванова
             строток.СтарОк="*а"; 
             строток.р="ой"; строток.д="ой"; строток.в="у"; строток.т="ой"; строток.п="ой";
             строток.КолвоСрез=1;
         КонецЕсли;
 
         // таблица заполнена. считаем 2 последних буквы и поищем их
         Если не ПустаяСтрока(Фамилия) Тогда
             пб=Прав(Фамилия,3); кол="СтарОк"; // ищем по ней
             новФамилия=Фамилия; // если ничего не изменится, так и будет
             стро=ток.Найти(пб,кол);
             Если стро<>Неопределено Тогда // нашли строгое сразу
                 Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
                 новФамилия=Основа+СокрЛП(стро[пад]);
             Иначе
                 // строго не нашли по трем последним символам, ищем по двум символам только по последней
                 пб=Прав(Фамилия,2);
                 стро=ток.Найти(пб,кол);
                 Если стро<>Неопределено Тогда
                     Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
                     новФамилия=Основа+СокрЛП(стро[пад]);
                 Иначе // если по двум не нашли, ищем по одному
                     пб="*"+Прав(пб,1); 
                     стро=ток.Найти(пб,кол);
                     Если стро<>Неопределено Тогда // нашли по последней
                         Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
                         новФамилия=Основа+СокрЛП(стро[пад]);
                     Иначе // по последней не нашли, ищем по виду буквы
                         пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
                         стро=ток.Найти(пб,кол);
                         Если стро<>Неопределено Тогда // нашли по виду
                             Основа=Лев(Фамилия,СтрДлина(Фамилия)-стро.КолвоСрез);
                             новФамилия=Основа+СокрЛП(стро[пад]);
                         КонецЕсли;
                     КонецЕсли;
                 КонецЕсли;
             КонецЕсли;
         Иначе
             новФамилия="";
         КонецЕсли;
 
         // ======== обработаем имя ==========
         // заполним таблицу данными для имени
         ток.Очистить();
 
         Если Пол="М" Тогда
             // обработаем исключения
             Если Имя="лев" Тогда Имя="льв" КонецЕсли;
             Если Имя="павел" Тогда Имя="павл" КонецЕсли;
 
             строток=ток.Добавить(); // сергей
             строток.старок="*й";
             строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // иван + лев + павел
             строток.старок="*s";
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ом"; строток.п="е";
             строток.колвосрез=0;
 
             строток=ток.Добавить(); // никита
             строток.старок="*а";
             строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // лука
             строток.старок="ка";
             строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // иеремия
             строток.старок="ия";
             строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // илья
             строток.старок="*я";
             строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // игорь
             строток.старок="*ь";
             строток.р="я"; строток.д="ю"; строток.в="я"; строток.т="ем"; строток.п="е";
             строток.колвосрез=1;
 
         ИначеЕсли Пол="Ж" Тогда
             // обработаем исключения
             //Если Имя="ольга" Тогда Имя="ольгь" КонецЕсли;
 
             строток=ток.Добавить(); // ирина
             строток.старок="*а";
             строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // инга, ольга
             строток.старок="га";
             строток.р="и"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // эсфирь
             строток.старок="*ь";
             строток.р="и"; строток.д="и"; строток.в="ь"; строток.т="ью"; строток.п="и";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // мария
             строток.старок="ия";
             строток.р="и"; строток.д="и"; строток.в="ю"; строток.т="ей"; строток.п="и";
             строток.колвосрез=1;
 
             строток=ток.Добавить(); // софья
             строток.старок="*я";
             строток.р="и"; строток.д="е"; строток.в="ю"; строток.т="ей"; строток.п="е";
             строток.колвосрез=1;
         КонецЕсли;
 
         // таблица заполнена. считаем 2 последних буквы и поищем их
         Если не ПустаяСтрока(Имя) Тогда
             пб=Прав(Имя,2); кол="СтарОк"; // ищем по ней
             новИмя=Имя; // если ничего не изменится, так и будет
             стро=ток.Найти(пб,кол);
             Если стро<>Неопределено Тогда // нашли строгое сразу
                 Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
                 новИмя=Основа+СокрЛП(стро[пад]);
             Иначе // строго не нашли, ищем только по последней
                 пб="*"+Прав(пб,1); 
                 стро=ток.Найти(пб,кол);
                 Если стро<>Неопределено Тогда // нашли по последней
                     Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
                     новИмя=Основа+СокрЛП(стро[пад]);
                 Иначе // по последней не нашли, ищем по виду буквы
                     пб="*"+?(Найти(Гласные,Прав(пб,1))=0,"s","g");
                     стро=ток.Найти(пб,кол);
                     Если стро<>Неопределено=1 Тогда // нашли по виду
                         Основа=Лев(Имя,СтрДлина(Имя)-стро.КолвоСрез);
                         новИмя=Основа+СокрЛП(стро[пад]);
                     КонецЕсли;
                 КонецЕсли;
             КонецЕсли;
         Иначе
             новИмя="";
         КонецЕсли;
 
         // ======== обработаем отчество, тут проще ==========
         ток.Очистить();
 
         Если Пол="М" Тогда
             строток=ток.Добавить();
             строток.р="а"; строток.д="у"; строток.в="а"; строток.т="ем"; строток.п="е";
             строток.колвосрез=0;
         ИначеЕсли Пол="Ж" Тогда
             строток=ток.Добавить();
             строток.р="ы"; строток.д="е"; строток.в="у"; строток.т="ой"; строток.п="е";
             строток.колвосрез=1;
         КонецЕсли;
         Если не ПустаяСтрока(Отчество) Тогда
             Основа=Лев(Отчество,СтрДлина(Отчество)-ток[0].КолвоСрез); 
             новОтчество=Основа+СокрЛП(ток[0][пад]);
         Иначе
             новОтчество="";
         КонецЕсли; 
 
         Если ТолькоИнициалы Тогда
             новИмя=Лев(новИмя,1); новОтчество=Лев(новОтчество,1);
         КонецЕсли;
 
         // установим первые буквы верхним регистром
         новФамилия=ВРег(Лев(новФамилия,1))+Сред(новФамилия,2);
         новИмя=ВРег(Лев(новИмя,1))+Сред(новИмя,2);
         новОтчество=ВРег(Лев(новОтчество,1))+Сред(новОтчество,2);
 
         // и теперь всё вместе 
         Если ТолькоИнициалы Тогда // если задан формат инициалов
             новФИО=новФамилия+" "+новИмя+пРазделитель+новОтчество+пРазделитель;
         Иначе
             новФИО=новФамилия+" "+новИмя+" "+новОтчество;
         КонецЕсли;
 
         Если Найти(ФИО, ".") Тогда // На тот случай, если входной параметр Фамилию с инициалами. Инициалы не трогаем
             новФИО = новФамилия + " " + ТРег(Имя) + Трег(Отчество);
         КонецЕсли; 
 
         Возврат СокрЛП(новФИО);
     КонецФункции
//Blik 140317 63242 к