
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ПРГ_ОтражениеВремениОтсутствия 
	Движения.ПРГ_ОтражениеВремениОтсутствия.Записывать = Истина;
	Движения.ПРГ_ОтражениеВремениОтсутствия.Очистить();
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.ПРГ_ОтражениеВремениОтсутствия.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Дата = ТекСтрокаСотрудники.Дата;
		Движение.ВидИспользованияРабочегоВремени = ТекСтрокаСотрудники.ВидИспользованияРабочегоВремени;
		Движение.ВидИРВ = ТекСтрокаСотрудники.ВидИРВ;
		Движение.Часов = ТекСтрокаСотрудники.Часов;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

