
&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)	
	СчетПриИзменении(Элемент.Имя,Элементы.СоответсвиеАналитики,"СубконтоКт");
КонецПроцедуры

// Процедура установки типа и доступности субконто в зависимости от  выбранного счета
//
// Параметры:
//      Счет - выбранный счет
//      ТабличнаяЧасть - табличная часть на которой расположены счет и субконто
//      ИмяСубконто - префекс наименования субконто. 
//
&НаКлиенте
Процедура СчетПриИзменении(СчетИмяКолонки,ТабличнаяЧасть,ИмяСубконто)
	ТекущиеДанные = ТабличнаяЧасть.ТекущиеДанные;
	ТабКол        = ТабличнаяЧасть.Колонки;
	
	Счет = ТекущиеДанные[СчетИмяКолонки];
	
	РаботаСДиалогами.ПриВыбореСчетаВТабличномПоле( Счет,
		ТекущиеДанные[ИмяСубконто+"1"], ТабКол[ИмяСубконто+"1"],
		ТекущиеДанные[ИмяСубконто+"2"], ТабКол[ИмяСубконто+"2"],
		ТекущиеДанные[ИмяСубконто+"3"], ТабКол[ИмяСубконто+"3"])
	КонецПроцедуры // ()
	
