Функция ПроверкаДоступности() Экспорт
	
	Состояние("Открытие Excel-файла...");
	ФС = Новый Файл(ПутьКФайлу);
	Если НЕ ФС.Существует() Тогда
		Предупреждение("Нет доступа к файлу загрузки!");
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Функция ОпределитьНоменклатуруПоКоду(Код) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Код
		|";
		
	// ***************************
	
	Запрос.УстановитьПараметр("Код", Код);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция КонецЗагрузки(Лист,НомерСтроки,КоличествоКолоной) Экспорт
	ВсеЯчейкиНеЗаполнены = Истина;
	Для Индекс = 1 По КоличествоКолоной Цикл
		ВсеЯчейкиНеЗаполнены = ВсеЯчейкиНеЗаполнены И (Лист.Cells(НомерСтроки,Индекс).Value = Неопределено);
	КонецЦикла; 
	Возврат ВсеЯчейкиНеЗаполнены;
КонецФункции
