
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	//начало изменений Ожиганов 24.09.2015 дата запрета распоряжение фин. лиректора 
	Если Значение <> Константы.ПрименятьДатуЗапретаДляПолныхПрав.Получить() Тогда
		ЗаписьЖурналаРегистрации("_Измен_Дата_ПолнПрава",УровеньЖурналаРегистрации.Информация,
		,,"изменена константа ПрименятьДатуЗапретаДляПолныхПрав с "+Константы.ПрименятьДатуЗапретаДляПолныхПрав.Получить()+" на "+ Значение);
	КонецЕсли;	
	//конец изменений 	
КонецПроцедуры
