//m_ionov@mail.ru 22.02.2017
//В макет реквизитов добавили МДЖ и МДБ, для вывода этих показателей в акт приемки ПФ (для выпуска ПФ)
//------- m_ionov@mail.ru -------

Функция ПолучитьСписокРеквизитов() Экспорт
	
	СписокРеквизитов = Новый ТаблицаЗначений;
	СписокРеквизитов.Колонки.Добавить("ИмяРеквизита");
	СписокРеквизитов.Колонки.Добавить("ПредставлениеРеквизита");
	СписокРеквизитов.Колонки.Добавить("СокращениеДляСтикера");
	СписокРеквизитов.Колонки.Добавить("Порядок");
	
	Макет = РегистрыСведений.ПРГ_ВидыПоказателейДляГруппировокНоменклатуры.ПолучитьМакет("СписокРеквизитов");
	
	Н = 1;
	
	Пока Макет.Область(Н,1,Н,1).Текст <> "" Цикл
		СтрокаРеквизита = СписокРеквизитов.Добавить();
		СтрокаРеквизита.ИмяРеквизита 			= Макет.Область(Н,1,Н,1).Текст;
		СтрокаРеквизита.ПредставлениеРеквизита 	= Макет.Область(Н,2,Н,2).Текст;
		СтрокаРеквизита.СокращениеДляСтикера 	= Макет.Область(Н,3,Н,3).Текст;
		СтрокаРеквизита.Порядок				 	= Макет.Область(Н,4,Н,4).Текст;
		Н = Н+1;
	КонецЦикла;
	
	СписокРеквизитов.Сортировать("Порядок");
	СписокРеквизитов.Колонки.Удалить("Порядок");
	
	Возврат СписокРеквизитов;
	
КонецФункции
