// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	//СтруктураПечатныхФорм.Вставить("Приказ",	"Приказ");
	
	Возврат СтруктураПечатныхФорм;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	отказ=проверитьзаполнениезапериод();
	если отказ тогда
		возврат;
	Конецесли;
	
	
	
КонецПроцедуры

Функция  проверитьзаполнениезапериод()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРГ_ПриказЛишениеПремии.Ссылка,
		|	ПРГ_ПриказЛишениеПремии.НомерСтроки,
		|	ПРГ_ПриказЛишениеПремии.Сотрудник,
		|	ПРГ_ПриказЛишениеПремии.Процент
		|ИЗ
		|	Документ.ПРГ_Приказ.ЛишениеПремии КАК ПРГ_ПриказЛишениеПремии
		|ГДЕ
		|	(НЕ ПРГ_ПриказЛишениеПремии.Ссылка = &Ссылка)
		|	И ПРГ_ПриказЛишениеПремии.Сотрудник В(&Сотрудник)
		|	И ПРГ_ПриказЛишениеПремии.Ссылка.Период = &Период
		|	И ПРГ_ПриказЛишениеПремии.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПРГ_ПриказЛишениеПремии.Сотрудник.Наименование";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Сотрудник", ЛишениеПремии.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	отказ=ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сообщить("По сотруднику "+ВыборкаДетальныеЗаписи.Сотрудник+" уже сделано лешение документом "+ВыборкаДетальныеЗаписи.ссылка+", номер строки "+ВыборкаДетальныеЗаписи.НомерСтроки);
		отказ=истина;
	КонецЦикла;

	возврат отказ;

	
КонецФункции




