////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьДанныеБольничного(ДокументОбъект, ТекущаяСтрока = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеПоБольничномуЛисту.Ссылка,
	|	НачислениеПоБольничномуЛисту.Сотрудник,
	|	НачислениеПоБольничномуЛисту.ВидРасчета,
	|	НачислениеПоБольничномуЛисту.ВидРасчетаЗаСчетРаботодателя,
	|	НачислениеПоБольничномуЛисту.ДатаНачалаСобытия,
	|	НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности
	|ПОМЕСТИТЬ ВТДокументыЗаполнения
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
	|ГДЕ
	|	НачислениеПоБольничномуЛисту.Проведен
	|	И &ЗаполнятьВсемиДокументами
	|	И НачислениеПоБольничномуЛисту.Организация = &Организация
	|	И НЕ НачислениеПоБольничномуЛисту.Ссылка В
	|				(ВЫБРАТЬ
	|					РеестрДанныхЭЛНЗаполняемыхРаботодателемДанныеЭЛН.ЛистокНетрудоспособности
	|				ИЗ
	|					Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.ДанныеЭЛН КАК РеестрДанныхЭЛНЗаполняемыхРаботодателемДанныеЭЛН
	|				ГДЕ
	|					РеестрДанныхЭЛНЗаполняемыхРаботодателемДанныеЭЛН.Ссылка <> &ТекущийРеестр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеПоБольничномуЛисту.Ссылка,
	|	НачислениеПоБольничномуЛисту.Сотрудник,
	|	НачислениеПоБольничномуЛисту.ВидРасчета,
	|	НачислениеПоБольничномуЛисту.ВидРасчетаЗаСчетРаботодателя,
	|	НачислениеПоБольничномуЛисту.ДатаНачалаСобытия,
	|	НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
	|ГДЕ
	|	НачислениеПоБольничномуЛисту.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыАктуальностиМРОТ.ДатаНачалаСобытия,
	|	МинимальнаяОплатаТрудаРФ.Размер КАК Размер
	|ПОМЕСТИТЬ ВТРазмерМРОТНаДатуДатаНачалаСобытия
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТДокументыЗаполнения.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|		МАКСИМУМ(МинимальнаяОплатаТрудаРФ.Период) КАК ДатаАктуальности
	|	ИЗ
	|		ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
	|			ПО ВТДокументыЗаполнения.Ссылка.ДатаНачалаСобытия >= МинимальнаяОплатаТрудаРФ.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТДокументыЗаполнения.ДатаНачалаСобытия) КАК ДатыАктуальностиМРОТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
	|		ПО (МинимальнаяОплатаТрудаРФ.Период = ДатыАктуальностиМРОТ.ДатаАктуальности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НачислениеПоБольничномуЛистуНачисления.ДатаНачала) КАК ДатаНачалаЗаСчетФСС,
	|	МАКСИМУМ(НачислениеПоБольничномуЛистуНачисления.ДатаОкончания) КАК ДатаОкончанияЗаСчетФСС,
	|	СУММА(НачислениеПоБольничномуЛистуНачисления.Результат) КАК РезультатЗаСчетФСС,
	|	ВТДокументыЗаполнения.Ссылка
	|ПОМЕСТИТЬ ВТОплатаЗаСчетФСС
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
	|		ПО ВТДокументыЗаполнения.Ссылка = НачислениеПоБольничномуЛистуНачисления.Ссылка
	|			И ВТДокументыЗаполнения.ВидРасчета = НачислениеПоБольничномуЛистуНачисления.ВидРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НачислениеПоБольничномуЛистуНачисления.ДатаНачала) КАК ДатаНачалаЗаСчетРаботодателя,
	|	МАКСИМУМ(НачислениеПоБольничномуЛистуНачисления.ДатаОкончания) КАК ДатаОкончанияЗаСчетРаботодателя,
	|	СУММА(НачислениеПоБольничномуЛистуНачисления.Результат) КАК РезультатЗаСчетРаботодателя,
	|	ВТДокументыЗаполнения.Ссылка
	|ПОМЕСТИТЬ ВТОплатаЗаСчетРаботодателя
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
	|		ПО ВТДокументыЗаполнения.Ссылка = НачислениеПоБольничномуЛистуНачисления.Ссылка
	|			И ВТДокументыЗаполнения.ВидРасчетаЗаСчетРаботодателя = НачислениеПоБольничномуЛистуНачисления.ВидРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыЗаполнения.Ссылка,
	|	СУММА(НачислениеПоБольничномуЛистуРасчетСреднего2011.Заработок) КАК БазаДляРасчетаСреднего
	|ПОМЕСТИТЬ ВТБазаДляРасчетаСреднего
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту.РасчетСреднего2011 КАК НачислениеПоБольничномуЛистуРасчетСреднего2011
	|		ПО ВТДокументыЗаполнения.Ссылка = НачислениеПоБольничномуЛистуРасчетСреднего2011.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыЗаполнения.Ссылка,
	|	СУММА(НачислениеПоБольничномуЛистуНачисления.Результат) КАК Результат
	|ПОМЕСТИТЬ ВТСреднийЗаработок
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
	|		ПО ВТДокументыЗаполнения.Ссылка = НачислениеПоБольничномуЛистуНачисления.Ссылка
	|ГДЕ
	|	НачислениеПоБольничномуЛистуНачисления.Результат > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиОрганизаций.ВидЗанятости,
	|	СотрудникиОрганизаций.Физлицо.ИНН КАК ИНН,
	|	СотрудникиОрганизаций.Физлицо.СтраховойНомерПФР КАК СНИЛС,
	|	ВТДокументыЗаполнения.Ссылка,
	|	СотрудникиОрганизаций.Физлицо,
	|	СотрудникиОрганизаций.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТДанныеСотрудника
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ВТДокументыЗаполнения.Сотрудник = СотрудникиОрганизаций.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыЗаполнения.Ссылка КАК ЛистокНетрудоспособности,
	|	ВТДокументыЗаполнения.Сотрудник,
	|	ВТДокументыЗаполнения.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ВТДокументыЗаполнения.Ссылка.ДатаВыходаНаРаботу КАК ДатаВыходаНаРаботу,
	|	ВТДокументыЗаполнения.Ссылка.УсловияИсчисленияКод1 КАК УсловияИсчисленияКод1,
	|	ВТДокументыЗаполнения.Ссылка.УсловияИсчисленияКод2 КАК УсловияИсчисленияКод2,
	|	ВТДокументыЗаполнения.Ссылка.УсловияИсчисленияКод3 КАК УсловияИсчисленияКод3,
	|	ВТДокументыЗаполнения.Ссылка.ДатаАктаН1 КАК ДатаАктаН1,
	|	ВТДокументыЗаполнения.Ссылка.ДатаНачалаРаботы КАК ДатаНачалаРаботы,
	|	ВТДокументыЗаполнения.Ссылка.СтажЛет КАК СтажЛет,
	|	ВТДокументыЗаполнения.Ссылка.СтажМесяцев КАК СтажМесяцев,
	|	ВТДокументыЗаполнения.Ссылка.СтажБезНестраховыхПериодовЛет КАК СтажБезНестраховыхПериодовЛет,
	|	ВТДокументыЗаполнения.Ссылка.СтажБезНестраховыхПериодовСтажМесяцев КАК СтажБезНестраховыхПериодовСтажМесяцев,
	|	ВТДокументыЗаполнения.Ссылка.ДатаНачалаОплаты КАК ДатаНачалаОплаты,
	|	ДОБАВИТЬКДАТЕ(ВТДокументыЗаполнения.Ссылка.ДатаНачалаОплаты, ДЕНЬ, ВТДокументыЗаполнения.Ссылка.ДнейОплаты - 1) КАК ДатаОкончанияОплаты,
	|	ВТДокументыЗаполнения.Ссылка.ВыплатаЗаСчетФедеральногоБюджета КАК ВыплатаЗаСчетФедеральногоБюджета,
	|	ВЫБОР
	|		КОГДА ВТДокументыЗаполнения.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	|				ИЛИ НЕ ВТДокументыЗаполнения.Ссылка.РасчетПоПравилам2010Года
	|			ТОГДА ВЫБОР
	|					КОГДА ВТБазаДляРасчетаСреднего.БазаДляРасчетаСреднего > ЕСТЬNULL(ВТРазмерМРОТНаДатуДатаНачалаСобытия.Размер, 0)
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТДанныеСотрудника.ЗанимаемыхСтавок, 0) <= 0
	|									ТОГДА 1
	|								КОГДА ЕСТЬNULL(ВТДанныеСотрудника.ЗанимаемыхСтавок, 0) > 1
	|									ТОГДА 1
	|								ИНАЧЕ ЕСТЬNULL(ВТДанныеСотрудника.ЗанимаемыхСтавок, 0)
	|							КОНЕЦ * 24 / 730 * ВТБазаДляРасчетаСреднего.БазаДляРасчетаСреднего
	|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТРазмерМРОТНаДатуДатаНачалаСобытия.Размер, 0) * ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТДанныеСотрудника.ЗанимаемыхСтавок, 0) = 0
	|									ТОГДА 1
	|								ИНАЧЕ ЕСТЬNULL(ВТДанныеСотрудника.ЗанимаемыхСтавок, 0)
	|							КОНЕЦ * 24 / 730 КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		КОГДА НЕ ВТДокументыЗаполнения.Ссылка.РасчетПособияИзТарифнойСтавки
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СреднийДневнойЗаработок,
	|	ВТБазаДляРасчетаСреднего.БазаДляРасчетаСреднего КАК БазаДляРасчетаСреднегоЗаработка,
	|	ВТОплатаЗаСчетФСС.ДатаНачалаЗаСчетФСС КАК ДатаНачалаОплатыФСС,
	|	ВТОплатаЗаСчетФСС.ДатаОкончанияЗаСчетФСС КАК ДатаОкончанияОплатыФСС,
	|	ВТОплатаЗаСчетФСС.РезультатЗаСчетФСС КАК СуммаОплатыЗаСчетФСС,
	|	ВТОплатаЗаСчетРаботодателя.РезультатЗаСчетРаботодателя КАК СуммаОплатыЗаСчетРаботодателя,
	|	ВТДанныеСотрудника.ИНН,
	|	ВТДанныеСотрудника.СНИЛС,
	|	ВТДанныеСотрудника.ВидЗанятости,
	|	ВТДокументыЗаполнения.Ссылка.Хеш КАК Хеш,
	|	ВТДанныеСотрудника.Физлицо,
	|	ВТДокументыЗаполнения.Ссылка.ДнейОплаты КАК ДнейОплаты
	|ИЗ
	|	ВТДокументыЗаполнения КАК ВТДокументыЗаполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплатаЗаСчетФСС КАК ВТОплатаЗаСчетФСС
	|		ПО ВТДокументыЗаполнения.Ссылка = ВТОплатаЗаСчетФСС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплатаЗаСчетРаботодателя КАК ВТОплатаЗаСчетРаботодателя
	|		ПО ВТДокументыЗаполнения.Ссылка = ВТОплатаЗаСчетРаботодателя.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляРасчетаСреднего КАК ВТБазаДляРасчетаСреднего
	|		ПО ВТДокументыЗаполнения.Ссылка = ВТБазаДляРасчетаСреднего.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСреднийЗаработок КАК ВТСреднийЗаработок
	|		ПО ВТДокументыЗаполнения.Ссылка = ВТСреднийЗаработок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСотрудника КАК ВТДанныеСотрудника
	|		ПО ВТДокументыЗаполнения.Ссылка = ВТДанныеСотрудника.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерМРОТНаДатуДатаНачалаСобытия КАК ВТРазмерМРОТНаДатуДатаНачалаСобытия
	|		ПО ВТДокументыЗаполнения.ДатаНачалаСобытия = ВТРазмерМРОТНаДатуДатаНачалаСобытия.ДатаНачалаСобытия";
	
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ТекущийРеестр", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЗаполнятьВсемиДокументами", ТекущаяСтрока = Неопределено);
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Запрос.УстановитьПараметр("Ссылка", ТекущаяСтрока.ЛистокНетрудоспособности);
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Документы.НачислениеПоБольничномуЛисту.ПустаяСсылка());
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);			
		КонецЕсли;
	Иначе
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ДокументОбъект.ДанныеЭЛН.Очистить();
			Возврат;
		КонецЕсли;
		
		ДокументОбъект.ДанныеЭЛН.Загрузить(Результат.Выгрузить());
				
	КонецЕсли;

КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Процедура вывода сведений на печать
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
			
КонецФункции // Печать() 

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Процедура Автозаполнение(ДокументОбъект, ТекущаяСтрока = Неопределено) Экспорт
	
	ЗаполнитьДанныеБольничного(ДокументОбъект, ТекущаяСтрока);
	
КонецПроцедуры



