
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПРГ_ТабельСоревнований Приход
	
	Движения.ПРГ_ТабельСоревнований.Записывать = Истина;
	Движения.ПРГ_ТабельСоревнований.Очистить();
	Если ТипИнформации=0 тогда
		Для Каждого ТекСтрокаТабель Из Табель Цикл
			Для сч=1 По день(КонецМесяца(период)) Цикл
				
				Движение = Движения.ПРГ_ТабельСоревнований.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = ТекСтрокаТабель.Сотрудник;
				Движение.РабочиеЦентры = ТекСтрокаТабель.РабочиеЦентры;
				Движение.Месяц = НачалоМесяца(Период);
				Движение.Период = Дата(год(Период),месяц(Период),сч);
				Движение.Количество = ТекСтрокаТабель["д"+строка(сч)];
			КонецЦикла;
		КонецЦикла;
	Конецесли;
	// регистр ПРГ_ТабельСоревнованийПоказатели Приход
	Движения.ПРГ_ТабельСоревнованийПоказатели.Записывать = Истина;
	Движения.ПРГ_ТабельСоревнованийПоказатели.Очистить();
	если ТипИнформации=1 тогда
		Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
			Движение = Движения.ПРГ_ТабельСоревнованийПоказатели.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.РабочиеЦентры = ТекСтрокаПоказатели.РабочиеЦентры;
			Движение.Месяц = НачалоМесяца(Период);
			Движение.Эффективность = ТекСтрокаПоказатели.Эффективность;
			Движение.СанитарноеСостояние = ТекСтрокаПоказатели.СанитарноеСостояние;
			Движение.УровеньБрака = ТекСтрокаПоказатели.УровеньБрака;
		КонецЦикла;
	Конецесли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
