
Процедура ПередЗаписью(Отказ)
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	// Вставить содержимое обработчика.
	Если СсылкаНаОбъект  = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Необходимо выбрать вид справочника/документа!!!");
		возврат;
	КонецЕсли;	
	
	МетаСсылки = СсылкаНаОбъект.Метаданные();
	Если  Метаданные.Справочники.Содержит(МетаСсылки) Тогда
		   сВидОбъекта = "Спр.";
	Иначе
		   сВидОбъекта = "Док.";
	КонецЕсли; 
	
	ВидОбъекта  = сВидОбъекта+""+СокрЛП(МетаСсылки.Имя);
	   
	
КонецПроцедуры
