
Функция ПроверитьФорматКодаPL(КодPL, ЭтоГруппа, ВыводитьСообщения=Истина) Экспорт 
	лСоответствует = Истина;
	
	Если ЗначениеЗаполнено(КодPL) Тогда 
		Пока Лев(КодPL,1)="-" 
		 Или Прав(КодPL,1)="-" Цикл 
		 	Если Лев(КодPL,1) = "-" Тогда 
			 	КодPL = СокрЛП(Сред(КодPL,2));
			КонецЕсли;
		 	Если Прав(КодPL,1) = "-" Тогда 
			 	КодPL = СокрЛП(Сред(КодPL,1,СтрДлина(КодPL)-1));
			КонецЕсли;
		КонецЦикла;
		Если ЭтоГруппа Тогда 
			Если СтрДлина(КодPL) <> 9 
			 И СтрДлина(КодPL) <> 6 
			 И СтрДлина(КодPL) <> 3 Тогда 
				лСоответствует = Ложь;
				Если ВыводитьСообщения Тогда 
					Сообщить("Код PL группы не соответствует формату", СтатусСообщения.ОченьВажное);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтрДлина(КодPL) <> 9 Тогда 
				лСоответствует = Ложь;
				Если ВыводитьСообщения Тогда 
					Сообщить("Код PL не соответствует формату", СтатусСообщения.ОченьВажное);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		лСоответствует = Ложь;
		Если ВыводитьСообщения Тогда 
			Сообщить("Код PL не заполнен", СтатусСообщения.ОченьВажное);
		КонецЕсли;
	КонецЕсли;
	
	Возврат лСоответствует;
КонецФункции
