
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Для каждого СтрокаПроверки Из БазаДляРасчета Цикл
		    Если Не ЗначениеЗаполнено(СтрокаПроверки.Проект) И Не ЗначениеЗаполнено(СтрокаПроверки.Брендообъем) И Не ЗначениеЗаполнено(СтрокаПроверки.ТоварнаяКатегория) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Данные для расчета содержат пустые строки", Отказ);	
			КонецЕсли;		
		КонецЦикла; 
	КонецЕсли;	

КонецПроцедуры
