
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Если КоэффициентКласса > 1 Тогда
	
		ОбщегоНазначения.СообщитьОбОшибке("Коэффициент класса больше 1!", Ложь, "Отмена записи классификатора торговых точек");	
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если НЕ Родитель.Пустая() Тогда
		Префикс = ВернутьПрефиксСправочника(Родитель.Код);	
	КонецЕсли; 
	
КонецПроцедуры

Функция ВернутьПрефиксСправочника(Знач КодСПрефиксом)
	
	Если Найти(КодСПрефиксом,"0") = 0 Тогда
	
		Возврат КодСПрефиксом;
	
	КонецЕсли; 
	
	НомерБезПрефикса = КодСПрефиксом; 
	Префикс = "";
	Пока Найти(НомерБезПрефикса,"0") <> 1 Цикл
		Префикс = Префикс + Лев(НомерБезПрефикса,1);
		НомерБезПрефикса = Сред(НомерБезПрефикса,2); //удаляет лидирующие ненули
	КонецЦикла;

	Возврат Префикс;
	
КонецФункции // ()
 
Процедура УствановитьНаименованиеПоУмолчанию() Экспорт 

	//{14.07.2017 Островерхий заявка №68177 
	Если ЭтоНовый() Тогда
		ЭтотОбъект.УстановитьНовыйКод();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Код;	
	КонецЕсли; 	 
	//14.07.2017 Островерхий} 

КонецПроцедуры
 