
Процедура ПередЗаписью(Отказ)
	
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	
	лМенеджер = Справочники[Метаданные().Имя];
	
	Если РасчетПоФормуле Тогда 
		
		Если Не ЗначениеЗаполнено(ВидРазницы) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Вид разницы>", СтатусСообщения.Внимание);
		КонецЕсли;
		
		ФормулаРасчетаБалансовойСтоимости = СокрЛП(ФормулаРасчетаБалансовойСтоимости);
		Если ЗначениеЗаполнено(ФормулаРасчетаБалансовойСтоимости) Тогда 
			лОшибки = лМенеджер.ПроверитьКорректностьФормулы(ФормулаРасчетаБалансовойСтоимости);
			Если лОшибки.Количество() > 0 Тогда 
				Отказ = Истина;
				Для Каждого лОшибка Из лОшибки Цикл 
					Сообщить(лОшибка, СтатусСообщения.Внимание);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Отказ = Истина;
			Сообщить("Не заполнено поле <Формула расчет балансовой стоимости>", СтатусСообщения.Внимание);
		КонецЕсли;
		
		ФормулаРасчетаНалоговойБазы = СокрЛП(ФормулаРасчетаНалоговойБазы);
		Если ЗначениеЗаполнено(ФормулаРасчетаНалоговойБазы) Тогда 
			лОшибки = лМенеджер.ПроверитьКорректностьФормулы(ФормулаРасчетаНалоговойБазы);
			Если лОшибки.Количество() > 0 Тогда 
				Отказ = Истина;
				Для Каждого лОшибка Из лОшибки Цикл 
					Сообщить(лОшибка, СтатусСообщения.Внимание);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Отказ = Истина;
			Сообщить("Не заполнено поле <Формула расчет налоговой базы>", СтатусСообщения.Внимание);
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Регистр) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Регистр>", СтатусСообщения.Внимание);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Ресурс) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнено поле <Ресурс>", СтатусСообщения.Внимание);
		КонецЕсли;
		Для Каждого лСтрокаУсловия Из Условия Цикл 
			Если Не ЗначениеЗаполнено(лСтрокаУсловия.Параметр) Тогда 
				Отказ = Истина;
				Сообщить("В строке №"+лСтрокаУсловия.НомерСтроки+" не заполнено поле <Параметр>", СтатусСообщения.Внимание);
			КонецЕсли;
		КонецЦикла;
		
		Если Найти(Регистр, "РегистрБухгалтерии") > 0 Тогда 
			лСтрокаСчета = Условия.Найти("Счет", "ТипПараметра");
			Если лСтрокаСчета = Неопределено
			 И Не лСтрокаСчета.Использование Тогда 
			 	Отказ = Ложь;
				Сообщить("Не задан счет для регистра бухгалтерии");
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда 
			лЗапрос = лМенеджер.СформироватьЗапрос(ЭтотОбъект);
			ТекстЗапроса = лЗапрос.Текст;
			ПараметрыЗапроса = Новый ХранилищеЗначения(лЗапрос.Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

