
// is Зайцева 20140702 
Процедура ПриЗаписи(Отказ, Замещение)
	          
	Если ДополнительныеСвойства.Свойство("Договор") Тогда
		
		лДоговор = ДополнительныеСвойства.Договор;
		
		лЗапрос = Новый Запрос;
		лЗапрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДС_ГрафикПлатежей.Договор,
			|	СУММА(ДС_ГрафикПлатежей.LeasePaymentProvided) КАК LeasePaymentProvided
			|ИЗ
			|	РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
			|ГДЕ
			|	ДС_ГрафикПлатежей.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	ДС_ГрафикПлатежей.Договор";
			
		лЗапрос.УстановитьПараметр("Договор", лДоговор);
		лТЗ = лЗапрос.Выполнить().Выгрузить();
		лТЗ.Свернуть(, "LeasePaymentProvided");
		
		лДоговорОбъект = лДоговор.ПолучитьОбъект();
		Если лДоговорОбъект <> Неопределено и лТЗ.Количество() Тогда 
			Если лДоговорОбъект.ис_СуммаВсехЛизинговыхПлатежей = лТЗ[0].LeasePaymentProvided Тогда
			Иначе
				/// Кунов О.В., 10.11.2014 - 
				Если ДополнительныеСвойства.Свойство("ЗагружаетсяИзОбработки") Тогда
					Ответ = Истина;
				Иначе
					Ответ = (Вопрос("Изменить сумму договора в соответствии с рассчитанным графиком?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);
				КонецЕсли;
				
				Если Ответ Тогда 
				///
					лДоговорОбъект.ис_СуммаВсехЛизинговыхПлатежей = лТЗ[0].LeasePaymentProvided;
					лДоговорОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
