

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	СтруктураОбязательныхПолей = Новый Структура("Организация,Событие");
	Заголовок = "";
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
	ВидыСобытий = ПолучитьСписокЗначенийВидыСобытий();
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.Событие.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(Событие.ВидСобытияОС,
							  ВидыСобытий,
							  ПредставлениеРеквизита,Отказ);
							  
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
	
		// регистр СобытиеОСВлизинге
	Движения.СобытиеОСВлизинге.Записывать = Истина;
	Для Каждого ТекСтрокаОС Из ОС Цикл
		Движение = Движения.СобытиеОСВлизинге.Добавить();
		Движение.Период = Дата;
		//начало изменений БП 10
		Движение.Организация = Организация;
		//конец изменений БП 10
		Движение.ОС = ТекСтрокаОС.ОС;
		Движение.Событие = Событие;
	КонецЦикла;
	
	//начало изменений БП 10
	СостоянияОСЛизинг 	= Движения.СостоянияОСЛизинг;
	для каждого стр из ОС цикл
		Движение =   СостоянияОСЛизинг.Добавить();
		Движение.Период			 = Дата;
		Движение.ОсновноеСредство= стр.ОС;
		Движение.Организация 	 = Организация;
		Движение.Состояние	 	 = Перечисления.СостоянияОС.СнятоСУчета;
		Движение.ДатаСостояния   = Дата;
	Конеццикла;	
	
	//начало изменений БП 10

	// регистр Хозрасчетный 
	
	Запрос = Новый Запрос;
	//начало изменений БП 10
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ХозрасчетныйОстатки.Счет,
	//	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//	|	ХозрасчетныйОстатки.Субконто2 КАК ОС,
	//	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма
	//	|ИЗ
	//	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&дата, счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеОсновныеСредства), , Субконто2 В (&ОС)) КАК ХозрасчетныйОстатки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ХозрасчетныйОстатки.Счет,
	//	|	ХозрасчетныйОстатки.Субконто2,
	//	|	ХозрасчетныйОстатки.Субконто1";
	
	Запрос .Текст = "ВЫБРАТЬ
	                |	ХозрасчетныйОстатки.Счет,
	                |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	                |	ХозрасчетныйОстатки.Субконто2 КАК ОССубконто,
	                |	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0)) КАК Сумма,
	                |	ВозвратОСПоЛизингуОС.ОС КАК ОС
	                |ИЗ
	                |	Документ.ВозвратОСПоЛизингу.ОС КАК ВозвратОСПоЛизингуОС
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	                |				&дата,
	                |				счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеОсновныеСредства),
	                |				&МассивСубконто,
	                |				организация = &Организация
	                |					И Субконто2 В
	                |						(ВЫБРАТЬ
	                |							ВозвратОСПоЛизингуОС.ОС
	                |						ИЗ
	                |							Документ.ВозвратОСПоЛизингу.ОС КАК ВозвратОСПоЛизингуОС
	                |						ГДЕ
	                |							ВозвратОСПоЛизингуОС.Ссылка = &Ссылка)) КАК ХозрасчетныйОстатки
	                |		ПО ВозвратОСПоЛизингуОС.ОС = ХозрасчетныйОстатки.Субконто2
	                |ГДЕ
	                |	ВозвратОСПоЛизингуОС.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ХозрасчетныйОстатки.Счет,
	                |	ХозрасчетныйОстатки.Субконто2,
	                |	ХозрасчетныйОстатки.Субконто1,
	                |	ВозвратОСПоЛизингуОС.ОС";

	Запрос.УстановитьПараметр("дата", МоментВремени());
	//Запрос.УстановитьПараметр("ОС", ОС.ВыгрузитьКолонку("ОС"));
	Запрос.УстановитьПараметр("Организация",Организация);
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//конец изменений БП 10
	

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    ПроводкиБУ=Движения.Хозрасчетный;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//начало изменений БП 10 
		//Если ВыборкаДетальныеЗаписи.сумма=0 тогда Продолжить;КонецЕсли;
		//конец изменений БП 10
		Проводка   = ПроводкиБУ.Добавить();
		
		Проводка.Период                  = Дата;
		Проводка.Организация             = Организация;
		Проводка.Содержание              = "ОС по лизингу";
		Проводка.сумма              = ВыборкаДетальныеЗаписи.сумма;
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.АрендованныеОсновныеСредства;
		
		//начало изменений БП 10
		Если ВыборкаДетальныеЗаписи.сумма =0 тогда
			// пока не жестко
			ОбщегоНазначения.СообщитьОбОшибке("Не определена сумма для основного средства "+ВыборкаДетальныеЗаписи.ОС);
		КонецЕсли;	
		//конец изменений БП 10
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства"		,ВыборкаДетальныеЗаписи.ОС);
		//////МестонахождениеОСБухгалтерскийУчет		
	КонецЦикла;
	//начало изменений БП 10 
// 	ПроводкиБУ.Записать(Истина);
	//конец изменений БП 10 
КонецПроцедуры

Функция ПолучитьСписокЗначенийВидыСобытий() Экспорт
	
	ВидыСобытий = Новый СписокЗначений;
	ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.Списание);
	
	Возврат ВидыСобытий;
	
КонецФункции