
Перем мОткрытаИзДокумента Экспорт;
Перем мЗаданиеНаПодбор Экспорт;

Процедура ИнициализируемПостроительОтчета() Экспорт

	ПостроительОтчета.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                          |	ПТЛ_ПланДоставки.Маршрут КАК Маршрут,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.Получатель КАК Получатель,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.СтатусДокумента КАК СтатусДокумента,
							  //начало изменений Ожиганов 21.05.2015 работа фильтров 
							  |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор как ЗаданиеНаПодбор,
							  //конец изменений 
/// Кунов О.В., 24.03.2015 - 37873
	                          |	ПТЛ_ПланДоставки.Водитель,
	                          |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	                          |	ПТЛ_ПланДоставки.ТЭК
///							  
	                          |{ВЫБРАТЬ
	                          |	Маршрут.* КАК Маршрут,
	                          |	Получатель.*,
	                          |	СтатусДокумента.*,
/// Кунов О.В., 24.03.2015 - 37873							  
	                          |	Водитель.*,
	                          |	ТранспортноеСредство.*,
	                          |	ТЭК.*}
///							  
	                          |ИЗ
	                          |	РегистрНакопления.ПТЛ_ПланДоставки КАК ПТЛ_ПланДоставки
	                          |ГДЕ
	                          |	ПТЛ_ПланДоставки.Отделение = &Отделение
	                          |	И ПТЛ_ПланДоставки.ДатаОтгрузки = &ДатаОтгрузки
	                          |	И ПТЛ_ПланДоставки.Исключено = ЛОЖЬ
	                          |{ГДЕ
	                          |	ПТЛ_ПланДоставки.Маршрут.*,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.Получатель.* КАК Получатель,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.СтатусДокумента.* КАК СтатусДокумента,
/// Кунов О.В., 24.03.2015 - 37873							  
	                          |	ПТЛ_ПланДоставки.Водитель.*,
	                          |	ПТЛ_ПланДоставки.ТранспортноеСредство.*,
	                          |	ПТЛ_ПланДоставки.ТЭК.*}";
///							  
							  
	/// Кунов О.В., 24.03.2015 - 37873
	ДобавитьОтбор("Маршрут");
	ДобавитьОтбор("Получатель");
	ДобавитьОтбор("СтатусДокумента");
	ДобавитьОтбор("Водитель");
	ДобавитьОтбор("ТранспортноеСредство");
	ДобавитьОтбор("ТЭК");
	///						  
							  
	мУниверсальныйОтчет = Отчеты.УниверсальныйОтчет.Создать();
	мУниверсальныйОтчет.ПостроительОтчета = ПостроительОтчета;
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Маршрут", "Маршрут");
	СтруктураПредставлениеПолей.Вставить("Получатель", "Получатель");
	СтруктураПредставлениеПолей.Вставить("СтатусДокумента", "Статус документа");
	СтруктураПредставлениеПолей.Вставить("Водитель", "Водитель");
	СтруктураПредставлениеПолей.Вставить("ТранспортноеСредство", "ТранспортноеСредство");
	СтруктураПредставлениеПолей.Вставить("ТЭК", "ТЭК");
	
	мУниверсальныйОтчет.УстановитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);

КонецПроцедуры


/// Кунов О.В., 24.03.2015 - 37873
Процедура ДобавитьОтбор(Поле)
	
	Если ПостроительОтчета.Отбор.Найти(Поле) = Неопределено Тогда
		
		ПостроительОтчета.Отбор.Добавить(Поле);
		
	КонецЕсли; 	
	
КонецПроцедуры
///


мОткрытаИзДокумента = Ложь;
мЗаданиеНаПодбор = Документы.СП_ЗаданиеНаПодбор.ПустаяСсылка();
 