Функция ПолучитьДанныеПоНезакрытымРейсам(ДатаС, ДатаПо, мОрганизация, мОтделение, мДокумент) Экспорт
	
	//Blik 240817 65458 н
	СписокИсключенийПоВидуОперации = Новый СписокЗначений;
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ПеремещениеОтКопекера);
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ПеремещениеККопекеру);
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ДоставкаОтПоставщика);
	//Blik 240817 65458 к
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПТЛ_ПланДоставки.Отделение,
	               |	ПТЛ_ПланДоставки.ДатаОтгрузки,
	               |	ПТЛ_ПланДоставки.Рейс,
	               |	ПТЛ_ПланДоставки.ПланДоставки,
	               |	СУММА(ПТЛ_ПланДоставки.Вес) КАК Вес,
	               |	СУММА(ПТЛ_ПланДоставки.ВесБрутто) КАК ВесБрутто,
	               |	СУММА(ПТЛ_ПланДоставки.Объем) КАК Объем,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоМест) КАК КоличествоМест,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоПаллетоМест) КАК КоличествоПаллетоМест,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоПозиций) КАК КоличествоПозиций,
	               |	МАКСИМУМ(ПТЛ_ПланДоставки.Стоимость) КАК СтоимостьПеревозки,
	               |	ПТЛ_ПланДоставки.Маршрут,
	               |	ПТЛ_ПланДоставки.ТЭК,
	               |	ПТЛ_ПланДоставки.Водитель,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство.ТипТранспорта КАК ТипТранспорта,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.АдресПоставки) КАК КоличествоТочек,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПеревозку,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор,
	               |	ПТЛ_ПланДоставки.ДатаДоставки
	               |ПОМЕСТИТЬ ТабПлан
	               |ИЗ
	               |	РегистрНакопления.ПТЛ_ПланДоставки КАК ПТЛ_ПланДоставки
	               |ГДЕ
	               |	ПТЛ_ПланДоставки.Регистратор ССЫЛКА Документ.ПТЛ_ПланДоставки
	               |	И ПТЛ_ПланДоставки.Исключено = ЛОЖЬ
	               |	И ПТЛ_ПланДоставки.ДатаОтгрузки МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ПТЛ_ПланДоставки.Отделение = &Отделение
	               |	И ПТЛ_ПланДоставки.ПланДоставки.Организация = &Организация
				   //Blik 240817 65458 н
				   // Шевченков 62064 20170207
				   //И ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.ВидОперации <> Значение(Перечисление.СП_ВидыОперацииЗаданияНаПодбор.ДоставкаОтПоставщика) 
				   //
				   |	И НЕ ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.ВидОперации В (&СписокИсключенийВидовОпераций)
				   //Blik 240817 65458 к
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ПТЛ_ПланДоставки.Отделение,
	               |	ПТЛ_ПланДоставки.ДатаОтгрузки,
	               |	ПТЛ_ПланДоставки.Рейс,
	               |	ПТЛ_ПланДоставки.ПланДоставки,
	               |	ПТЛ_ПланДоставки.Маршрут,
	               |	ПТЛ_ПланДоставки.ТЭК,
	               |	ПТЛ_ПланДоставки.Водитель,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство.ТипТранспорта,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПеревозку,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор,
	               |	ПТЛ_ПланДоставки.ДатаДоставки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабПлан.Отделение,
	               |	ТабПлан.ДатаОтгрузки,
	               |	ТабПлан.Рейс,
	               |	ТабПлан.ПланДоставки,
	               |	ТабПлан.Вес,
	               |	ТабПлан.ВесБрутто,
	               |	ТабПлан.Объем,
	               |	ТабПлан.КоличествоМест,
	               |	ТабПлан.КоличествоПаллетоМест,
	               |	ТабПлан.КоличествоПозиций,
	               |	ТабПлан.СтоимостьПеревозки,
	               |	ТабПлан.Маршрут,
	               |	ТабПлан.ТЭК,
	               |	ТабПлан.Водитель,
	               |	ТабПлан.ТранспортноеСредство,
	               |	ТабПлан.ТипТранспорта,
	               |	ТабПлан.КоличествоТочек,
	               |	ТабПлан.ЗаданиеНаПеревозку,
	               |	ТабПлан.ЗаданиеНаПодбор,
	               |	ТабПлан.ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Выполнено
	               |ИЗ
	               |	ТабПлан КАК ТабПлан
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПТЛ_ОтчетОВыполненнойПеревозке.Маршруты КАК ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты
	               |		ПО ТабПлан.ПланДоставки = ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.ПланДоставки
	               |			И ТабПлан.Рейс = ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Рейс
	               |			И (ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка.Проведен = ИСТИНА)
				   |			И (НЕ ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка = &Ссылка)
	               |ГДЕ
	               |	ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка ЕСТЬ NULL 				   
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТабПлан";
	
		
	Запрос.УстановитьПараметр("ДатаКон"		, КонецДня(ДатаПо));
	Запрос.УстановитьПараметр("ДатаНач"		, НачалоДня(ДатаС));
	Запрос.УстановитьПараметр("Организация"	, мОрганизация);
	Запрос.УстановитьПараметр("Отделение"	, мОтделение);
	Запрос.УстановитьПараметр("Ссылка"	, мДокумент);
	//Blik 240817 65458 н
	Запрос.УстановитьПараметр("СписокИсключенийВидовОпераций"	, СписокИсключенийПоВидуОперации);
	//Blik 240817 65458 к
	
	РезультатЗапроса = Запрос.Выполнить();
	
	тзРезультат = РезультатЗапроса.Выгрузить();
	
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	тзРезультат = РезультатЗапроса.Выгрузить();
	//	
	//	Возврат тзРезультат;
	// КонецЕсли;

	Возврат тзРезультат;//Новый ТаблицаЗначений;
	
КонецФункции 
