
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПКК_ГрафикиПроведенияСверок
	Движения.ПКК_ГрафикиПроведенияСверок.Записывать = Истина;
	Движения.ПКК_ГрафикиПроведенияСверок.Очистить();
	Движение = Движения.ПКК_ГрафикиПроведенияСверок.Добавить();
	Движение.Период = ДатаНачалаСверки;
	Движение.Контрагент = Контрагент;
	Движение.Организация = Организация;
	Движение.ДоговорКонтрагента = ДоговорКонтрагента;
	Движение.ДатаНачала = ДатаНачалаСверки;
	Движение.ДатаОкончания = ДатаОкончанияСверки;
	Движение.ДатаВнеплановойСверки = ДатаВнеплановойСверки;
	Движение.Ответственный = Ответственный;
	Движение.ФормироватьАктыСверки = ФормироватьАктыСверки;
	Движение.Периодичность = Периодичность;

КонецПроцедуры
