
Функция НайтиСтрокуДерева(НачальноеЗначение, Дерево) Экспорт
	Если НачальноеЗначение = Неопределено Тогда
		Возврат Дерево.Строки[0];
	КонецЕсли; 
	
	СтрокиДерева = Дерево.Строки;
	ДеревоСтрокой = НачальноеЗначение;
	ПредСтрока = СтрокиДерева[0];
	
	Пока Истина Цикл
	
		Поз = Найти(ДеревоСтрокой, ".");
		Стр= ?(Поз > 0, Лев(ДеревоСтрокой, Поз-1), ДеревоСтрокой);
		
		НайденнаяСтрока = СтрокиДерева.Найти(Стр, "Имя");
		Если НайденнаяСтрока = Неопределено Тогда
			Возврат ПредСтрока;
		Иначе 
			Если Поз = 0 Тогда
				Возврат НайденнаяСтрока;
			КонецЕсли; 
			ПредСтрока = НайденнаяСтрока;
			СтрокиДерева = НайденнаяСтрока.Строки;
			ДеревоСтрокой = Сред(ДеревоСтрокой, Поз+1);
		КонецЕсли; 
	КонецЦикла; 

КонецФункции

Функция ДеревоВСтроку(СтрокаДерева) Экспорт
	
	Рез = "";
	Пока СтрокаДерева.Уровень() > 0 Цикл
		Рез = СтрокаДерева.Имя + "." + Рез;
		СтрокаДерева = СтрокаДерева.Родитель;
	КонецЦикла; 
	Если Рез <> "" Тогда
		Рез = Сред(Рез, 1, СтрДлина(Рез)-1);
	КонецЕсли; 

	Возврат Рез;
КонецФункции // ()
