&НаСервере
Перем ОбработкаОбъект;
Перем ОснМодуль;

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.Инициализировать(ОсновнойМодуль());
				
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция ОсновнойМодуль()
	Если ОснМодуль = Неопределено Тогда
		ОснМодуль = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища).ОбработкаОбъект;
	КонецЕсли;
	Возврат ОснМодуль;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(МодульОбъекта().ДеревоПродукцииВетис(),"НоменклатураМеркурий");
	Если ЗначениеЗаполнено(Параметры.ТекущийGUID) Тогда//найти строку и спозиционироваться на нее
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураМеркурийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Код) Тогда //значит нужный уровень
		СтандартнаяОбработка = Ложь;
		СпПараметров = Новый Структура;
		СпПараметров.Вставить("Код",Элемент.ТекущиеДанные.Код);
		СпПараметров.Вставить("GUID",Элемент.ТекущиеДанные.GUID);
		СпПараметров.Вставить("Наименование",Элемент.ТекущиеДанные.Наименование);
		Закрыть(СпПараметров);
	КонецЕсли;

КонецПроцедуры
