
//Процедуры и функции работы с правами доступа
Функция ЕстьПравоМСФО() Экспорт
	                   
	ЕстьПраво = Ложь;
	
	Если РольДоступна("БухгалтерМСФО") или РольДоступна("ПолныеПрава") Тогда
		ЕстьПраво = Истина;
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции


Процедура ОткрытьПоступлениеОСМеждународныйСОтборомПоЛизингу() Экспорт
	
	Форма = ПолучитьФорму("Документ.ПоступлениеОсновныхСредствМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийПоступлениеОС_МСФО.Лизинг;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	

Процедура ОткрытьПоступлениеОСМеждународныйСОтборомПоОбычномуПоступлению() Экспорт
	
	Форма = ПолучитьФорму("Документ.ПоступлениеОсновныхСредствМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийПоступлениеОС_МСФО.ОбычноеПоступление;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	


Процедура ОткрытьАмортизациюОССОтборомПоЛизингу() Экспорт
	
	Форма = ПолучитьФорму("Документ.АмортизацияОСМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийАмортизацияОС_МСФО.Лизинг;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	

Процедура ОткрытьАмортизациюОССОтборомПоОбычнойАмортизации() Экспорт
	
	Форма = ПолучитьФорму("Документ.АмортизацияОСМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийАмортизацияОС_МСФО.ОбычнаяАмортизация;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	

Процедура ОткрытьВыбытиеОССОтборомПоЛизингу() Экспорт
	
	Форма = ПолучитьФорму("Документ.ВыбытиеОсновныхСредствМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийВыбытиеОС_МСФО.Лизинг;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	

Процедура ОткрытьВыбытиеОССОтборомПоОбычнымВыбытиям() Экспорт
	
	Форма = ПолучитьФорму("Документ.ВыбытиеОсновныхСредствМеждународный.ФормаСписка");
	Форма.Отбор.ВидОперации.Значение = Перечисления.ДС_ВидыОперацийВыбытиеОС_МСФО.ОбычноеВыбытие;
	Форма.Отбор.ВидОперации.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры	








