
///Вадим 14.11.2012 10:16:14
&НаСервере
Процедура ЗаполнитьСервер()
	//ЗаполнитьТаблицуРезервов()
	//Объект.
   ТекОбъект = РеквизитФормыВЗначение("Объект");
   ТекОбъект.ЗаполнитьТаблицуРезервов();
КонецПроцедуры
//ВадимКонец



&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Резервы.Количество() > 0 Тогда
		Ответ = Вопрос("Все строки табличной части будут удалены. Продолжить ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	ЗаполнитьСервер();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
КонецПроцедуры


