&НаСервере
Перем ОбработкаОбъект;
Перем ОснМодуль;

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.Инициализировать(ОсновнойМодуль());
		
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция ОсновнойМодуль()
	Если ОснМодуль = Неопределено Тогда
		ОснМодуль = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища).ОбработкаОбъект;
	КонецЕсли;
	Возврат ОснМодуль;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаНайденных = Новый ТаблицаЗначений;
	
	Если Параметры.ВариантПоиска = 1 Тогда
		
		ТаблицаНайденных = МодульОбъекта().ПолучитьСписокПредприятийПоGUID(Параметры.ХС_GUID,Параметры.ОбновитьССервера);
		Если ТаблицаНайденных = неопределено Тогда
			Возврат;
		КонецЕсли;
	
		Если ТаблицаНайденных.Количество() = 0 Тогда
			Сообщить("Хозяйствующему субъекту не введено предприятий в системе Меркурий.");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Параметры.ВариантПоиска = 2 Тогда
		
		Попытка
			РеквизитИНН = Параметры.СвязанныйСправочник.Метаданные().Реквизиты.Найти("ИНН");
			Если РеквизитИНН <> Неопределено Тогда
				ИНН = Параметры.СвязанныйСправочник.ИНН;
				Если ЗначениеЗаполнено(ИНН) Тогда
					ТаблицаНайденных = МодульОбъекта().ПолучитьСписокХСПоИНН(ИНН);
					Если ТаблицаНайденных.Количество() = 0 Тогда
						Сообщить("Не удалось найти хоз. субъект в системе Меркурий по заданному ИНН");
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	ИначеЕсли Параметры.ВариантПоиска = 3 Тогда
		ТаблицаНайденных = МодульОбъекта().ПолучитьСписокХСПоИНН(Параметры.ИНН);
		Если ТаблицаНайденных.Количество() = 0 Тогда
			Сообщить("Не удалось найти хоз. субъект в системе Меркурий по заданному ИНН");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Параметры.ВариантПоиска = 4 Тогда
		//покажем выбор из всех сопоставленных
		ТаблицаНайденных = МодульОбъекта().ПолучитьСписокЭлементовСправочникаМеркурий("МеркурийПлощадка", Неопределено);
		ТаблицаНайденных.Колонки.Добавить("name");
		ТаблицаНайденных.ЗагрузитьКолонку(ТаблицаНайденных.ВыгрузитьКолонку("Наименование"), "name");
	КонецЕсли;
	
	Таблица.Загрузить(ТаблицаНайденных);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(Элемент.ТекущиеДанные);
КонецПроцедуры
