
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПРГ_РезервыПремий.Записывать = Истина;
	Движения.ПРГ_РезервыПремий.Очистить();
	Для Каждого ТекСтрокаРезервы Из Резервы Цикл
		Движение = Движения.ПРГ_РезервыПремий.Добавить();
		Движение.ВидДвижения = ?(ТекСтрокаРезервы.СуммаСписания=0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаРезервы.Сотрудник;
		Движение.ПодразделенияОрганизаций = ТекСтрокаРезервы.ПодразделенияОрганизаций;
		Движение.ВидНадбавки = ТекСтрокаРезервы.ВидНадбавки;
		Движение.Сумма = ?(ТекСтрокаРезервы.СуммаСписания=0,ТекСтрокаРезервы.СуммаНачисления,ТекСтрокаРезервы.СуммаСписания);///ТекСтрокаРезервы.СуммаНачисления;
		Движение.Коментарий =?(ТекСтрокаРезервы.СуммаСписания=0, "Начисление резерва", "Списание резерва");
	КонецЦикла;

	
КонецПроцедуры
