
Процедура ПередЗаписью(Отказ)
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	Если Не ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(СледующийЗапуск) Тогда
			СледующийЗапуск = ДатаНачала + ВернутьВремяВСекундах(ВремяИсполнения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СоздатьОбъектОбработки(пИмяСсылкаОбработки) Экспорт
	
	Обработка = "";
	
	Если Не ЗначениеЗаполнено(пИмяСсылкаОбработки) Тогда
		Возврат Обработка;
	КонецЕсли;
    	
	Если ТипЗнч(пИмяСсылкаОбработки)=Тип("СправочникСсылка.ВнешниеОбработки") Тогда
		
	//#Если Клиент Тогда		
		//Ищем внешнюю обработку
		Попытка
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = пИмяСсылкаОбработки.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Обработка;
		КонецПопытки; 
		
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
	//#Иначе
	//	Возврат "Использование внешних обработок на сервере 1С не поддерживается";
	//#КонецЕсли		
		
	ИначеЕсли ТипЗнч(пИмяСсылкаОбработки)=Тип("Строка") Тогда
		
		Попытка
			Обработка = Обработки[пИмяСсылкаОбработки].Создать();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Обработка;
	
КонецФункции	

Функция ВернутьВремяВСекундах(пДата = "") Экспорт
	
	Если пДата = "" Тогда
		пДата	= ТекущаяДата();
	КонецЕсли;
	
	лЧас	= Час(пДата);
	лМин	= Минута(пДата);
	лСек	= Секунда(пДата);
	лВремя	= лЧас*3600 + лМин*60 + лСек;
	
	Возврат лВремя;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если Не ЭтоГруппа Тогда
		ИспользоватьВнешнююОбработку 	= Истина;
		ИмяСсылкаОбработки 				= Справочники.ВнешниеОбработки.ПустаяСсылка();
		ДатаНачала						= ТекущаяДата();
		ВидПериодаЗапуска				= 1;
		ВидПериодаГлубины				= 1;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОтборХранилище = Неопределено;
КонецПроцедуры
