Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми

Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

//Бирюков заявка № 31480
Функция ПолучитьДанныеФизЛица(Организация, МОЛ, ДатаСреза)
   	Результат = Новый Структура("Должность, ФИО, ТабНомер");
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	запрос.УстановитьПараметр("МОЛ", МОЛ);
	запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабНомер
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = &МОЛ";
   
   	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Результат.Вставить("ФИО", ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(МОЛ));
	Возврат Результат
КонецФункции // ПолучитьДанныеФизЛица()
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

// Функция формирует табличный документ с печатной формой ОС-2,
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОС2(ПечатьПоДаннымУпрУчета = Истина)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ПечатьПоДаннымУпрУчета тогда
		НазваниеСтоимости	= "Стоимость";	
		ВалютаПечати 		= глЗначениеПеременной("ВалютаУправленческогоУчета");
		//Бирюков заявка № 31480
//		СтрокиСдатчикПолучатель = "		ПеремещениеОС.Подразделение КАК ПодрПолучатель,";
		СтрокиСдатчикПолучатель = "		ПеремещениеОС.Организация	КАК Организация,
								  |		ПеремещениеОС.ПодразделениеОрганизации КАК ПодрПолучатель,
								  |		ПеремещениеОС.МОЛОрганизации КАК МОЛПолучатель,";
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		СтрокиСтоимость		= "		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&Дата) КАК СтоимостьОС
							  |		ПО ПеремещениеОСОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство";


	Иначе
		НазваниеСтоимости	= "СтоимостьБУ";	
		ВалютаПечати		= глЗначениеПеременной("ВалютаРегламентированногоУчета");
		СтрокиСдатчикПолучатель = "		ПеремещениеОС.Организация	КАК Организация,
								  |		ПеремещениеОС.Организация.КодПоОКПО		  КАК КодПоОКПО,
		//Бирюков заявка № 31480
								  |		ПеремещениеОС.МОЛОрганизации КАК МОЛПолучатель,
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
								  |		ПеремещениеОС.ПодразделениеОрганизации КАК ПодрПолучатель,";
		СтрокиСтоимость		= "			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСБухгалтерскийУчет.Остатки(&Дата) КАК СтоимостьОС
							  |		ПО ПеремещениеОСОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство";
									
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремещениеОС.Дата          КАК ДатаДок,
	|	ПеремещениеОС.Номер         КАК НомерДок,
	|	ПеремещениеОС.Ответственный,"
	+СтрокиСдатчикПолучатель +"
	|	ПеремещениеОС.Дата          КАК ДатаПередачи
	|ИЗ
	|	Документ.ПеремещениеОС КАК ПеремещениеОС
	|ГДЕ
	|	Ссылка = &Ссылка";
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	ВыборкаОС.Следующий();
	
	Если Не ПечатьПоДаннымУпрУчета тогда	
		СведенияОРуководителеГлавбухе = УправлениеВнеоборотнымиАктивами.ПолучитьСведенияОРуководителеГлавБухе(ВыборкаОС.Организация,ВыборкаОС.ДатаДок);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",    Ссылка);
	Запрос.УстановитьПараметр("Дата",ВыборкаОС.ДатаДок);
	
	Если ПечатьПоДаннымУпрУчета Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеОСОС.НомерСтроки КАК НС,
		|	ПеремещениеОСОС.ОсновноеСредство,
		|	ПеремещениеОСОС.ОсновноеСредство.Код КАК ИнвНомерУпр,
		//Бирюков заявка № 31480
		|	ПеремещениеОСОС.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
		|	МестонахождениеОССрезПоследних.МОЛ КАК МОЛСдатчик,
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		|	ПеремещениеОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПеремещениеОСОС.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
		|	ЕСТЬNULL(СтоимостьОС.СтоимостьОстаток,НЕОПРЕДЕЛЕНО) КАК СуммаПеремещения,
		|	МестонахождениеОССрезПоследних.Местонахождение.Представление КАК ПодрСдатчик
		|ИЗ
		|	Документ.ПеремещениеОС.ОС КАК ПеремещениеОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&Дата, ) КАК СтоимостьОС
		|		ПО ПеремещениеОСОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&Дата, Регистратор <> &Ссылка) КАК МестонахождениеОССрезПоследних
		|		ПО (МестонахождениеОССрезПоследних.ОсновноеСредство = ПеремещениеОСОС.ОсновноеСредство)
		|ГДЕ
		|	ПеремещениеОСОС.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеОСОС.НомерСтроки";
		
	Иначе

		//Бирюков заявка № 31480
		Запрос.УстановитьПараметр("Организация",ВыборкаОС.Организация);
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ПеремещениеОСОС.НомерСтроки КАК НС,
		|	ПеремещениеОСОС.ОсновноеСредство,
		|	ПеремещениеОСОС.ОсновноеСредство.Код КАК ИнвНомерУпр,
		//Бирюков заявка № 31480
		|	ПеремещениеОСОС.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
		|	ЕСТЬNULL(СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета, Неопределено) КАК СчетУчетаСтоимостиБУ,
		|	МестонахождениеОССрезПоследних.МОЛ КАК МОЛСдатчик,
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		|	ПеремещениеОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	ПеремещениеОСОС.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
		|	ЕСТЬNULL(СтоимостьОС.СтоимостьОстаток,НЕОПРЕДЕЛЕНО) КАК СуммаПеремещения,
		|	МестонахождениеОССрезПоследних.Местонахождение.Представление КАК ПодрСдатчик
		|ИЗ
		|	Документ.ПеремещениеОС.ОС КАК ПеремещениеОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОСБухгалтерскийУчет.Остатки(&Дата, ) КАК СтоимостьОС
		|		ПО ПеремещениеОСОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, Регистратор <> &Ссылка) КАК МестонахождениеОССрезПоследних
		|		ПО (МестонахождениеОССрезПоследних.ОсновноеСредство = ПеремещениеОСОС.ОсновноеСредство)
		//Бирюков заявка № 31480
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|		&Дата,
		|		Организация = &Организация) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
		|		ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПеремещениеОСОС.ОсновноеСредство
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		|ГДЕ
		|	ПеремещениеОСОС.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеОСОС.НомерСтроки";
		
	КонецЕсли;
	
	ТаблицаПоОС = Запрос.Выполнить().Выгрузить();

	ДокВвода  = Неопределено;
	ДатаВвода = Дата('00000000');
	
	ТабДокумент   = Новый ТабличныйДокумент();
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	ТабДокумент.МасштабПечати	   = 100;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеОС_ОС2";
	
	Макет                 = ПолучитьМакет("ОС2");
	ОбластьШапка1         = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока         = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвалСтраницы = Макет.ПолучитьОбласть("ПодвалСтраницы");
	ОбластьПодвал         = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапка2         = Макет.ПолучитьОбласть("Шапка2");

	ОбластьШапка1.Параметры.Заполнить(ВыборкаОС);
	ОбластьШапка1.Параметры.Валюта = ВалютаПечати;

	ПодрСдатчик = ТаблицаПоОС.ВыгрузитьКолонку("ПодрСдатчик");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(ПодрСдатчик);
	СтрокаПодрСдатчик = "";
	
	Для Счетчик = 0 по ПодрСдатчик.Количество()-1 Цикл
		СтрокаПодрСдатчик = СтрокаПодрСдатчик + ПодрСдатчик[Счетчик];
		Если Счетчик < ПодрСдатчик.Количество()-1 Тогда
			СтрокаПодрСдатчик = СтрокаПодрСдатчик + ", ";
		КонецЕсли; 
	КонецЦикла;
	
	ОбластьШапка1.Параметры.ПодрСдатчик = СтрокаПодрСдатчик;
	//Бирюков заявка № 31480
	ОбластьШапка1.Параметры.ПодрПолучатель = ВыборкаОС.ПодрПолучатель;
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	
	ТабДокумент.Вывести(ОбластьШапка1);

	ИтогСумма = 0;
	Для Каждого ВыборкаПоОС из ТаблицаПоОС Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоОС);
		
		Если ПечатьПоДаннымУпрУчета тогда
			//ОбластьСтрока.Параметры.ИнвНомер = ВыборкаПоОС.ИнвНомерУпр;
		Иначе
			ВыборкаЗаписей = РегистрыСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.ПолучитьПоследнее(ВыборкаОС.ДатаДок,
														Новый Структура("ОсновноеСредство",ВыборкаПоОС.ОсновноеСредство));
			ИнвНомерБух	   = ?(ВыборкаЗаписей.Количество() > 0,ВыборкаЗаписей.ИнвентарныйНомер,0);
			//ОбластьСтрока.Параметры.ИнвНомер = ИнвНомерБух;
		КонецЕсли;
		
		Если ПустаяСтрока(ВыборкаПоОС.НаименованиеОС) Тогда
			ОбластьСтрока.Параметры.НаименованиеОС = СокрЛП(ВыборкаПоОС.ОсновноеСредство);
		КонецЕсли;
		
		//Бирюков заявка № 31480
		ОбластьСтрока.Параметры.ИнвНомер = ВыборкаПоОС.ИнвНомерУпр;
		НаименованиеОС = ОбластьСтрока.Параметры.НаименованиеОС;
		ОбластьСтрока.Параметры.НаименованиеОС = НаименованиеОС+ ", Зав. № " +СокрЛП(ВыборкаПоОС.ЗаводскойНомер);
		Если НЕ ПечатьПоДаннымУпрУчета Тогда
			СуммаПеремещения = ОбластьСтрока.Параметры.СуммаПеремещения;
			Если СуммаПеремещения = Неопределено Тогда 
				Субконто1 = Неопределено;
				Субконто2 = Неопределено;
				
				СчетУчетаСтоимостиБУ = ВыборкаПоОС.СчетУчетаСтоимостиБУ;
				
				Если НЕ СчетУчетаСтоимостиБУ = Неопределено Тогда 
					Если СчетУчетаСтоимостиБУ.Код = "001" Тогда 
						Субконто2 = ВыборкаПоОС.ОсновноеСредство;
					Иначе
						Субконто1 = ВыборкаПоОС.ОсновноеСредство;
					КонецЕсли;
				
					ТабСуммыОстатков = БухгалтерскийУчет.ПолучитьОстатокПоСчету(ВыборкаОС.Организация, ВыборкаОС.ДатаДок, СчетУчетаСтоимостиБУ, ВалютаПечати , Субконто1, Субконто2);
					СуммаПеремещения = ТабСуммыОстатков.Итог("СуммаОстаток");
				Иначе 
					СчетУчетаСтоимостиБУ = ПланыСчетов.Хозрасчетный.АрендованныеОсновныеСредства; //специальная затычка для косяка в МФ спр-ка ОС, стр. 468
					Субконто1 = Неопределено;
					Субконто2 = ВыборкаПоОС.ОсновноеСредство;
					ТабСуммыОстатков = БухгалтерскийУчет.ПолучитьОстатокПоСчету(ВыборкаОС.Организация, ВыборкаОС.ДатаДок, СчетУчетаСтоимостиБУ, ВалютаПечати , Субконто1, Субконто2);
					СуммаПеремещения = ТабСуммыОстатков.Итог("СуммаОстаток");
					Если СуммаПеремещения = 0 Тогда //еще одна затычка для криво занесенных ОС на 012 - из-за незаполненного регистра стоимости они как раз попадут в эту ветку
						СчетУчетаСтоимостиБУ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("012");
						Субконто1 = ВыборкаПоОС.ОсновноеСредство;
						Субконто2 = Неопределено;
						ТабСуммыОстатков = БухгалтерскийУчет.ПолучитьОстатокПоСчету(ВыборкаОС.Организация, ВыборкаОС.ДатаДок, СчетУчетаСтоимостиБУ, ВалютаПечати , Субконто1, Субконто2);
						СуммаПеремещения = ТабСуммыОстатков.Итог("СуммаОстаток");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ОбластьСтрока.Параметры.СуммаПеремещения = СуммаПеремещения;
		КонецЕсли;
		//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьСтрока);
		СтрокаСПодвалом.Добавить(ОбластьПодвал);
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			ТабДокумент.Вывести(ОбластьПодвалСтраницы);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапка2);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрока);
	//Бирюков заявка № 31480
//		ИтогСумма = ИтогСумма + ?(ВыборкаПоОС.СуммаПеремещения<>Неопределено,ВыборкаПоОС.СуммаПеремещения,0);
		ИтогСумма = ИтогСумма + ?(СуммаПеремещения<>Неопределено,СуммаПеремещения,0);
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
		
	КонецЦикла;

	ОбластьПодвал.Параметры.ИтогСумма = ИтогСумма;
	//Бирюков заявка № 31480
	МОЛСдатчик = ТаблицаПоОС.ВыгрузитьКолонку("МОЛСдатчик");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(МОЛСдатчик);
	ДанныеСдатчика = Новый Структура("Должность, ФИО, ТабНомер");
	
	Если МОЛСдатчик.Количество() > 1 Тогда
		Сообщить("Сотрудников, передающих ОС, больше одного! Оформление подписи невозможно...", СтатусСообщения.Важное);
	ИначеЕсли МОЛСдатчик.Количество() = 1 Тогда
		ДанныеСдатчика = ПолучитьДанныеФизЛица(ВыборкаОС.Организация, МОЛСдатчик[0], ВыборкаОС.ДатаДок);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ДолжностьСдатчика 	= ДанныеСдатчика.Должность;
	ОбластьПодвал.Параметры.ФИОСдатчика 		= ДанныеСдатчика.ФИО;
	ОбластьПодвал.Параметры.ТабНомерСдатчика 	= ДанныеСдатчика.ТабНомер;
	
	ДанныеПолучателя = ПолучитьДанныеФизЛица(ВыборкаОС.Организация, ВыборкаОС.МОЛПолучатель, ВыборкаОС.ДатаДок);
	
	ОбластьПодвал.Параметры.ДолжностьПолучателя = ДанныеПолучателя.Должность;
	ОбластьПодвал.Параметры.ФИОПолучателя 		= ДанныеПолучателя.ФИО;
	ОбластьПодвал.Параметры.ТабНомерПолучателя 	= ДанныеПолучателя.ТабНомер;
	
	//%%%%%%%%%%%%%%%%%%%%%%%%%
	
	Если Не ПечатьПоДаннымУпрУчета тогда
		ОбластьПодвал.Параметры.Заполнить(СведенияОРуководителеГлавбухе);
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьОС2()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли; 

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОС2упр" тогда
		ТабДокумент = ПечатьОС2();
	ИначеЕсли ИмяМакета = "ОС2бух" тогда
		ТабДокумент = ПечатьОС2(Ложь);
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;

	СтруктураМакетов.Вставить("ОС2упр", "Форма ОС-2 (упр. учет)");
	СтруктураМакетов.Вставить("ОС2бух", "Форма ОС-2 (бух. учет)");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли


// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр();
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для управленческого учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

	мСтрокаРеквизитыУпрУчета =  "МОЛ,
								|Подразделение,
								|Событие";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()


	мСтрокаРеквизитыБухУчета =  "ПодразделениеОрганизации,
								|МОЛОрганизации,
								|СобытиеРегл";
	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Дополняет список обязательных параметров шапки
// упр. параметрами
Процедура ДополнитьОбязательныеРеквизитыШапкиУпр(Реквизиты)
	
	Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "Событие";

КонецПроцедуры

// Дополняет список обязательных параметров шапки
// регл. параметрами
Процедура ДополнитьОбязательныеРеквизитыШапкиРегл(Реквизиты)
	
	Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "СобытиеРегл";

КонецПроцедуры

// Проверяет правильность заполнения упр. реквизитов шапки
Процедура ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.Событие.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(СтруктураШапкиДокумента.Событие.ВидСобытияОС,
							  Перечисления.ВидыСобытийОС.ВнутреннееПеремещение,
							  ПредставлениеРеквизита,Отказ);

КонецПроцедуры

// Проверяет правильность заполнения регл. реквизитов шапки
Процедура ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле Организация", Отказ,Заголовок);
	Иначе
		Если ЗначениеЗаполнено(СтруктураШапкиДокумента.ПодразделениеОрганизации) 
			И ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) 
			И СтруктураШапкиДокумента.ПодразделениеОрганизации.Владелец <> СтруктураШапкиДокумента.Организация Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Выбранное подразделение организации не соответствует указанной организации", Отказ,Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.СобытиеРегл.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(СтруктураШапкиДокумента.СобытиеРегл.ВидСобытияОС,
							  Перечисления.ВидыСобытийОС.ВнутреннееПеремещение,
							  ПредставлениеРеквизита,Отказ);

КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "";
	ДополнитьОбязательныеРеквизитыШапкиУпр(ОбязательныеРеквизитыШапки);
	ДополнитьОбязательныеРеквизитыШапкиРегл(ОбязательныеРеквизитыШапки);
	
	УправлениеЗатратами.НепроверятьРеквизитыПоТипуУчета(ЭтотОбъект, ОбязательныеРеквизитыШапки, СтруктураШапкиДокумента, мСтрокаРеквизитыУпрУчета, мСтрокаРеквизитыБухУчета, мСтрокаРеквизитыНалУчета);
	
	СтруктураОбязательныхПолей = 
	Новый Структура(ОбязательныеРеквизитыШапки);

	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	ПроверитьЗаполнениеШапкиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеШапкиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Дополняет список обязательных параметров табл. части
// упр. параметрами
Процедура ДополнитьОбязательныеРеквизитыТабОСУпр(Реквизиты)

	//Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "";

КонецПроцедуры

// Дополняет список обязательных параметров табл. части
// регл. параметрами
Процедура ДополнитьОбязательныеРеквизитыТабОСРегл(Реквизиты)

	//Реквизиты = Реквизиты + ?(ПустаяСтрока(Реквизиты), "", ", ") + "";

КонецПроцедуры

// Проверка реквизитов в ТЧ по упр. учету
// 
Процедура ПроверкаРеквизитовТЧУпр(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок)
	
КонецПроцедуры

// Проверка реквизитов в ТЧ по регл. учету
// 
Процедура ПроверкаРеквизитовТЧРегл(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок)
	
	//Бирюков начало изменений: счет 012
	Если ПРГ_ВидОперации = Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.Счет_012 Тогда
		Возврат;
	КонецЕсли;
	// Проверим соответствие организаций ОС и организации документа
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокОС"      , ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство"));
	Запрос.УстановитьПараметр("ВыбОрганизация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ДатаСреза"     , СтруктураШапкиДокумента.Дата);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МестонахождениеОсновныхСредствОрганизацийСрезПоследних.Организация КАК Организация,
	|	ОсновныеСредства.Код                                               КАК Инв,
	|	ОсновныеСредства.Ссылка                                            КАК ОсновноеСредство,
	|	Представление(ОсновныеСредства.Ссылка)                             КАК ОсновноеСредствоПредставление
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаСреза, (ОсновноеСредство В(&СписокОС) И Организация = &ВыбОрганизация)) КАК МестонахождениеОсновныхСредствОрганизацийСрезПоследних
	|	ПО ОсновныеСредства.Ссылка = МестонахождениеОсновныхСредствОрганизацийСрезПоследних.ОсновноеСредство
	|
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&СписокОС)
	|	И
	|	НЕ ОсновныеСредства.ЭтоГруппа
	|	И
	|	МестонахождениеОсновныхСредствОрганизацийСрезПоследних.Организация ЕСТЬ NULL
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Отказ = Истина;
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке(("Бух.учет: Несоответствие организаций ОС """ + СокрЛП(Выборка.ОсновноеСредствоПредставление) + """ инв.№ " + СокрЛП(Выборка.Инв) + " и организации указанной в документе."),, Заголовок);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(РежимПроведения,ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабОС = "ОсновноеСредство"; //через запятую
	ДополнитьОбязательныеРеквизитыТабОСУпр(РеквизитыТабОС);
	ДополнитьОбязательныеРеквизитыТабОСРегл(РеквизитыТабОС);
	УправлениеЗатратами.НепроверятьРеквизитыПоТипуУчета(ЭтотОбъект, РеквизитыТабОС, СтруктураШапкиДокумента, мСтрокаРеквизитыУпрУчета, мСтрокаРеквизитыБухУчета, мСтрокаРеквизитыНалУчета, "ОС");
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура(РеквизитыТабОС), Отказ, Заголовок);
	
	// Логические проверки
	//начало изменений БП 10 
	//Если ОтражатьВУправленческомУчете Тогда
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		ПроверкаРеквизитовТЧУпр(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);
	//конец изменений БП 10 	
	КонецЕсли; 
	Если ОтражатьВБухгалтерскомУчете Тогда
		ПроверкаРеквизитовТЧРегл(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);
	КонецЕсли; 
	
	//начало изменений БП 10 
	Если СтруктураШапкиДокумента.ПРГ_ВидОперации = Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.ОСПоЛизингу Тогда
		возврат;
	КонецЕсли;	
    //конец изменений БП 10 	
	
	//Бирюков начало изменений: 012 счет
	Если ПРГ_ВидОперации = Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.Счет_012 Тогда 
		Возврат;
	КонецЕсли;
	//Бирюков конец изменений
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		// Проверим возможность изменения состояния ОС
		Для каждого СтрокаОС из ОС Цикл
			//начало изменений БП 10 
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете  тогда
			//конец изменений БП 10 	
				УправлениеВнеоборотнымиАктивами.ПроверитьВозможностьИзмененияСостоянияОС(СтрокаОС.ОсновноеСредство,Дата,СобытиеРегл,Отказ,Организация);
			КонецЕсли;
			//начало изменений БП 10
			//Если ОтражатьВУправленческомУчете тогда
			Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
			//конец изменений БП 10 
				УправлениеВнеоборотнымиАктивами.ПроверитьВозможностьИзмененияСостоянияОС(СтрокаОС.ОсновноеСредство,Дата,Событие,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры // ПроверкаРеквизитов()


// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС,Отказ, Заголовок)
	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
КонецПроцедуры // ДвиженияПоРегистрам

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	ДатаДока = Дата;

	МестонахождениеОС = Движения.МестонахождениеОС;
	СобытиеОС	      = Движения.СобытияОС;

	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		Движение = МестонахождениеОС.Добавить();
		
		Движение.Период           = ДатаДока;
		Движение.ОсновноеСредство = СтрокаТЧ.ОсновноеСредство;
		Движение.МОЛ              = СтруктураШапкиДокумента.МОЛ;
		Движение.Местонахождение  = СтруктураШапкиДокумента.Подразделение;
		
		Движение = СобытиеОС.Добавить();
		Движение.Период            = ДатаДока;
		Движение.ОсновноеСредство  = СтрокаТЧ.ОсновноеСредство;
		Движение.Событие           = СтруктураШапкиДокумента.Событие;
		Движение.НазваниеДокумента = Метаданные().Представление();
		Движение.НомерДокумента    = Номер;
		
	КонецЦикла;

КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	ДатаДока = Дата;
	
	СобытиеОСБух             	 = Движения.СобытияОСОрганизаций;
	МестонахождениеОСОрганизаций = Движения.МестонахождениеОСБухгалтерскийУчет;
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		Движение = МестонахождениеОСОрганизаций.Добавить();
	
		Движение.Период           = ДатаДока;
		Движение.ОсновноеСредство = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация      = СтруктураШапкиДокумента.Организация;
		Движение.МОЛ              = СтруктураШапкиДокумента.МОЛОрганизации;
		Движение.Местонахождение  = СтруктураШапкиДокумента.ПодразделениеОрганизации;
		
		/////Вадим 12.12.2013 12:38:14  бп 7
	                Движение.Пользователь                = Пользователь;
		////ВадимКонец

		
		Движение = СобытиеОСБух.Добавить();
		
		Движение.Период                   = ДатаДока;
		Движение.ОсновноеСредство         = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация         	  = СтруктураШапкиДокумента.Организация;
		Движение.Событие                  = СтруктураШапкиДокумента.СобытиеРегл;
		Движение.НазваниеДокумента 		  = Метаданные().Представление();
		Движение.НомерДокумента    		  = Номер;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоСчету012(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)
	Если НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	ДатаДока = Дата;
	
	СобытиеОСБух             	 = Движения.СобытияОСОрганизаций;
	МестонахождениеОСОрганизаций = Движения.МестонахождениеОСБухгалтерскийУчет;
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл
		
		Движение = МестонахождениеОСОрганизаций.Добавить();
	
		Движение.Период           = ДатаДока;
		Движение.ОсновноеСредство = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация      = СтруктураШапкиДокумента.Организация;
		Движение.МОЛ              = СтруктураШапкиДокумента.МОЛОрганизации;
		Движение.Местонахождение  = СтруктураШапкиДокумента.ПодразделениеОрганизации;
        Движение.Пользователь     = Пользователь;
		
		Движение = СобытиеОСБух.Добавить();
		
		Движение.Период             = ДатаДока;
		Движение.ОсновноеСредство   = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация        = СтруктураШапкиДокумента.Организация;
		Движение.Событие            = СтруктураШапкиДокумента.СобытиеРегл;
		Движение.НазваниеДокумента 	= Метаданные().Представление();
		Движение.НомерДокумента    	= Номер;
		
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ,РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
    /////Вадим 23.10.2013 15:22:45
	проверитьЗаполняемостьРеквизитов(Отказ);
	
	////ВадимКонец
	
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета();

	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	//начало изменений БП 10 
	СтруктураШапкиДокумента.ОтражатьВУправленческомУчете = Не ПараметрыСеанса.НеведетсяУПРУчетВЧастиЗатратИОС;
	//конец изменений БП 10 

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ОсновноеСредство", "ОсновноеСредство");

	РезультатЗапросаПоОС = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей);
	ТаблицаПоОС          = РезультатЗапросаПоОС.Выгрузить();
	
	ПроверкаРеквизитовТЧ(РежимПроведения, ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок);

	УправлениеВнеоборотнымиАктивами.ПроверитьДубли(ТаблицаПоОС, "Основные средства", "ОсновноеСредство", "Основное средство", Отказ, Заголовок);	
	
	Если Не Отказ Тогда
		Если ПРГ_ВидОперации=Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.ОС тогда
			ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС,Отказ, Заголовок);
		ИначеЕсли ПРГ_ВидОперации=Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.ОСПоЛизингу тогда	
			движениеОСПоЛизингу();
		//Бирюков начало изменений: 012 счет
		ИначеЕсли ПРГ_ВидОперации=Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.Счет_012 тогда
			ПроведениеПоСчету012(СтруктураШапкиДокумента, ТаблицаПоОС,Отказ, Заголовок);
		Иначе
			Отказ=Истина;
		КонецЕсли;	
		движениеПОИМНС();
		ИзменениеСпособовОтражения();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

   //начало изменений БП 10
   Событие				     = СобытиеРегл;
   СпособОтраженияРасходовНУ = СпособОтраженияРасходовБУ; 
   //конец изменений БП 10 
	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		
		Организация = Основание.Организация;
		
		Для Каждого ТекСтрокаОС Из Основание.ОС Цикл
			
			Если ТекСтрокаОС.НаличиеПоДаннымУчета И НЕ ТекСтрокаОС.НаличиеФактическое Тогда
				
				НоваяСтрока = ОС.Добавить();
				НоваяСтрока.ОсновноеСредство = ТекСтрокаОС.ОсновноеСредство;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

//Вадим
Процедура движениеОСПоЛизингу()
	МестонахождениеОСОрганизаций = Движения.МестонахождениеОСБухгалтерскийУчет;
 	для каждого стр из ОС цикл
		Движение = МестонахождениеОСОрганизаций.Добавить();
	    
		Движение.Период           = Дата;
		Движение.ОсновноеСредство = стр.ОсновноеСредство;
		Движение.Организация      = Организация;
		Движение.МОЛ              = МОЛОрганизации;
		Движение.Местонахождение  = ПодразделениеОрганизации;

	Конеццикла;	
	
КонецПроцедуры	

Процедура движениеПОИМНС()
	Если  Не ПеремещениеВДРугойОфис Тогда
		 возврат;
	КонецЕслИ;	
	
	РегистрацияОС_В_ИФНС = Движения.РегистрацияОС_В_ИФНС;
	для каждого стр из ОС цикл
		Движение = РегистрацияОС_В_ИФНС.Добавить();
		Движение.Период           = Дата;
		Движение.ОС = стр.ОсновноеСредство;
		Движение.РегистрацияВИФНС           = РегистрацияВИФНС;
	Конеццикла;	
	
КонецПроцедуры	

///Вадим 23.10.2013 15:37:25
Процедура ИзменениеСпособовОтражения()
	//начало изменений БП 10
	Если ПРГ_ВидОперации = Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.ОСПоЛизингу Тогда
		возврат;
	КонецЕсли;	
	//конец изменений БП 10 
	
	//Бирюков начало изменений: 012 счет
	Если ПРГ_ВидОперации=Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.Счет_012 тогда
		Возврат;
	КонецЕсли;
	//Бирюков Конец изменений
	
	ДатаДока       = Дата;
	ТекОрганизация = Организация;

	Если ОтражатьВБухгалтерскомУчете Тогда
		
		НаправленияНМА = Движения.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет;
	
		Для каждого СтрокаТЧ Из ОС Цикл

			Движение = НаправленияНМА.Добавить();
			Движение.Период           = ДатаДока;
			Движение.Организация      = ТекОрганизация;
			Движение.ОсновноеСредство = СтрокаТЧ.ОсновноеСредство;
			Движение.СпособыОтраженияРасходовПоАмортизации = СпособОтраженияРасходовБУ;

		КонецЦикла;
		
		НаправленияНМА = Движения.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет;

		Для каждого СтрокаТЧ Из ос Цикл

			Движение = НаправленияНМА.Добавить();

			Движение.Период           = ДатаДока;
			Движение.Организация      = ТекОрганизация;
			Движение.ОсновноеСредство = СтрокаТЧ.ОсновноеСредство;
			Движение.СпособыОтраженияРасходовПоАмортизации = СпособОтраженияРасходовНУ;

		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
//ВадимКонец


///Вадим 23.10.2013 15:16:58
Процедура проверитьЗаполняемостьРеквизитов(отказ)
	//начало изменений БП 10
	Если ПеремещениеВДРугойОфис и Не ЗначениеЗаполнено(РегистрацияВИФНС)Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле ИФНС",отказ);
	КонецЕсли;	
	//конец изменений БП 10 
	//Бирюков начало изменений: 012 счет
	Если ПРГ_ВидОперации = Перечисления.ПРГ_ВидыОперацииИзмененияСостоянияОС.Счет_012 Тогда 
		Возврат;
	КонецЕсли;
	//Бирюков конец изменений
   /////////////проверяем способы отражения и выбранное подразделение
   найденныестроки=СпособОтраженияРасходовБУ.Способы.НайтиСтроки(новый Структура("ПодразделениеОрганизации",ПодразделениеОрганизации));
   если найденныестроки.Количество()=0 тогда
		отказ=  истина;
		сообщить("Выбранного подразделения нет в способе отражения расходов БУ" );
	Конецесли;  
	
   найденныестроки=СпособОтраженияРасходовНУ.Способы.НайтиСтроки(новый Структура("ПодразделениеОрганизации",ПодразделениеОрганизации));
   если найденныестроки.Количество()=0 тогда
		отказ=  истина;
		сообщить("Выбранного подразделения нет в способе отражения расходов НУ" );
	Конецесли;  
КонецПроцедуры
//ВадимКонец

//ВадимКонец



