//////////////////Отвправка табелей

 
Функция СформироватьТабель(ПодразделениеОрганизации,ДатаНачалаПериода,ДатаОкончанияПериода,СписокСотрудников=Неопределено)
	ФильтрСоответствия = Новый Соответствие;
	
	
	ФильтрСоответствия.Вставить("ДатаНачала", ДатаНачалаПериода);
	ФильтрСоответствия.Вставить("ДатаОкончания", ДатаОкончанияПериода);
	Если не СписокСотрудников=Неопределено тогда
		ФильтрСоответствия.Вставить("Работник", СписокСотрудников);
		ФильтрСоответствия.Вставить("ВидСравненияРаботника", ВидСравнения.ВСписке);
		ФильтрСоответствия.Вставить("ОтборРаботника", Истина);
	Иначе
		
		ФильтрСоответствия.Вставить("Подразделение", ПодразделениеОрганизации);
		ФильтрСоответствия.Вставить("ОтборПодразделения", ЗначениеЗаполнено(ПодразделениеОрганизации));
		ФильтрСоответствия.Вставить("ВидСравненияПодразделения", ВидСравнения.ВИерархии);
	Конецесли;
	ТабДокумент = Новый ТабличныйДокумент;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Т13";
	ТабДокумент.АвтоМасштаб        = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.Очистить();
	
	Отчет = Отчеты.УнифицированнаяФормаТ13.Создать();
	
	Отчет.УстановитьФильтр(ФильтрСоответствия);
	ТекстОшибки = "";
	Отчет.СформироватьОтчет(ТабДокумент, "Табель", ТекстОшибки);
	///ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ТабДокумент.АвтоМасштаб=Истина;
	Если ТекстОшибки <> "" или ТабДокумент.ВысотаТаблицы=0 Тогда
		//РаботаСДиалогами.ВывестиПредупреждение(ТекстОшибки);
		Возврат Неопределено;
	Иначе
		Возврат ТабДокумент;
	КонецЕсли;
	
	
	
КонецФункции	


Функция получитьТекстЗапроса(отбор) экспорт
	
	возврат  "ВЫБРАТЬ
	|	ПРГ_СписокРассылкиОтчетов.ФизЛицо,
	|	ПРГ_СписокРассылкиОтчетов.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.ПРГ_СписокРассылкиОтчетов КАК ПРГ_СписокРассылкиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПРГ_СписокРассылкиОтчетов.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|ГДЕ
	|	ПРГ_СписокРассылкиОтчетов."+отбор+"
	|ИТОГИ ПО
	|	ПодразделенияОрганизаций"
	
	
	
КонецФункции	

Процедура ОтправитьТабели(НачалоПериода,КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  получитьТекстЗапроса("ТабелиУчетаРабочегоВремени");
	
	Результат = Запрос.Выполнить();
	
	ВыборкаПодразделенияОрганизаций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделенияОрганизаций.Следующий() Цикл
		
		табДок=СформироватьТабель(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода,КонецДня(КонецПериода));
		
		ВыборкаДетальныеЗаписи = ВыборкаПодразделенияОрганизаций.Выбрать();
		СпсАдресатов=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпсАдресатов.Добавить(ВыборкаДетальныеЗаписи.Представление);
		КонецЦикла;
		если не табДок=Неопределено тогда
			сообщить(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций.код);
			
			имяфайла="";
			имяфайла=КаталогВременныхФайлов()+"Табель.PDF";
	        ТабДок.Записать(имяфайла,ТипФайлаТабличногоДокумента.PDF);
			//{23.06.2016 Островерхий заявка №б/н 
			ПредставлениеОрганизации = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Справочники.ПРГ_Служебный.ОрганизацияПоУмолчанию,Новый Структура("Наименование","Выразить(Объект КАК Справочник.Организации).Наименование")).Наименование; 
			//23.06.2016 Островерхий}
			ПРГ_Регламентый.ОправитьФайл("Табель по подразделению: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,СпсАдресатов,
			//"Табель по подразделению: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций +"
			//|
			//| Добрый день.
			//| Уважаемые коллеги, напоминаю, что срок  предоставления табеля учета рабочего времени:
			//| за первую половину месяца – 18 числа текущего месяца до 10-00,
			//| за месяц – последний рабочий день текущего месяца до 18-00
			//| 
			//| Оригинал табеля должен быть предоставлен в Липецк не позднее 14 дней с момента подписания.
			//| 
			//| Сроки прошу не нарушать.
			//| Обратите внимание, табель должен быть подписан как минимум 2 подписями – ответственным лицом (HR) и руководителем подразделения.
			//| Спасибо.
			//| 
            //Blik 290216 49617 убрала префиксы из эл ардреса
			"Добрый день!
			|Вам необходимо согласовать Табель учета рабочего времени работников Подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций+" 
			|
			|Для согласования необходимо проверить табель и переслать файл с подтверждением правильности заполнения и Вашего согласования HR-менеджеру  по e-mail:
			|
			|
			|Центральный офис,Дивизион Зарубежье					Кулькова Ирина(IKulkova@progressfood.ru)
			|Дивизион Центр,Московский филиал						Спирина Татьяна(TSpirina@progressfood.ru)
			|Дивизион Восток,Дивизион Урал,Дивизион Поволжье		Сорока Елена(ESoroka@progressfood.ru)
			|Дивизион Юг и ЦЧР										Лимонова Ольга(OLimonova@progressfood.ru)
			|СПб филиал												Попова Ольга(OBPopova@progressfood.ru)
			|Липецк													Баранова Екатерина(EBaranova@progressfood.ru)
			|
			|Установленный срок согласования:
			|- за первую половину месяца – до 14-00 мск  17 числа текущего месяца;
			|- за месяц – до 13-00 мск. первого числа следующего месяца. 
			|
			|Оригинал подписанного табеля за месяц предоставить в отдел кадрового документооборота и оплаты труда до 10го числа следующего месяца
			| С наилучшими пожеланиями, 
			| Толкачева Елена
			| руководитель отдела КДиОТ
			| "+ПредставлениеОрганизации+"
			| тел. (4742) 42-29-03"
			
			,имяфайла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьТабелиВИП(НачалоПериода,КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  получитьТекстЗапроса("ТабелиУчетаРабочегоВремениВИП");
	
	Результат = Запрос.Выполнить();
	
	ВыборкаПодразделенияОрганизаций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделенияОрганизаций.Следующий() Цикл
		СписокСотрудников=получитьВипСотрудников(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода);
		если СписокСотрудников.Количество()=0 тогда Продолжить;КонецЕсли;
		
		табДок=СформироватьТабель(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода,КонецДня(КонецПериода),СписокСотрудников);
		
		ВыборкаДетальныеЗаписи = ВыборкаПодразделенияОрганизаций.Выбрать();
		СпсАдресатов=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпсАдресатов.Добавить(ВыборкаДетальныеЗаписи.Представление);
		КонецЦикла;
		если не табДок=Неопределено тогда
			имяфайла="";
			имяфайла=КаталогВременныхФайлов()+"Табель.PDF";
	        ТабДок.Записать(имяфайла,ТипФайлаТабличногоДокумента.PDF);
			//{23.06.2016 Островерхий заявка №б/н 
			ПредставлениеОрганизации = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Справочники.ПРГ_Служебный.ОрганизацияПоУмолчанию,Новый Структура("Наименование","Выразить(Объект КАК Справочник.Организации).Наименование")).Наименование; 
			//23.06.2016 Островерхий} 
			
			ПРГ_Регламентый.ОправитьФайл("Табель по вип сотрудникам подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,СпсАдресатов,
			//Blik 290216 49617 убрала префиксы из эл ардреса
			"Добрый день!
			|Вам необходимо согласовать Табель учета рабочего времени работников Подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций+" 
			|
			|Для согласования необходимо проверить табель и переслать файл с подтверждением правильности заполнения и Вашего согласования HR-менеджеру  по e-mail:
			|
			|
			|Центральный офис,Дивизион Зарубежье					Кулькова Ирина(IKulkova@progressfood.ru)
			|Дивизион Центр,Московский филиал						Спирина Татьяна(TSpirina@progressfood.ru)
			|Дивизион Восток,Дивизион Урал,Дивизион Поволжье		Сорока Елена(ESoroka@progressfood.ru)
			|Дивизион Юг и ЦЧР										Лимонова Ольга(OLimonova@progressfood.ru)
			|СПб филиал												Попова Ольга(OBPopova@progressfood.ru)
			|Липецк													Баранова Екатерина(EBaranova@progressfood.ru)
			|
			|Установленный срок согласования:
			|- за первую половину месяца – до 14-00 мск  17 числа текущего месяца;
			|- за месяц – до 13-00 мск. первого числа следующего месяца. 
			|
			|Оригинал подписанного табеля за месяц предоставить в отдел кадрового документооборота и оплаты труда до 10го числа следующего месяца
			| С наилучшими пожеланиями, 
			| Толкачева Елена
			| руководитель отдела КДиОТ
			| "+ПредставлениеОрганизации+"
			| тел. (4742) 42-29-03"


			,имяфайла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

/////Вадим 02.07.2013 8:34:20
Функция получитьВипСотрудников(ПодразделенияОрганизаций,ДатаСреза)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, ) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство В
	|				(ВЫБРАТЬ
	|					СвойстваОбъектов.Ссылка
	|				ИЗ
	|					ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|				ГДЕ
	|					СвойстваОбъектов.Наименование = ""ВипСотрудник""))
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Значение = ИСТИНА";
	Запрос.УстановитьПараметр("Дата", ДатаСреза);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделенияОрганизаций);
	
	Результат = Запрос.Выполнить();
	возврат Результат.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	

	

КонецФункции 
// получитьВипСотрудников(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций);() ВадимКонец

//начало изменений Ожиганов А. 21.03.2017 63517 блокировка редактирования справочника серии из формы 
Функция ПРГ_ОпределитьестьлиСпецДоктыПоСерии(СерияНоменклатуры) Экспорт
	Запрос = Новый запрос("ВЫБРАТЬ
	                      |	СУММА(КолВоДоков.КолВо) КАК КолВо
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*) КАК КолВо
	                      |	ИЗ
	                      |		Документ.ВыпускПродукции.Продукция КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ОтчетПроизводстваЗаСмену.Продукция КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ОтчетПроизводстваЗаСмену.Материалы КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ПеремещениеТоваров.Товары КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете) КАК КолВоДоков");
						  
	КолВодоков = 0;
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		КолВодоков = Выборка.КолВо;
	КонецЕсли;	
	
	возврат ?(КолВодоков>0,Истина,Ложь);
	
КонецФункции	
//конец изменений 