Процедура УстановитьПараметрГраницыЗапретаИзмененияДанныхМСФО() Экспорт
		
	Если РольДоступна("ПолныеПрава") И НЕ Константы.ПрименятьДатуЗапретаДляПолныхПрав.Получить() Тогда
		ПараметрыСеанса.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО  = Новый ФиксированноеСоответствие(Новый Соответствие);
		
		Возврат;
    КонецЕсли;
    
    ТекстЗапросаПоОрганизациям = "
    |ВЫБРАТЬ
    |       Значение(Справочник.Организации.ПустаяСсылка) как Организация
    |   ОБЪЕДИНИТЬ ВСЕ
    |   ВЫБРАТЬ
    |       Организации.Ссылка
    |   ИЗ 
    |       Справочник.Организации КАК Организации ";
	
    ТекстЗапросаПоОбщейДатеЗапретаРедактирования = "ВЫБРАТЬ
                                                   |    ЕстьNull(ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений, ДатаВремя(1,1,1)) КАК ОбщаяДата
                                                   |ИЗ
                                                   |    РегистрСведений.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО КАК ГраницыЗапретаИзмененияДанных
                                                   |ГДЕ
                                                   |    ГраницыЗапретаИзмененияДанных.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
                                                   |    И ГраницыЗапретаИзмененияДанных.Пользователь = НЕОПРЕДЕЛЕНО";
    ТекстЗапросаПоПриоритетамЗаписей = "ВЫБРАТЬ
                                       |    Границы.Организация КАК Организация,
                                       |    Границы.Пользователь КАК Пользователь,
                                       |    ВЫБОР
                                       |        КОГДА Границы.Пользователь = НЕОПРЕДЕЛЕНО
                                       |            ТОГДА 3
                                       |        КОГДА Границы.Пользователь ССЫЛКА Справочник.ГруппыПользователей
                                       |                И ГруппыПользователей.Пользователь = &Пользователь
                                       |            ТОГДА 2
                                       |        КОГДА Границы.Пользователь ССЫЛКА Справочник.Пользователи
                                       |                И Границы.Пользователь = &Пользователь
                                       |            ТОГДА 1
                                       |    КОНЕЦ КАК Приоритет,
                                       |    Границы.ГраницаЗапретаИзменений КАК ГраницаЗапретаИзменений
                                       |ИЗ
                                       |    РегистрСведений.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО КАК Границы
                                       |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователей
                                       |        ПО (ГруппыПользователей.Пользователь = &Пользователь И ГруппыПользователей.Ссылка = Границы.Пользователь)";
                                       
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
                   |    Организации.Организация как Организация,
                   |    МИНИМУМ(ЕСТЬNULL(ТаблицаГраницыЗапрета.ГраницаЗапретаИзменений, ОбщаяДатаЗапрета.ОбщаяДата)) КАК ГраницаЗапретаИзменений,                   
                   |    ОбщаяДатаЗапрета.ОбщаяДата как ОбщаяДата
                   |ИЗ
                   | (" + ТекстЗапросаПоОрганизациям+") Как Организации  
                   |        ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |            Границы.Организация КАК Организация,
                   |            МИНИМУМ(Приоритеты.Приоритет) КАК Приоритет
                   |        ИЗ
                   |            РегистрСведений.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО КАК Границы
                   |                ЛЕВОЕ СОЕДИНЕНИЕ (" + ТекстЗапросаПоПриоритетамЗаписей + ") КАК Приоритеты
                   |                ПО Границы.Организация = Приоритеты.Организация
                   |                    И Границы.Пользователь = Приоритеты.Пользователь
                   |        
                   |        СГРУППИРОВАТЬ ПО
                   |            Границы.Организация) КАК ТаблицаПриоритетов
                   |        ПО ТаблицаПриоритетов.Организация = Организации.Организация
                   |        ЛЕВОЕ СОЕДИНЕНИЕ (" + ТекстЗапросаПоПриоритетамЗаписей + ") КАК ТаблицаГраницыЗапрета
                   |        ПО ТаблицаПриоритетов.Организация = ТаблицаГраницыЗапрета.Организация
                   |            И ТаблицаПриоритетов.Приоритет = ТаблицаГраницыЗапрета.Приоритет,
                   | (" + ТекстЗапросаПоОбщейДатеЗапретаРедактирования + ") Как ОбщаяДатаЗапрета
                   |СГРУППИРОВАТЬ ПО
                   |    Организации.Организация, ОбщаяДата";
	
	Запрос.УстановитьПараметр("Пользователь", глЗначениеПеременной("глТекущийПользователь"));
    
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Соответствие = Неопределено;
	Иначе			
		Соответствие = Новый Соответствие;
		Выборка = РезультатЗапроса.Выбрать();
        ОбщаяДатаЗапрета = Неопределено;
		Пока Выборка.Следующий() Цикл
			Соответствие[Выборка.Организация] = ?(ЗначениеЗаполнено(Выборка.ГраницаЗапретаИзменений), КонецДня(Выборка.ГраницаЗапретаИзменений), Выборка.ГраницаЗапретаИзменений);
            Если ОбщаяДатаЗапрета = Неопределено Тогда
                ОбщаяДатаЗапрета = ?(ЗначениеЗаполнено(Выборка.ОбщаяДата), КонецДня(Выборка.ОбщаяДата), Выборка.ОбщаяДата);
            КонецЕсли;            
        КонецЦикла;
        
        Если НЕ ОбщаяДатаЗапрета = Неопределено Тогда
            Соответствие["ОбщаяДатаЗапретаРедактирования"] = ОбщаяДатаЗапрета;
        КонецЕсли;
        
		Если Соответствие.Количество() = 0 Тогда
			Соответствие = Неопределено;
		КонецЕсли;		
	КонецЕсли;
	
	Если Соответствие <> Неопределено Тогда
		СохранятьСоответствие = Ложь;
		Для Каждого КлючИЗначение Из Соответствие Цикл
			ЕСли ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				СохранятьСоответствие = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ СохранятьСоответствие Тогда
			Соответствие = Неопределено;
		КонецЕсли;			
	КонецЕсли;
	
	Если Соответствие = Неопределено Тогда
		ПараметрыСеанса.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО  = Новый ФиксированноеСоответствие(Новый Соответствие);
	Иначе
		ПараметрыСеанса.ПРГ_ГраницыЗапретаИзмененияДанныхМСФО  = Новый ФиксированноеСоответствие(Соответствие);
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПРГ_УстановитьИменаМетаданныхМСФО(ЭтоМСФО=Ложь) Экспорт 
	
	МассМета = Новый Массив;
	
	//начало изменений Ожиганов 08.07.2015 создание базы МСФО 
	МассМета.Добавить("спр.дс_корректировки");
	МассМета.Добавить("спр.дс_показателиотчета");
	МассМета.Добавить("спр.дс_показателиотложенныхналогов");
	МассМета.Добавить("спр.дс_показателиотчетаpl");
	МассМета.Добавить("спр.дс_показателибаланса");
	МассМета.Добавить("спр.дс_показателиотчетаанализсебестоимостиреализованнойпродукции");
	МассМета.Добавить("спр.ис_показателиотложенныхналогов");
	
	МассМета.Добавить("спр.isвидыисточниковотчетовпэо");
	МассМета.Добавить("спр.isвыраженияотчетовпэо");
	МассМета.Добавить("спр.isисточникиотчетовпэо");
	МассМета.Добавить("спр.isнастройкиотчетовпэо");
	МассМета.Добавить("спр.isпараметрыотчетовпэо");
	МассМета.Добавить("спр.isсекцииотчетов");
	МассМета.Добавить("спр.isстрокиотчетовпэо");
	//начало изменений Ожиганов 10.08.2015 изменения МСФО 
	МассМета.Добавить("спр.is_запросынапроведениетрансляциипроводок");

	//конец изменений 
	//Добавлено Андрей Перов 17.10.2017
	МассМета.Добавить("спр.прг_правилапереносапроводокму");
	//Конец добавления
	//начало изменений Ожиганов 30.07.2015 встави справочники которые не включены в план обмена, но нужны в базе МСФО
	ПарраметрыОбменаМСФО = ПРГ_Привелегированный.ПолучитПараметрыОбменаСМСФО();
	Если 	(ПарраметрыОбменаМСФО.ПланОбменаИспользуется
		и ПарраметрыОбменаМСФО.ЭтоБазаМСФО) или ЭтоМСФО Тогда
		МассМета.Добавить("спр.пользователи");
		//>>181215 Степанов
		МассМета.Добавить("спр.группыпользователей");
		//<<
		МассМета.Добавить("спр.настройкиобменаданными");
		МассМета.Добавить("спр.УчетныеЗаписидокументооборота");
		МассМета.Добавить("спр.учетныезаписиэлектроннойпочты");
		МассМета.Добавить("спр.настройкивыполненияобмена");
		МассМета.Добавить("спр.настройкивыполненияобмена");
		МассМета.Добавить("спр.электронноеписьмо");
		//начало изменений Ожиганов 11.08.2015 изменения МСФО 
		МассМета.Добавить("спр.внешниеобработки");
		//конец изменений
		//>>020616 Степанов
		МассМета.Добавить("спр.значениясвойствобъектов");
		//<<
		
		МассМета.Добавить("рег.параметрыобменаданными");
		
		
		МассМета.Добавить("рег.значениядополнительныхправпользователя");
		МассМета.Добавить("рег.настройкипользователей");
		МассМета.Добавить("рег.пользователиУчетныхзаписейдокументооборота");
		МассМета.Добавить("рег.сохраненныенастройки");
		МассМета.Добавить("рег.ап_ролипользователей");
		МассМета.Добавить("рег.версииобъектов");
		МассМета.Добавить("рег.историяобменаданными");
		МассМета.Добавить("рег.ролииисполнители");
		
		

	КонецЕсли;	
		
	
	//конец изменений 
	
	МассМета.Добавить("док.амортизациянмамеждународный");
	МассМета.Добавить("док.амортизацияосмеждународный");
	МассМета.Добавить("док.внутреннееперемещениеосновныхсредствмеждународный");
	МассМета.Добавить("док.выбытиенмамеждународный");
	МассМета.Добавить("док.выбытиеосновныхсредствмеждународный");
	МассМета.Добавить("док.закрытиесчетовгодамеждународный");
	МассМета.Добавить("док.изменениепараметровнмамеждународный");
	МассМета.Добавить("док.изменениепараметровосновныхсредствмеждународный");
	МассМета.Добавить("док.начислениерасходовмеждународный");
	МассМета.Добавить("док.начислениерезервовмеждународный");
	МассМета.Добавить("док.обесценениеактивовмеждународный");
	МассМета.Добавить("док.операциямеждународная");
	МассМета.Добавить("док.переводосновныхсредствиинвестиционнойсобственностимеждународный");
	МассМета.Добавить("док.переносзатратнапроизводствомеждународный");
	МассМета.Добавить("док.переноспартиймеждународный");
	МассМета.Добавить("док.переноспроводокмеждународный");
	МассМета.Добавить("док.переоценкаактивовмеждународный");
	МассМета.Добавить("док.переоценкавалютныхстатеймеждународный");
	МассМета.Добавить("док.поступлениенмамеждународный");
	МассМета.Добавить("док.поступлениеосновныхсредствмеждународный");
	МассМета.Добавить("док.списаниемпзмеждународный");
	МассМета.Добавить("док.установкасоответствиясчетовбуимсфо");
	МассМета.Добавить("док.дс_рекласификациярасходовосмсфо");
	МассМета.Добавить("док.дс_расчетамортизацииоспропорциональнообъемувыпуска");
	МассМета.Добавить("док.дс_корректировкарасходовпореализациипродукцииснепрошедшимправомсобственности");
	МассМета.Добавить("док.дс_установкасоответствиясчетовбуимсфопорезервам");
	//начало изменений Ожиганов 04.08.2015 обмен с МСФО, т.к. документ меняет реквизиты договора, дадим корректировать его в центре
	//МассМета.Добавить("док.дс_графикплатежей");
	//конец изменений 
	МассМета.Добавить("док.дс_объемвыпускадлярасчетаамортизацииос");
	МассМета.Добавить("док.дс_расчетфактическогоплатежамсфо");
	МассМета.Добавить("док.дс_начислениекурсовыхразницинераспределеннойприбыли");
	МассМета.Добавить("док.дс_реклассификациязадолжности");
	МассМета.Добавить("док.дс_установкаправилкорректировки");
	МассМета.Добавить("док.дс_корректировки");
	МассМета.Добавить("док.дс_правилапереносасчетазатрат");
	МассМета.Добавить("док.дс_расчетотложенногоналога");
	МассМета.Добавить("док.дс_баланс");
	МассМета.Добавить("док.дс_переноспродажмсфо");
	МассМета.Добавить("док.дс_корректировканачисленийполизингу");
	МассМета.Добавить("док.ис_сведенияопериодевыпускареализованнойпродукции");
	МассМета.Добавить("док.ис_расчетипризнаниеотложенныхналоговмсфо");
	МассМета.Добавить("док.ис_распределениезатратпообесцениваниюактивовмсфо");
	МассМета.Добавить("док.ис_корректировкапродукцииснеперешедшимиправамисобственностимеждународныйучет");
	//>>270815 Степанов, 43413
	МассМета.Добавить("док.ис_переносотложенныхзатратмеждународныйучет");
    //<<270815
	//>>291015
	МассМета.Добавить("док.прг_закрытиесчетовпериодамеждународный");
	//<<
	//>>140116
	МассМета.Добавить("док.прг_регистрациясуммpl_мсфо");
	МассМета.Добавить("док.пргкорректировкапереходящихотгрузок");
	//<<
	/// Кунов О.В., 18.02.2016 - 48048
	МассМета.Добавить("док.прг_закрытиедоговоровповыбывшимобъектамос");
	///
	/// Кунов О.В., 16.01.2017 - 59111
	МассМета.Добавить("док.прг_модернизацияос_мсфо");
	///
	
	//регистры накопления
	МассМета.Добавить("рег.браквпроизводствемеждународныйучет");
	МассМета.Добавить("рег.выпускпродукциимеждународныйучет");
	МассМета.Добавить("рег.затратымеждународныйучет");
	МассМета.Добавить("рег.затратынавыпускпродукциимеждународныйучет");
	МассМета.Добавить("рег.незавершенноепроизводствомеждународныйучет");
	МассМета.Добавить("рег.партиитоваровнаскладахмеждународныйучет");
	МассМета.Добавить("рег.партиитоваровпереданныемеждународныйучет");
	МассМета.Добавить("рег.затратынавыпускпродукциинаработкамеждународныйучет");
	МассМета.Добавить("рег.дс_затратынавыпускпродукциимеждународныйучетостаточный");
	МассМета.Добавить("рег.дс_затратынареализациюпродукциимеждународныйучет");
	МассМета.Добавить("рег.дс_выпускпродукциимеждународныйучетостаточный");
	МассМета.Добавить("рег.дс_продажимсфо");
	МассМета.Добавить("рег.ис_периодвыпускареализованнойпродукции");
	МассМета.Добавить("рег.ис_расходыбудущихпериодовмеждународныйучет");
	МассМета.Добавить("рег.ис_средневзвешеннаясебестоимостьмеждународныйучет");
	МассМета.Добавить("рег.ис_продажикорректировкипродукциимеждународныйучет");
	//>>140116
	МассМета.Добавить("рег.суммыпопоказателямpl");
	//<<
	
	/// Кунов О.В., 30.11.2016 - 59558
	МассМета.Добавить("рег.прг_прибыльностьреализации");
	///
	
	//регистры сведений
	МассМета.Добавить("рег.базараспределениязатратмеждународныйучет");
	МассМета.Добавить("рег.нематериальныеактивымеждународныйучет");
	МассМета.Добавить("рег.основныесредствамеждународныйучет");
	МассМета.Добавить("рег.соответствиесчетовбуимсфо");
	МассМета.Добавить("рег.счетасособымпорядкомпереоценкимеждународный");
	МассМета.Добавить("рег.учетнаяполитикамеждународныйучет");
	МассМета.Добавить("рег.дс_расчетамортизацииоспропорциональнообъемувыпуска");
	МассМета.Добавить("рег.дс_соответствиесчетовбуимсфопорезервам");
	МассМета.Добавить("рег.дс_ставкаlibor");
	МассМета.Добавить("рег.дс_объемвыпускадлярасчетаамортизацииос");
	МассМета.Добавить("рег.дс_исключениесчетов");
	МассМета.Добавить("рег.дс_соответствиесчетовбуимсфопокорректировкам");
	МассМета.Добавить("рег.дс_правилапереносасчетазатрат");
	МассМета.Добавить("рег.дс_распределениезатратпопеределаморганизациймсфо");
	МассМета.Добавить("рег.дс_распределениепродукциипопеределаморганизациймсфо");
	МассМета.Добавить("рег.дс_корректировкиначисленийполизингу");
	МассМета.Добавить("рег.дс_базапрямыхзатрат");
	МассМета.Добавить("рег.ис_статьитэрмсфо");
	МассМета.Добавить("рег.дс_графикплатежей");
	//>>280815 Степанов
	МассМета.Добавить("рег.ис_затратыбудущихпериодовмеждународный");
	//<<
	//>>300915 Степанов
	МассМета.Добавить("рег.ис_переносзатратнадругиеподразделениямеждународныйучет");
	МассМета.Добавить("рег.прг_границызапретаизмененияданныхмсфо");
	//<<
	
	//начало изменений Ожиганов 10.08.2015 изменения МСФО 
	МассМета.Добавить("рег.ис_пустыесубконто");
	МассМета.Добавить("рег.ис_списанныетоварымеждународныйучет");
	МассМета.Добавить("рег.ис_статьизатратноменклатуры");
	МассМета.Добавить("рег.is_протоколработытрансляциипроводок");
	//конец изменений 
	//начало изменений Ожиганов 15.10.2015 б/н обновление МСФО
	МассМета.Добавить("рег.ис_прибыльностьреализации");
	//конец изменений
	МассМета.Добавить("рег.прг_списанныетоварыдополнительный");//<<111115 Степанов
	
	//регистр бухглатерии
	МассМета.Добавить("рег.международный");
	//Добавлено Андрей Перов 18.10.2017
	МассМета.Добавить("рег.прг_настройкиправилпереносапроводокму");
	//Конец добавления
	ПараметрыСеанса.ПРГ_ИмяОбъектовМСФО = Новый ФиксированныйМассив(МассМета);
КонецПроцедуры	

Процедура УстановитьПРГ_ПараметрыОбменМСФО() Экспорт 
	//начало изменений Ожиганов 30.07.2015 б/н
	ПараметрыСеанса.ПРГ_ПараметрыОбменМСФО = Новый ФиксированнаяСтруктура(ПРГ_Привелегированный.ПолучитПараметрыОбменаСМСФО());
	возврат
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	КОЛИЧЕСТВО(*) КАК КолВо
	//					  |ИЗ
	//					  |	ПланОбмена.ПРГ_ОбменМСФО КАК ПРГ_ОбменМСФО");
	//ПланОбменаИспользуется = Ложь;					  
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ПланОбменаИспользуется = Выборка.КолВо >=2;
	//КонецЕсли;	
	//
	//
	//ТекУзел     = ПланыОбмена.ПРГ_ОбменМСФО.ЭтотУзел();
	//ЭтоБазаМСФО = ТекУзел.ЭтоБазаМСФО;
	//
	//ПараметрыСеанса.ПРГ_ПараметрыОбменМСФО = Новый ФиксированнаяСтруктура(
	//			Новый Структура("ПланОбменаИспользуется,ТекУзел,ЭтоБазаМСФО"
	//			,ПланОбменаИспользуется,ТекУзел,ЭтоБазаМСФО));
	//конец изменений 							
	
						  
КонецПроцедуры	

Функция ПолучитПараметрыОбменаСМСФО() Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(*) КАК КолВо
	                      |ИЗ
	                      |	ПланОбмена.ПРГ_ОбменМСФО КАК ПРГ_ОбменМСФО");
	ПланОбменаИспользуется = Ложь;					  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПланОбменаИспользуется = Выборка.КолВо >=2;
	КонецЕсли;	
	
	
	ТекУзел     = ПланыОбмена.ПРГ_ОбменМСФО.ЭтотУзел();
	ЭтоБазаМСФО = ТекУзел.ЭтоБазаМСФО;
	
	
	возврат Новый Структура("ПланОбменаИспользуется,ТекУзел,ЭтоБазаМСФО"
				,ПланОбменаИспользуется,ТекУзел,ЭтоБазаМСФО);	
	
КонецФункции	

Процедура ПолучитьКоличествоВерсийОбъекта(Ссылка,НомерВерсии,ХЭШ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ ЕСТЬNULL(МАКСИМУМ(НомерВерсии), 0) КАК НомерВерсии
	| ИЗ РегистрСведений.ВерсииОбъектов
	| ГДЕ Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ХЭШ = "";
	НомерВерсии = Выборка.НомерВерсии;
	Если  НомерВерсии =0 Тогда
		возврат;
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВерсииОбъектов.ПРГ_ХЭШМД5
	               |ИЗ
	               |	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	               |ГДЕ
	               |	ВерсииОбъектов.Объект = &Ссылка
	               |	И ВерсииОбъектов.НомерВерсии = &НомерВерсии";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерВерсии", НомерВерсии);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ХЭШ = Выборка.ПРГ_ХЭШМД5;
	
	
	
КонецПроцедуры


Процедура ЗаписатьВерсиюОбъекта(знач Ссылка,
                                знач ЧислоВерсийОбъекта,
                                знач ХранилищеДанных,ХЭШ) Экспорт
	
	МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиВерсииОбъектов.Объект        	= Ссылка;
	МенеджерЗаписиВерсииОбъектов.ДатаВерсии    	= ТекущаяДата();
	МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта 	= ХранилищеДанных;
	МенеджерЗаписиВерсииОбъектов.НомерВерсии	= ЧислоВерсийОбъекта + 1;
	МенеджерЗаписиВерсииОбъектов.АвторВерсии	= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписиВерсииОбъектов.УдалитьСжато 	= Истина;
	МенеджерЗаписиВерсииОбъектов.ПРГ_ХЭШМД5    =  ХЭШ;
	
	МенеджерЗаписиВерсииОбъектов.Записать();
	
КонецПроцедуры

//начало изменений Ожиганов 31.08.2015 процедуры для определения ошибок проведения документа на сервере
Процедура ПРГ_Провести_Записать_ДокНасервере(ВыбДок) Экспорт 
	Объект = ВыбДок.ПолучитьОбъект();
	Объект.Записать(?(Объект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
КонецПроцедуры	
//конец изменений 

Процедура СохранитьРезультатРасчетаПланаПродаж(ТЗРезультатРасчета,НулевыеЦены) Экспорт 

	ТекущийПлан = Неопределено;
	тОбъект = Неопределено;
    сч = 1;
	КоличествоСтрокВсего = ТЗРезультатРасчета.Количество();
	
	Для каждого ТекущаяСтрока Из ТЗРезультатРасчета Цикл
	
		Если НЕ ТекущийПлан = ТекущаяСтрока.Ссылка
			ИЛИ сч > КоличествоСтрокВсего Тогда
			
			//Запишем предыдущий план
			Если НЕ ТекущийПлан = Неопределено Тогда
			
				Попытка
					тОбъект.Записать(РежимЗаписиДокумента.Проведение);	
					//Сообщить("Проведен документ: "+тОбъект);
				Исключение
					//Сообщить("Ошибка при проведение документа: "+тОбъект,СтатусСообщения.ОченьВажное);
				КонецПопытки; 
				
				//Индикатор = Индикатор + 1;
			
			КонецЕсли; 
			
			тОбъект = ТекущаяСтрока.Ссылка.ПолучитьОбъект();
			тОбъект.СоставПлана.Очистить();	
			
			//сохраним нулевые цены
			тОбъект.ППП_ТаблицаНулевыхЦен.Очистить();
			Для каждого Стр Из НулевыеЦены Цикл
				
				тНоваяСтрока = тОбъект.ППП_ТаблицаНулевыхЦен.Добавить();	
				тНоваяСтрока.Дата = Стр.ПериодПолученияЦен;
				тНоваяСтрока.Цена = Стр.ЦенаБезНДС;
				ЗаполнитьЗначенияСвойств(тНоваяСтрока,Стр);
				
			КонецЦикла;
			
			ТекущийПлан = ТекущаяСтрока.Ссылка;
			
		КонецЕсли; 
		
		тНоваяСтрока = тОбъект.СоставПлана.Добавить();	
		ЗаполнитьЗначенияСвойств(тНоваяСтрока,ТекущаяСтрока);	
		
		сч = сч+1;
		
		//{08.04.2016 Островерхий заявка №49367 
		Если НЕ ТекущийПлан = ТекущаяСтрока.Ссылка
			ИЛИ сч > КоличествоСтрокВсего Тогда
			
			//Запишем предыдущий план
			Если НЕ ТекущийПлан = Неопределено Тогда
			
				Попытка
					тОбъект.Записать(РежимЗаписиДокумента.Проведение);	
					//Сообщить("Проведен документ: "+тОбъект);
				Исключение
					//Сообщить("Ошибка при проведение документа: "+тОбъект,СтатусСообщения.ОченьВажное);
				КонецПопытки; 
				
				//Индикатор = Индикатор + 1;
			
			КонецЕсли; 
		КонецЕсли; 
		//08.04.2016 Островерхий} 
		
	КонецЦикла; 

КонецПроцедуры
 
Процедура РасчетатПланыПродаж(СредниеЦеныБрендообъемов,НулевыеЦены,ПланыПродаж,НачалоПериода,КонецПериода,ПериодПолученияЦен)Экспорт

	РезультатРасчета = Обработки.ПРГРасчетПлановПродажВер3.Создать().РезультатРасчета;
	
	//Формирование базовой выручки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СредниеЦены.АдресПоставки,
		|	СредниеЦены.Брендообъем,
		|	СредниеЦены.ЦенаБезНДС
		|ПОМЕСТИТЬ втСредниеЦены
		|ИЗ
		|	&СредниеЦены КАК СредниеЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НулевыеЦены.АдресПоставки,
		|	НулевыеЦены.Брендообъем,
		|	НулевыеЦены.ЦенаБезНДС
		|ПОМЕСТИТЬ втНулевыеЦены
		|ИЗ
		|	&НулевыеЦены КАК НулевыеЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСредниеЦены.АдресПоставки,
		|	втСредниеЦены.Брендообъем,
		|	втСредниеЦены.ЦенаБезНДС
		|ПОМЕСТИТЬ втЦены
		|ИЗ
		|	втСредниеЦены КАК втСредниеЦены
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втНулевыеЦены.АдресПоставки,
		|	втНулевыеЦены.Брендообъем,
		|	втНулевыеЦены.ЦенаБезНДС
		|ИЗ
		|	втНулевыеЦены КАК втНулевыеЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланПродажСоставПлана.Ссылка.ДатаПланирования КАК Период,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.Дивизион КАК Дивизион,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.НСИ_КатегорияКлиента КАК КатегорияКлиента,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.Владелец.НСИ_Вывеска КАК Вывеска,
		|	ПланПродажСоставПлана.ППП_Брендообъем.ТоварнаяКатегория.Проект КАК Проект,
		|	ПланПродажСоставПлана.ППП_Брендообъем.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	ПланПродажСоставПлана.ППП_АдресПоставки КАК АдресПоставки,
		|	ПланПродажСоставПлана.ППП_Брендообъем КАК Брендообъем,
		|	СУММА(ПланПродажСоставПлана.Количество) КАК Количество,
		|	втЦены.ЦенаБезНДС,
		|	втЦены.ЦенаБезНДС КАК ЦенаБезНДССУчетомПовышения,
		|	СУММА(ПланПродажСоставПлана.Количество * втЦены.ЦенаБезНДС) КАК СуммаБазовойВыручки,
		|	ПланПродажСоставПлана.Ссылка КАК План
		|ИЗ
		|	Документ.ПланПродаж.СоставПлана КАК ПланПродажСоставПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦены КАК втЦены
		|		ПО ПланПродажСоставПлана.ППП_АдресПоставки = втЦены.АдресПоставки
		|			И ПланПродажСоставПлана.ППП_Брендообъем = втЦены.Брендообъем
		|ГДЕ
		|	ПланПродажСоставПлана.Ссылка.Проведен
		|	И ПланПродажСоставПлана.Ссылка В(&МассивПланов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланПродажСоставПлана.ППП_Брендообъем,
		|	ПланПродажСоставПлана.ППП_АдресПоставки,
		|	ПланПродажСоставПлана.Ссылка.ДатаПланирования,
		|	втЦены.ЦенаБезНДС,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.НСИ_КатегорияКлиента,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.Дивизион,
		|	ПланПродажСоставПлана.ППП_АдресПоставки.Владелец.НСИ_Вывеска,
		|	ПланПродажСоставПлана.Ссылка,
		|	ПланПродажСоставПлана.ППП_Брендообъем.ТоварнаяКатегория.Проект,
		|	ПланПродажСоставПлана.ППП_Брендообъем.ТоварнаяКатегория,
		|	втЦены.ЦенаБезНДС";

	Запрос.УстановитьПараметр("СредниеЦены", СредниеЦеныБрендообъемов);
	Запрос.УстановитьПараметр("НулевыеЦены", НулевыеЦены);	
	Запрос.УстановитьПараметр("МассивПланов", ПланыПродаж);

	//Базовая выручка без учета повышения цен
	РезультатРасчета.Загрузить(Запрос.Выполнить().Выгрузить());

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Ссылка.Период КАК Период,
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.КатегорияКлиента КАК КатегорияКлиента,
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Брендообъем,
		|	МАКСИМУМ(ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Процент) КАК Процент
		|ИЗ
		|	Документ.ПП_ГрафикПовышенияЦенНаГП.ТабличнаяЧасть КАК ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть
		|ГДЕ
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Процент <> 0
		|	И ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Ссылка.Период,
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.Брендообъем,
		|	ПП_ГрафикПовышенияЦенНаГПТабличнаяЧасть.КатегорияКлиента";

	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);

	ГрафикПовышенияЦен = Запрос.Выполнить().Выгрузить();
 
    //Скорректируем базовую выручку с учетом графика повышения цен
	Для каждого СтрокаТЧ Из РезультатРасчета Цикл
		
		НайденныеСтроки = ГрафикПовышенияЦен.НайтиСтроки(Новый Структура("КатегорияКлиента,Брендообъем", СтрокаТЧ.КатегорияКлиента,СтрокаТЧ.Брендообъем));
		
		Для каждого СтрГрафикаПовышения Из НайденныеСтроки Цикл
			
			Если СтрокаТЧ.Период >= СтрГрафикаПовышения.Период Тогда
				СтрокаТЧ.ЦенаБезНДССУчетомПовышения = СтрокаТЧ.ЦенаБезНДССУчетомПовышения + СтрокаТЧ.ЦенаБезНДССУчетомПовышения * (СтрГрафикаПовышения.Процент/100);
			КонецЕсли; 
			 	
		КонецЦикла; 
		
		СтрокаТЧ.СуммаБазовойВыручки = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаБезНДССУчетомПовышения;
		
	КонецЦикла;	
	
	//Основной расчет
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатРасчета.Период КАК Период,
		|	РезультатРасчета.Дивизион КАК Дивизион,
		|	РезультатРасчета.КатегорияКлиента КАК КатегорияКлиента,
		|	РезультатРасчета.Вывеска КАК Вывеска,
		|	РезультатРасчета.АдресПоставки,
		|	РезультатРасчета.Проект КАК Проект,
		|	РезультатРасчета.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	РезультатРасчета.Брендообъем,
		|	РезультатРасчета.Количество,
		|	РезультатРасчета.ЦенаБезНДС,
		|	РезультатРасчета.ЦенаБезНДССУчетомПовышения,
		|	РезультатРасчета.СуммаБазовойВыручки,
		|	РезультатРасчета.План,
		|	РезультатРасчета.СуммаВыручкиГросс
		|ПОМЕСТИТЬ втРезультатРасчета
		|ИЗ
		|	&РезультатРасчета КАК РезультатРасчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Дивизион,
		|	КатегорияКлиента,
		|	Вывеска,
		|	Проект,
		|	ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчета.Дивизион,
		|	втРезультатРасчета.КатегорияКлиента,
		|	втРезультатРасчета.Вывеска,
		|	втРезультатРасчета.АдресПоставки,
		|	втРезультатРасчета.Проект,
		|	втРезультатРасчета.ТоварнаяКатегория,
		|	втРезультатРасчета.Брендообъем
		|ПОМЕСТИТЬ втАПИБрендообъемы
		|ИЗ
		|	втРезультатРасчета КАК втРезультатРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчета.Дивизион,
		|	втРезультатРасчета.КатегорияКлиента,
		|	втРезультатРасчета.Вывеска,
		|	втРезультатРасчета.АдресПоставки,
		|	втРезультатРасчета.Проект,
		|	втРезультатРасчета.ТоварнаяКатегория,
		|	втРезультатРасчета.Брендообъем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Показатель) КАК Показатель,
		|	ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Группа
		|ПОМЕСТИТЬ втИсходныеДанные
		|ИЗ
		|	Документ.ПП_ПланПроведенияПромоАкций.ТабличнаяЧасть КАК ПП_ПланПроведенияПромоАкцийТабличнаяЧасть
		|ГДЕ
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.СкидкаПредоставляетсяВСчете
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.ВидПоказателя,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные.Период,
		|	втИсходныеДанные.Дивизион,
		|	втИсходныеДанные.КатегорияКлиента,
		|	втИсходныеДанные.Вывеска,
		|	втИсходныеДанные.Брендообъем,
		|	втИсходныеДанные.ВидПоказателя,
		|	втИсходныеДанные.Показатель,
		|	втИсходныеДанные.Приоритет
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	втИсходныеДанные КАК втИсходныеДанные
		|ГДЕ
		|	НЕ втИсходныеДанные.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИсходныеДанные.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанные.КатегорияКлиента,
		|	втИсходныеДанные.Вывеска,
		|	втИсходныеДанные.Брендообъем,
		|	втИсходныеДанные.ВидПоказателя,
		|	втИсходныеДанные.Показатель,
		|	втИсходныеДанные.Приоритет
		|ИЗ
		|	втИсходныеДанные КАК втИсходныеДанные,
		|	втАПИБрендообъемы КАК втАПИБрендообъемы
		|ГДЕ
		|	втИсходныеДанные.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходныеДанные.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанные.КатегорияКлиента,
		|	втИсходныеДанные.Вывеска,
		|	втИсходныеДанные.Брендообъем,
		|	втИсходныеДанные.ВидПоказателя,
		|	втИсходныеДанные.Показатель,
		|	втИсходныеДанные.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1.Период,
		|	вт1.Дивизион,
		|	вт1.КатегорияКлиента,
		|	вт1.Вывеска,
		|	вт1.Брендообъем,
		|	вт1.ВидПоказателя,
		|	вт1.Показатель,
		|	вт1.Приоритет
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт1 КАК вт1
		|ГДЕ
		|	НЕ вт1.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт1.Период,
		|	вт1.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1.Вывеска,
		|	вт1.Брендообъем,
		|	вт1.ВидПоказателя,
		|	вт1.Показатель,
		|	вт1.Приоритет
		|ИЗ
		|	вт1 КАК вт1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт1.Дивизион = втАПИБрендообъемы.Дивизион
		|ГДЕ
		|	вт1.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1.Период,
		|	вт1.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1.Вывеска,
		|	вт1.Брендообъем,
		|	вт1.ВидПоказателя,
		|	вт1.Показатель,
		|	вт1.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2.Период,
		|	вт2.Дивизион,
		|	вт2.КатегорияКлиента,
		|	вт2.Вывеска,
		|	вт2.Брендообъем,
		|	вт2.ВидПоказателя,
		|	вт2.Показатель,
		|	вт2.Приоритет
		|ПОМЕСТИТЬ вт3
		|ИЗ
		|	вт2 КАК вт2
		|ГДЕ
		|	НЕ вт2.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт2.Период,
		|	вт2.Дивизион,
		|	вт2.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2.Брендообъем,
		|	вт2.ВидПоказателя,
		|	вт2.Показатель,
		|	вт2.Приоритет
		|ИЗ
		|	вт2 КАК вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт2.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт2.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|ГДЕ
		|	вт2.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт2.Период,
		|	вт2.Дивизион,
		|	вт2.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2.Брендообъем,
		|	вт2.ВидПоказателя,
		|	вт2.Показатель,
		|	вт2.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3.Период,
		|	вт3.Дивизион,
		|	вт3.КатегорияКлиента,
		|	вт3.Вывеска,
		|	вт3.Брендообъем,
		|	вт3.ВидПоказателя,
		|	вт3.Показатель,
		|	вт3.Приоритет
		|ПОМЕСТИТЬ вт4
		|ИЗ
		|	вт3 КАК вт3
		|ГДЕ
		|	НЕ вт3.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт3.Период,
		|	вт3.Дивизион,
		|	вт3.КатегорияКлиента,
		|	вт3.Вывеска,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт3.ВидПоказателя,
		|	вт3.Показатель,
		|	вт3.Приоритет
		|ИЗ
		|	вт3 КАК вт3
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт3.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт3.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт3.Вывеска = втАПИБрендообъемы.Вывеска
		|ГДЕ
		|	вт3.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт3.Период,
		|	вт3.Дивизион,
		|	вт3.КатегорияКлиента,
		|	вт3.Вывеска,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт3.ВидПоказателя,
		|	вт3.Показатель,
		|	вт3.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт4.Период КАК Период,
		|	вт4.Дивизион КАК Дивизион,
		|	вт4.КатегорияКлиента КАК КатегорияКлиента,
		|	вт4.Вывеска КАК Вывеска,
		|	вт4.Брендообъем КАК Брендообъем,
		|	вт4.ВидПоказателя,
		|	МАКСИМУМ(вт4.Показатель) КАК Показатель,
		|	вт4.Приоритет
		|ПОМЕСТИТЬ втПланПромоАкций
		|ИЗ
		|	вт4 КАК вт4
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			вт4.Период КАК Период,
		|			вт4.Дивизион КАК Дивизион,
		|			вт4.КатегорияКлиента КАК КатегорияКлиента,
		|			вт4.Вывеска КАК Вывеска,
		|			вт4.Брендообъем КАК Брендообъем,
		|			вт4.ВидПоказателя КАК ВидПоказателя,
		|			МАКСИМУМ(вт4.Приоритет) КАК Приоритет
		|		ИЗ
		|			вт4 КАК вт4
		|		ГДЕ
		|			вт4.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			вт4.Дивизион,
		|			вт4.ВидПоказателя,
		|			вт4.Период,
		|			вт4.КатегорияКлиента,
		|			вт4.Брендообъем,
		|			вт4.Вывеска) КАК ВложенныйЗапрос
		|		ПО вт4.Период = ВложенныйЗапрос.Период
		|			И вт4.Дивизион = ВложенныйЗапрос.Дивизион
		|			И вт4.КатегорияКлиента = ВложенныйЗапрос.КатегорияКлиента
		|			И вт4.Вывеска = ВложенныйЗапрос.Вывеска
		|			И вт4.Брендообъем = ВложенныйЗапрос.Брендообъем
		|			И вт4.ВидПоказателя = ВложенныйЗапрос.ВидПоказателя
		|			И вт4.Приоритет = ВложенныйЗапрос.Приоритет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт4.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт4.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт4.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт4.Брендообъем = втАПИБрендообъемы.Брендообъем
		|
		|СГРУППИРОВАТЬ ПО
		|	вт4.Период,
		|	вт4.Дивизион,
		|	вт4.КатегорияКлиента,
		|	вт4.Вывеска,
		|	вт4.Брендообъем,
		|	вт4.ВидПоказателя,
		|	вт4.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Показатель) КАК Показатель,
		|	ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Группа
		|ПОМЕСТИТЬ втИсходныеДанныеСкидкаПослеСчета
		|ИЗ
		|	Документ.ПП_ПланПроведенияПромоАкций.ТабличнаяЧасть КАК ПП_ПланПроведенияПромоАкцийТабличнаяЧасть
		|ГДЕ
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.СкидкаПредоставляетсяВСчете
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.ВидПоказателя,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Вывеска,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Брендообъем,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Дивизион,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланПроведенияПромоАкцийТабличнаяЧасть.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеСкидкаПослеСчета.Период,
		|	втИсходныеДанныеСкидкаПослеСчета.Дивизион,
		|	втИсходныеДанныеСкидкаПослеСчета.КатегорияКлиента,
		|	втИсходныеДанныеСкидкаПослеСчета.Вывеска,
		|	втИсходныеДанныеСкидкаПослеСчета.Брендообъем,
		|	втИсходныеДанныеСкидкаПослеСчета.ВидПоказателя,
		|	втИсходныеДанныеСкидкаПослеСчета.Показатель,
		|	втИсходныеДанныеСкидкаПослеСчета.Приоритет
		|ПОМЕСТИТЬ вт1СкидкаПослеСчета
		|ИЗ
		|	втИсходныеДанныеСкидкаПослеСчета КАК втИсходныеДанныеСкидкаПослеСчета
		|ГДЕ
		|	НЕ втИсходныеДанныеСкидкаПослеСчета.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИсходныеДанныеСкидкаПослеСчета.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеСкидкаПослеСчета.КатегорияКлиента,
		|	втИсходныеДанныеСкидкаПослеСчета.Вывеска,
		|	втИсходныеДанныеСкидкаПослеСчета.Брендообъем,
		|	втИсходныеДанныеСкидкаПослеСчета.ВидПоказателя,
		|	втИсходныеДанныеСкидкаПослеСчета.Показатель,
		|	втИсходныеДанныеСкидкаПослеСчета.Приоритет
		|ИЗ
		|	втИсходныеДанныеСкидкаПослеСчета КАК втИсходныеДанныеСкидкаПослеСчета,
		|	втАПИБрендообъемы КАК втАПИБрендообъемы
		|ГДЕ
		|	втИсходныеДанныеСкидкаПослеСчета.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходныеДанныеСкидкаПослеСчета.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеСкидкаПослеСчета.КатегорияКлиента,
		|	втИсходныеДанныеСкидкаПослеСчета.Вывеска,
		|	втИсходныеДанныеСкидкаПослеСчета.Брендообъем,
		|	втИсходныеДанныеСкидкаПослеСчета.ВидПоказателя,
		|	втИсходныеДанныеСкидкаПослеСчета.Показатель,
		|	втИсходныеДанныеСкидкаПослеСчета.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1СкидкаПослеСчета.Период,
		|	вт1СкидкаПослеСчета.Дивизион,
		|	вт1СкидкаПослеСчета.КатегорияКлиента,
		|	вт1СкидкаПослеСчета.Вывеска,
		|	вт1СкидкаПослеСчета.Брендообъем,
		|	вт1СкидкаПослеСчета.ВидПоказателя,
		|	вт1СкидкаПослеСчета.Показатель,
		|	вт1СкидкаПослеСчета.Приоритет
		|ПОМЕСТИТЬ вт2СкидкаПослеСчета
		|ИЗ
		|	вт1СкидкаПослеСчета КАК вт1СкидкаПослеСчета
		|ГДЕ
		|	НЕ вт1СкидкаПослеСчета.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт1СкидкаПослеСчета.Период,
		|	вт1СкидкаПослеСчета.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1СкидкаПослеСчета.Вывеска,
		|	вт1СкидкаПослеСчета.Брендообъем,
		|	вт1СкидкаПослеСчета.ВидПоказателя,
		|	вт1СкидкаПослеСчета.Показатель,
		|	вт1СкидкаПослеСчета.Приоритет
		|ИЗ
		|	вт1СкидкаПослеСчета КАК вт1СкидкаПослеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт1СкидкаПослеСчета.Дивизион = втАПИБрендообъемы.Дивизион
		|ГДЕ
		|	вт1СкидкаПослеСчета.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1СкидкаПослеСчета.Период,
		|	вт1СкидкаПослеСчета.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1СкидкаПослеСчета.Вывеска,
		|	вт1СкидкаПослеСчета.Брендообъем,
		|	вт1СкидкаПослеСчета.ВидПоказателя,
		|	вт1СкидкаПослеСчета.Показатель,
		|	вт1СкидкаПослеСчета.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2СкидкаПослеСчета.Период,
		|	вт2СкидкаПослеСчета.Дивизион,
		|	вт2СкидкаПослеСчета.КатегорияКлиента,
		|	вт2СкидкаПослеСчета.Вывеска,
		|	вт2СкидкаПослеСчета.Брендообъем,
		|	вт2СкидкаПослеСчета.ВидПоказателя,
		|	вт2СкидкаПослеСчета.Показатель,
		|	вт2СкидкаПослеСчета.Приоритет
		|ПОМЕСТИТЬ вт3СкидкаПослеСчета
		|ИЗ
		|	вт2СкидкаПослеСчета КАК вт2СкидкаПослеСчета
		|ГДЕ
		|	НЕ вт2СкидкаПослеСчета.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт2СкидкаПослеСчета.Период,
		|	вт2СкидкаПослеСчета.Дивизион,
		|	вт2СкидкаПослеСчета.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2СкидкаПослеСчета.Брендообъем,
		|	вт2СкидкаПослеСчета.ВидПоказателя,
		|	вт2СкидкаПослеСчета.Показатель,
		|	вт2СкидкаПослеСчета.Приоритет
		|ИЗ
		|	вт2СкидкаПослеСчета КАК вт2СкидкаПослеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт2СкидкаПослеСчета.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт2СкидкаПослеСчета.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|ГДЕ
		|	вт2СкидкаПослеСчета.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт2СкидкаПослеСчета.Период,
		|	вт2СкидкаПослеСчета.Дивизион,
		|	вт2СкидкаПослеСчета.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2СкидкаПослеСчета.Брендообъем,
		|	вт2СкидкаПослеСчета.ВидПоказателя,
		|	вт2СкидкаПослеСчета.Показатель,
		|	вт2СкидкаПослеСчета.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3СкидкаПослеСчета.Период,
		|	вт3СкидкаПослеСчета.Дивизион,
		|	вт3СкидкаПослеСчета.КатегорияКлиента,
		|	вт3СкидкаПослеСчета.Вывеска,
		|	вт3СкидкаПослеСчета.Брендообъем,
		|	вт3СкидкаПослеСчета.ВидПоказателя,
		|	вт3СкидкаПослеСчета.Показатель,
		|	вт3СкидкаПослеСчета.Приоритет
		|ПОМЕСТИТЬ вт4СкидкаПослеСчета
		|ИЗ
		|	вт3СкидкаПослеСчета КАК вт3СкидкаПослеСчета
		|ГДЕ
		|	НЕ вт3СкидкаПослеСчета.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт3СкидкаПослеСчета.Период,
		|	вт3СкидкаПослеСчета.Дивизион,
		|	вт3СкидкаПослеСчета.КатегорияКлиента,
		|	вт3СкидкаПослеСчета.Вывеска,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт3СкидкаПослеСчета.ВидПоказателя,
		|	вт3СкидкаПослеСчета.Показатель,
		|	вт3СкидкаПослеСчета.Приоритет
		|ИЗ
		|	вт3СкидкаПослеСчета КАК вт3СкидкаПослеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт3СкидкаПослеСчета.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт3СкидкаПослеСчета.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт3СкидкаПослеСчета.Вывеска = втАПИБрендообъемы.Вывеска
		|ГДЕ
		|	вт3СкидкаПослеСчета.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт3СкидкаПослеСчета.Период,
		|	вт3СкидкаПослеСчета.Дивизион,
		|	вт3СкидкаПослеСчета.КатегорияКлиента,
		|	вт3СкидкаПослеСчета.Вывеска,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт3СкидкаПослеСчета.ВидПоказателя,
		|	вт3СкидкаПослеСчета.Показатель,
		|	вт3СкидкаПослеСчета.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт4СкидкаПослеСчета.Период КАК Период,
		|	вт4СкидкаПослеСчета.Дивизион КАК Дивизион,
		|	вт4СкидкаПослеСчета.КатегорияКлиента КАК КатегорияКлиента,
		|	вт4СкидкаПослеСчета.Вывеска КАК Вывеска,
		|	вт4СкидкаПослеСчета.Брендообъем КАК Брендообъем,
		|	вт4СкидкаПослеСчета.ВидПоказателя,
		|	МАКСИМУМ(вт4СкидкаПослеСчета.Показатель) КАК Показатель,
		|	вт4СкидкаПослеСчета.Приоритет
		|ПОМЕСТИТЬ втПланПромоАкцийСкидкаПослеСчета
		|ИЗ
		|	вт4СкидкаПослеСчета КАК вт4СкидкаПослеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			вт4СкидкаПослеСчета.Период КАК Период,
		|			вт4СкидкаПослеСчета.Дивизион КАК Дивизион,
		|			вт4СкидкаПослеСчета.КатегорияКлиента КАК КатегорияКлиента,
		|			вт4СкидкаПослеСчета.Вывеска КАК Вывеска,
		|			вт4СкидкаПослеСчета.Брендообъем КАК Брендообъем,
		|			вт4СкидкаПослеСчета.ВидПоказателя КАК ВидПоказателя,
		|			МАКСИМУМ(вт4СкидкаПослеСчета.Приоритет) КАК Приоритет
		|		ИЗ
		|			вт4СкидкаПослеСчета КАК вт4СкидкаПослеСчета
		|		ГДЕ
		|			вт4СкидкаПослеСчета.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			вт4СкидкаПослеСчета.Дивизион,
		|			вт4СкидкаПослеСчета.ВидПоказателя,
		|			вт4СкидкаПослеСчета.Период,
		|			вт4СкидкаПослеСчета.КатегорияКлиента,
		|			вт4СкидкаПослеСчета.Брендообъем,
		|			вт4СкидкаПослеСчета.Вывеска) КАК ВложенныйЗапрос
		|		ПО вт4СкидкаПослеСчета.Период = ВложенныйЗапрос.Период
		|			И вт4СкидкаПослеСчета.Дивизион = ВложенныйЗапрос.Дивизион
		|			И вт4СкидкаПослеСчета.КатегорияКлиента = ВложенныйЗапрос.КатегорияКлиента
		|			И вт4СкидкаПослеСчета.Вывеска = ВложенныйЗапрос.Вывеска
		|			И вт4СкидкаПослеСчета.Брендообъем = ВложенныйЗапрос.Брендообъем
		|			И вт4СкидкаПослеСчета.ВидПоказателя = ВложенныйЗапрос.ВидПоказателя
		|			И вт4СкидкаПослеСчета.Приоритет = ВложенныйЗапрос.Приоритет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт4СкидкаПослеСчета.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт4СкидкаПослеСчета.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт4СкидкаПослеСчета.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт4СкидкаПослеСчета.Брендообъем = втАПИБрендообъемы.Брендообъем
		|
		|СГРУППИРОВАТЬ ПО
		|	вт4СкидкаПослеСчета.Период,
		|	вт4СкидкаПослеСчета.Дивизион,
		|	вт4СкидкаПослеСчета.КатегорияКлиента,
		|	вт4СкидкаПослеСчета.Вывеска,
		|	вт4СкидкаПослеСчета.Брендообъем,
		|	вт4СкидкаПослеСчета.ВидПоказателя,
		|	вт4СкидкаПослеСчета.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП_ПланРетробонусовТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Дивизион,
		|	ПП_ПланРетробонусовТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Вывеска,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Проект,
		|	ПП_ПланРетробонусовТабличнаяЧасть.ТоварнаяКатегория,
		|	ПП_ПланРетробонусовТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ПП_ПланРетробонусовТабличнаяЧасть.Показатель) КАК Показатель,
		|	ВЫБОР
		|		КОГДА ПП_ПланРетробонусовТабличнаяЧасть.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланРетробонусовТабличнаяЧасть.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланРетробонусовТабличнаяЧасть.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланРетробонусовТабличнаяЧасть.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланРетробонусовТабличнаяЧасть.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Группа
		|ПОМЕСТИТЬ втИсходныеДанныеРетробонусы
		|ИЗ
		|	Документ.ПП_ПланРетробонусов.ТабличнаяЧасть КАК ПП_ПланРетробонусовТабличнаяЧасть
		|ГДЕ
		|	ПП_ПланРетробонусовТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ПланРетробонусовТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ПланРетробонусовТабличнаяЧасть.ВидПоказателя,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Вывеска,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Дивизион,
		|	ПП_ПланРетробонусовТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Проект,
		|	ПП_ПланРетробонусовТабличнаяЧасть.ТоварнаяКатегория,
		|	ПП_ПланРетробонусовТабличнаяЧасть.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеРетробонусы.Период,
		|	втИсходныеДанныеРетробонусы.Дивизион,
		|	втИсходныеДанныеРетробонусы.КатегорияКлиента,
		|	втИсходныеДанныеРетробонусы.Вывеска,
		|	втИсходныеДанныеРетробонусы.Проект,
		|	втИсходныеДанныеРетробонусы.ТоварнаяКатегория,
		|	втИсходныеДанныеРетробонусы.ВидПоказателя,
		|	втИсходныеДанныеРетробонусы.Показатель,
		|	втИсходныеДанныеРетробонусы.Приоритет
		|ПОМЕСТИТЬ вт1Ретробонусы
		|ИЗ
		|	втИсходныеДанныеРетробонусы КАК втИсходныеДанныеРетробонусы
		|ГДЕ
		|	НЕ втИсходныеДанныеРетробонусы.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИсходныеДанныеРетробонусы.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеРетробонусы.КатегорияКлиента,
		|	втИсходныеДанныеРетробонусы.Вывеска,
		|	втИсходныеДанныеРетробонусы.Проект,
		|	втИсходныеДанныеРетробонусы.ТоварнаяКатегория,
		|	втИсходныеДанныеРетробонусы.ВидПоказателя,
		|	втИсходныеДанныеРетробонусы.Показатель,
		|	втИсходныеДанныеРетробонусы.Приоритет
		|ИЗ
		|	втИсходныеДанныеРетробонусы КАК втИсходныеДанныеРетробонусы,
		|	втАПИБрендообъемы КАК втАПИБрендообъемы
		|ГДЕ
		|	втИсходныеДанныеРетробонусы.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходныеДанныеРетробонусы.Вывеска,
		|	втИсходныеДанныеРетробонусы.КатегорияКлиента,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеРетробонусы.Период,
		|	втИсходныеДанныеРетробонусы.ВидПоказателя,
		|	втИсходныеДанныеРетробонусы.ТоварнаяКатегория,
		|	втИсходныеДанныеРетробонусы.Проект,
		|	втИсходныеДанныеРетробонусы.Показатель,
		|	втИсходныеДанныеРетробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1Ретробонусы.Период,
		|	вт1Ретробонусы.Дивизион,
		|	вт1Ретробонусы.КатегорияКлиента,
		|	вт1Ретробонусы.Вывеска,
		|	вт1Ретробонусы.Проект,
		|	вт1Ретробонусы.ТоварнаяКатегория,
		|	вт1Ретробонусы.ВидПоказателя,
		|	вт1Ретробонусы.Показатель,
		|	вт1Ретробонусы.Приоритет
		|ПОМЕСТИТЬ вт2Ретробонусы
		|ИЗ
		|	вт1Ретробонусы КАК вт1Ретробонусы
		|ГДЕ
		|	НЕ вт1Ретробонусы.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт1Ретробонусы.Период,
		|	вт1Ретробонусы.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1Ретробонусы.Вывеска,
		|	вт1Ретробонусы.Проект,
		|	вт1Ретробонусы.ТоварнаяКатегория,
		|	вт1Ретробонусы.ВидПоказателя,
		|	вт1Ретробонусы.Показатель,
		|	вт1Ретробонусы.Приоритет
		|ИЗ
		|	вт1Ретробонусы КАК вт1Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт1Ретробонусы.Дивизион = втАПИБрендообъемы.Дивизион
		|ГДЕ
		|	вт1Ретробонусы.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1Ретробонусы.ВидПоказателя,
		|	вт1Ретробонусы.ТоварнаяКатегория,
		|	вт1Ретробонусы.Проект,
		|	вт1Ретробонусы.Вывеска,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1Ретробонусы.Дивизион,
		|	вт1Ретробонусы.Период,
		|	вт1Ретробонусы.Показатель,
		|	вт1Ретробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2Ретробонусы.Период,
		|	вт2Ретробонусы.Дивизион,
		|	вт2Ретробонусы.КатегорияКлиента,
		|	вт2Ретробонусы.Вывеска,
		|	вт2Ретробонусы.Проект,
		|	вт2Ретробонусы.ТоварнаяКатегория,
		|	вт2Ретробонусы.ВидПоказателя,
		|	вт2Ретробонусы.Показатель,
		|	вт2Ретробонусы.Приоритет
		|ПОМЕСТИТЬ вт3Ретробонусы
		|ИЗ
		|	вт2Ретробонусы КАК вт2Ретробонусы
		|ГДЕ
		|	НЕ вт2Ретробонусы.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт2Ретробонусы.Период,
		|	вт2Ретробонусы.Дивизион,
		|	вт2Ретробонусы.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2Ретробонусы.Проект,
		|	вт2Ретробонусы.ТоварнаяКатегория,
		|	вт2Ретробонусы.ВидПоказателя,
		|	вт2Ретробонусы.Показатель,
		|	вт2Ретробонусы.Приоритет
		|ИЗ
		|	вт2Ретробонусы КАК вт2Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт2Ретробонусы.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт2Ретробонусы.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|ГДЕ
		|	вт2Ретробонусы.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт2Ретробонусы.Период,
		|	вт2Ретробонусы.Дивизион,
		|	вт2Ретробонусы.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2Ретробонусы.Проект,
		|	вт2Ретробонусы.ТоварнаяКатегория,
		|	вт2Ретробонусы.ВидПоказателя,
		|	вт2Ретробонусы.Показатель,
		|	вт2Ретробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3Ретробонусы.Период,
		|	вт3Ретробонусы.Дивизион,
		|	вт3Ретробонусы.КатегорияКлиента,
		|	вт3Ретробонусы.Вывеска,
		|	вт3Ретробонусы.Проект,
		|	вт3Ретробонусы.ТоварнаяКатегория,
		|	вт3Ретробонусы.ВидПоказателя,
		|	вт3Ретробонусы.Показатель,
		|	вт3Ретробонусы.Приоритет
		|ПОМЕСТИТЬ вт4Ретробонусы
		|ИЗ
		|	вт3Ретробонусы КАК вт3Ретробонусы
		|ГДЕ
		|	НЕ вт3Ретробонусы.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт3Ретробонусы.Период,
		|	вт3Ретробонусы.Дивизион,
		|	вт3Ретробонусы.КатегорияКлиента,
		|	вт3Ретробонусы.Вывеска,
		|	втАПИБрендообъемы.Проект,
		|	вт3Ретробонусы.ТоварнаяКатегория,
		|	вт3Ретробонусы.ВидПоказателя,
		|	вт3Ретробонусы.Показатель,
		|	вт3Ретробонусы.Приоритет
		|ИЗ
		|	вт3Ретробонусы КАК вт3Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт3Ретробонусы.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт3Ретробонусы.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт3Ретробонусы.Вывеска = втАПИБрендообъемы.Вывеска
		|ГДЕ
		|	вт3Ретробонусы.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт3Ретробонусы.Период,
		|	вт3Ретробонусы.Дивизион,
		|	вт3Ретробонусы.КатегорияКлиента,
		|	вт3Ретробонусы.Вывеска,
		|	втАПИБрендообъемы.Проект,
		|	вт3Ретробонусы.ТоварнаяКатегория,
		|	вт3Ретробонусы.ВидПоказателя,
		|	вт3Ретробонусы.Показатель,
		|	вт3Ретробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт4Ретробонусы.Период,
		|	вт4Ретробонусы.Дивизион,
		|	вт4Ретробонусы.КатегорияКлиента,
		|	вт4Ретробонусы.Вывеска,
		|	вт4Ретробонусы.Проект,
		|	вт4Ретробонусы.ТоварнаяКатегория,
		|	вт4Ретробонусы.ВидПоказателя,
		|	вт4Ретробонусы.Показатель,
		|	вт4Ретробонусы.Приоритет
		|ПОМЕСТИТЬ вт5Ретробонусы
		|ИЗ
		|	вт4Ретробонусы КАК вт4Ретробонусы
		|ГДЕ
		|	НЕ вт4Ретробонусы.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт4Ретробонусы.Период,
		|	вт4Ретробонусы.Дивизион,
		|	вт4Ретробонусы.КатегорияКлиента,
		|	вт4Ретробонусы.Вывеска,
		|	вт4Ретробонусы.Проект,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт4Ретробонусы.ВидПоказателя,
		|	вт4Ретробонусы.Показатель,
		|	вт4Ретробонусы.Приоритет
		|ИЗ
		|	вт4Ретробонусы КАК вт4Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт4Ретробонусы.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт4Ретробонусы.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт4Ретробонусы.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт4Ретробонусы.Проект = втАПИБрендообъемы.Проект
		|ГДЕ
		|	вт4Ретробонусы.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт4Ретробонусы.Период,
		|	вт4Ретробонусы.КатегорияКлиента,
		|	вт4Ретробонусы.Дивизион,
		|	вт4Ретробонусы.Проект,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт4Ретробонусы.ВидПоказателя,
		|	вт4Ретробонусы.Вывеска,
		|	вт4Ретробонусы.Показатель,
		|	вт4Ретробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт5Ретробонусы.Период,
		|	вт5Ретробонусы.Дивизион,
		|	вт5Ретробонусы.КатегорияКлиента,
		|	вт5Ретробонусы.Вывеска,
		|	вт5Ретробонусы.Проект,
		|	вт5Ретробонусы.ТоварнаяКатегория,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт5Ретробонусы.ВидПоказателя,
		|	вт5Ретробонусы.Показатель,
		|	вт5Ретробонусы.Приоритет
		|ПОМЕСТИТЬ вт6Ретробонусы
		|ИЗ
		|	вт5Ретробонусы КАК вт5Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт5Ретробонусы.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт5Ретробонусы.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт5Ретробонусы.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт5Ретробонусы.Проект = втАПИБрендообъемы.Проект
		|			И вт5Ретробонусы.ТоварнаяКатегория = втАПИБрендообъемы.ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт6Ретробонусы.Период,
		|	вт6Ретробонусы.Дивизион,
		|	вт6Ретробонусы.КатегорияКлиента,
		|	вт6Ретробонусы.Вывеска,
		|	вт6Ретробонусы.Проект,
		|	вт6Ретробонусы.ТоварнаяКатегория,
		|	вт6Ретробонусы.Брендообъем,
		|	вт6Ретробонусы.ВидПоказателя,
		|	МАКСИМУМ(вт6Ретробонусы.Показатель) КАК Показатель,
		|	вт6Ретробонусы.Приоритет
		|ПОМЕСТИТЬ втПланРетроБонусов
		|ИЗ
		|	вт6Ретробонусы КАК вт6Ретробонусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			вт6Ретробонусы.Период КАК Период,
		|			вт6Ретробонусы.Дивизион КАК Дивизион,
		|			вт6Ретробонусы.КатегорияКлиента КАК КатегорияКлиента,
		|			вт6Ретробонусы.Вывеска КАК Вывеска,
		|			вт6Ретробонусы.Проект КАК Проект,
		|			вт6Ретробонусы.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|			вт6Ретробонусы.Брендообъем КАК Брендообъем,
		|			вт6Ретробонусы.ВидПоказателя КАК ВидПоказателя,
		|			МАКСИМУМ(вт6Ретробонусы.Приоритет) КАК Приоритет
		|		ИЗ
		|			вт6Ретробонусы КАК вт6Ретробонусы
		|		ГДЕ
		|			вт6Ретробонусы.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			вт6Ретробонусы.ВидПоказателя,
		|			вт6Ретробонусы.ТоварнаяКатегория,
		|			вт6Ретробонусы.Проект,
		|			вт6Ретробонусы.Вывеска,
		|			вт6Ретробонусы.КатегорияКлиента,
		|			вт6Ретробонусы.Дивизион,
		|			вт6Ретробонусы.Период,
		|			вт6Ретробонусы.Брендообъем) КАК ВложенныйЗапрос
		|		ПО вт6Ретробонусы.Период = ВложенныйЗапрос.Период
		|			И вт6Ретробонусы.Дивизион = ВложенныйЗапрос.Дивизион
		|			И вт6Ретробонусы.КатегорияКлиента = ВложенныйЗапрос.КатегорияКлиента
		|			И вт6Ретробонусы.Вывеска = ВложенныйЗапрос.Вывеска
		|			И вт6Ретробонусы.Проект = ВложенныйЗапрос.Проект
		|			И вт6Ретробонусы.ТоварнаяКатегория = ВложенныйЗапрос.ТоварнаяКатегория
		|			И вт6Ретробонусы.ВидПоказателя = ВложенныйЗапрос.ВидПоказателя
		|			И вт6Ретробонусы.Приоритет = ВложенныйЗапрос.Приоритет
		|			И вт6Ретробонусы.Брендообъем = ВложенныйЗапрос.Брендообъем
		|ГДЕ
		|	вт6Ретробонусы.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт6Ретробонусы.Период,
		|	вт6Ретробонусы.Дивизион,
		|	вт6Ретробонусы.КатегорияКлиента,
		|	вт6Ретробонусы.Вывеска,
		|	вт6Ретробонусы.Проект,
		|	вт6Ретробонусы.ТоварнаяКатегория,
		|	вт6Ретробонусы.Брендообъем,
		|	вт6Ретробонусы.ВидПоказателя,
		|	вт6Ретробонусы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Дивизион,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Вывеска,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Проект,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.ТоварнаяКатегория,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Показатель) КАК Показатель,
		|	ВЫБОР
		|		КОГДА ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланМаркетинговыхУслугТабличнаяЧасть.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПП_ПланМаркетинговыхУслугТабличнаяЧасть.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Группа
		|ПОМЕСТИТЬ втИсходныеДанныеМаркетинговыхУслуг
		|ИЗ
		|	Документ.ПП_ПланМаркетинговыхУслуг.ТабличнаяЧасть КАК ПП_ПланМаркетинговыхУслугТабличнаяЧасть
		|ГДЕ
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.ВидПоказателя,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Вывеска,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Дивизион,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Проект,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.ТоварнаяКатегория,
		|	ПП_ПланМаркетинговыхУслугТабличнаяЧасть.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеМаркетинговыхУслуг.Период,
		|	втИсходныеДанныеМаркетинговыхУслуг.Дивизион,
		|	втИсходныеДанныеМаркетинговыхУслуг.КатегорияКлиента,
		|	втИсходныеДанныеМаркетинговыхУслуг.Вывеска,
		|	втИсходныеДанныеМаркетинговыхУслуг.Проект,
		|	втИсходныеДанныеМаркетинговыхУслуг.ТоварнаяКатегория,
		|	втИсходныеДанныеМаркетинговыхУслуг.ВидПоказателя,
		|	втИсходныеДанныеМаркетинговыхУслуг.Показатель,
		|	втИсходныеДанныеМаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт1МаркетинговыхУслуг
		|ИЗ
		|	втИсходныеДанныеМаркетинговыхУслуг КАК втИсходныеДанныеМаркетинговыхУслуг
		|ГДЕ
		|	НЕ втИсходныеДанныеМаркетинговыхУслуг.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИсходныеДанныеМаркетинговыхУслуг.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеМаркетинговыхУслуг.КатегорияКлиента,
		|	втИсходныеДанныеМаркетинговыхУслуг.Вывеска,
		|	втИсходныеДанныеМаркетинговыхУслуг.Проект,
		|	втИсходныеДанныеМаркетинговыхУслуг.ТоварнаяКатегория,
		|	втИсходныеДанныеМаркетинговыхУслуг.ВидПоказателя,
		|	втИсходныеДанныеМаркетинговыхУслуг.Показатель,
		|	втИсходныеДанныеМаркетинговыхУслуг.Приоритет
		|ИЗ
		|	втИсходныеДанныеМаркетинговыхУслуг КАК втИсходныеДанныеМаркетинговыхУслуг,
		|	втАПИБрендообъемы КАК втАПИБрендообъемы
		|ГДЕ
		|	втИсходныеДанныеМаркетинговыхУслуг.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходныеДанныеМаркетинговыхУслуг.Вывеска,
		|	втИсходныеДанныеМаркетинговыхУслуг.КатегорияКлиента,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанныеМаркетинговыхУслуг.Период,
		|	втИсходныеДанныеМаркетинговыхУслуг.ВидПоказателя,
		|	втИсходныеДанныеМаркетинговыхУслуг.ТоварнаяКатегория,
		|	втИсходныеДанныеМаркетинговыхУслуг.Проект,
		|	втИсходныеДанныеМаркетинговыхУслуг.Показатель,
		|	втИсходныеДанныеМаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1МаркетинговыхУслуг.Период,
		|	вт1МаркетинговыхУслуг.Дивизион,
		|	вт1МаркетинговыхУслуг.КатегорияКлиента,
		|	вт1МаркетинговыхУслуг.Вывеска,
		|	вт1МаркетинговыхУслуг.Проект,
		|	вт1МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт1МаркетинговыхУслуг.ВидПоказателя,
		|	вт1МаркетинговыхУслуг.Показатель,
		|	вт1МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт2МаркетинговыхУслуг
		|ИЗ
		|	вт1МаркетинговыхУслуг КАК вт1МаркетинговыхУслуг
		|ГДЕ
		|	НЕ вт1МаркетинговыхУслуг.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт1МаркетинговыхУслуг.Период,
		|	вт1МаркетинговыхУслуг.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1МаркетинговыхУслуг.Вывеска,
		|	вт1МаркетинговыхУслуг.Проект,
		|	вт1МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт1МаркетинговыхУслуг.ВидПоказателя,
		|	вт1МаркетинговыхУслуг.Показатель,
		|	вт1МаркетинговыхУслуг.Приоритет
		|ИЗ
		|	вт1МаркетинговыхУслуг КАК вт1МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт1МаркетинговыхУслуг.Дивизион = втАПИБрендообъемы.Дивизион
		|ГДЕ
		|	вт1МаркетинговыхУслуг.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1МаркетинговыхУслуг.ВидПоказателя,
		|	вт1МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт1МаркетинговыхУслуг.Проект,
		|	вт1МаркетинговыхУслуг.Вывеска,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт1МаркетинговыхУслуг.Дивизион,
		|	вт1МаркетинговыхУслуг.Период,
		|	вт1МаркетинговыхУслуг.Показатель,
		|	вт1МаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2МаркетинговыхУслуг.Период,
		|	вт2МаркетинговыхУслуг.Дивизион,
		|	вт2МаркетинговыхУслуг.КатегорияКлиента,
		|	вт2МаркетинговыхУслуг.Вывеска,
		|	вт2МаркетинговыхУслуг.Проект,
		|	вт2МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт2МаркетинговыхУслуг.ВидПоказателя,
		|	вт2МаркетинговыхУслуг.Показатель,
		|	вт2МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт3МаркетинговыхУслуг
		|ИЗ
		|	вт2МаркетинговыхУслуг КАК вт2МаркетинговыхУслуг
		|ГДЕ
		|	НЕ вт2МаркетинговыхУслуг.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт2МаркетинговыхУслуг.Период,
		|	вт2МаркетинговыхУслуг.Дивизион,
		|	вт2МаркетинговыхУслуг.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2МаркетинговыхУслуг.Проект,
		|	вт2МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт2МаркетинговыхУслуг.ВидПоказателя,
		|	вт2МаркетинговыхУслуг.Показатель,
		|	вт2МаркетинговыхУслуг.Приоритет
		|ИЗ
		|	вт2МаркетинговыхУслуг КАК вт2МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт2МаркетинговыхУслуг.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт2МаркетинговыхУслуг.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|ГДЕ
		|	вт2МаркетинговыхУслуг.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт2МаркетинговыхУслуг.Период,
		|	вт2МаркетинговыхУслуг.Дивизион,
		|	вт2МаркетинговыхУслуг.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт2МаркетинговыхУслуг.Проект,
		|	вт2МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт2МаркетинговыхУслуг.ВидПоказателя,
		|	вт2МаркетинговыхУслуг.Показатель,
		|	вт2МаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3МаркетинговыхУслуг.Период,
		|	вт3МаркетинговыхУслуг.Дивизион,
		|	вт3МаркетинговыхУслуг.КатегорияКлиента,
		|	вт3МаркетинговыхУслуг.Вывеска,
		|	вт3МаркетинговыхУслуг.Проект,
		|	вт3МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт3МаркетинговыхУслуг.ВидПоказателя,
		|	вт3МаркетинговыхУслуг.Показатель,
		|	вт3МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт4МаркетинговыхУслуг
		|ИЗ
		|	вт3МаркетинговыхУслуг КАК вт3МаркетинговыхУслуг
		|ГДЕ
		|	НЕ вт3МаркетинговыхУслуг.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт3МаркетинговыхУслуг.Период,
		|	вт3МаркетинговыхУслуг.Дивизион,
		|	вт3МаркетинговыхУслуг.КатегорияКлиента,
		|	вт3МаркетинговыхУслуг.Вывеска,
		|	втАПИБрендообъемы.Проект,
		|	вт3МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт3МаркетинговыхУслуг.ВидПоказателя,
		|	вт3МаркетинговыхУслуг.Показатель,
		|	вт3МаркетинговыхУслуг.Приоритет
		|ИЗ
		|	вт3МаркетинговыхУслуг КАК вт3МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт3МаркетинговыхУслуг.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт3МаркетинговыхУслуг.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт3МаркетинговыхУслуг.Вывеска = втАПИБрендообъемы.Вывеска
		|ГДЕ
		|	вт3МаркетинговыхУслуг.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт3МаркетинговыхУслуг.Период,
		|	вт3МаркетинговыхУслуг.Дивизион,
		|	вт3МаркетинговыхУслуг.КатегорияКлиента,
		|	вт3МаркетинговыхУслуг.Вывеска,
		|	втАПИБрендообъемы.Проект,
		|	вт3МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт3МаркетинговыхУслуг.ВидПоказателя,
		|	вт3МаркетинговыхУслуг.Показатель,
		|	вт3МаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт4МаркетинговыхУслуг.Период,
		|	вт4МаркетинговыхУслуг.Дивизион,
		|	вт4МаркетинговыхУслуг.КатегорияКлиента,
		|	вт4МаркетинговыхУслуг.Вывеска,
		|	вт4МаркетинговыхУслуг.Проект,
		|	вт4МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт4МаркетинговыхУслуг.ВидПоказателя,
		|	вт4МаркетинговыхУслуг.Показатель,
		|	вт4МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт5МаркетинговыхУслуг
		|ИЗ
		|	вт4МаркетинговыхУслуг КАК вт4МаркетинговыхУслуг
		|ГДЕ
		|	НЕ вт4МаркетинговыхУслуг.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт4МаркетинговыхУслуг.Период,
		|	вт4МаркетинговыхУслуг.Дивизион,
		|	вт4МаркетинговыхУслуг.КатегорияКлиента,
		|	вт4МаркетинговыхУслуг.Вывеска,
		|	вт4МаркетинговыхУслуг.Проект,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт4МаркетинговыхУслуг.ВидПоказателя,
		|	вт4МаркетинговыхУслуг.Показатель,
		|	вт4МаркетинговыхУслуг.Приоритет
		|ИЗ
		|	вт4МаркетинговыхУслуг КАК вт4МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт4МаркетинговыхУслуг.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт4МаркетинговыхУслуг.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт4МаркетинговыхУслуг.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт4МаркетинговыхУслуг.Проект = втАПИБрендообъемы.Проект
		|ГДЕ
		|	вт4МаркетинговыхУслуг.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт4МаркетинговыхУслуг.Период,
		|	вт4МаркетинговыхУслуг.КатегорияКлиента,
		|	вт4МаркетинговыхУслуг.Дивизион,
		|	вт4МаркетинговыхУслуг.Проект,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт4МаркетинговыхУслуг.ВидПоказателя,
		|	вт4МаркетинговыхУслуг.Вывеска,
		|	вт4МаркетинговыхУслуг.Показатель,
		|	вт4МаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт5МаркетинговыхУслуг.Период,
		|	вт5МаркетинговыхУслуг.Дивизион,
		|	вт5МаркетинговыхУслуг.КатегорияКлиента,
		|	вт5МаркетинговыхУслуг.Вывеска,
		|	вт5МаркетинговыхУслуг.Проект,
		|	вт5МаркетинговыхУслуг.ТоварнаяКатегория,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт5МаркетинговыхУслуг.ВидПоказателя,
		|	вт5МаркетинговыхУслуг.Показатель,
		|	вт5МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ вт6МаркетинговыхУслуг
		|ИЗ
		|	вт5МаркетинговыхУслуг КАК вт5МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт5МаркетинговыхУслуг.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт5МаркетинговыхУслуг.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт5МаркетинговыхУслуг.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт5МаркетинговыхУслуг.Проект = втАПИБрендообъемы.Проект
		|			И вт5МаркетинговыхУслуг.ТоварнаяКатегория = втАПИБрендообъемы.ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт6МаркетинговыхУслуг.Период,
		|	вт6МаркетинговыхУслуг.Дивизион,
		|	вт6МаркетинговыхУслуг.КатегорияКлиента,
		|	вт6МаркетинговыхУслуг.Вывеска,
		|	вт6МаркетинговыхУслуг.Проект,
		|	вт6МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт6МаркетинговыхУслуг.Брендообъем,
		|	вт6МаркетинговыхУслуг.ВидПоказателя,
		|	МАКСИМУМ(вт6МаркетинговыхУслуг.Показатель) КАК Показатель,
		|	вт6МаркетинговыхУслуг.Приоритет
		|ПОМЕСТИТЬ втПланМаркетинговыхУслуг
		|ИЗ
		|	вт6МаркетинговыхУслуг КАК вт6МаркетинговыхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			вт6МаркетинговыхУслуг.Период КАК Период,
		|			вт6МаркетинговыхУслуг.Дивизион КАК Дивизион,
		|			вт6МаркетинговыхУслуг.КатегорияКлиента КАК КатегорияКлиента,
		|			вт6МаркетинговыхУслуг.Вывеска КАК Вывеска,
		|			вт6МаркетинговыхУслуг.Проект КАК Проект,
		|			вт6МаркетинговыхУслуг.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|			вт6МаркетинговыхУслуг.Брендообъем КАК Брендообъем,
		|			вт6МаркетинговыхУслуг.ВидПоказателя КАК ВидПоказателя,
		|			МАКСИМУМ(вт6МаркетинговыхУслуг.Приоритет) КАК Приоритет
		|		ИЗ
		|			вт6МаркетинговыхУслуг КАК вт6МаркетинговыхУслуг
		|		ГДЕ
		|			вт6МаркетинговыхУслуг.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			вт6МаркетинговыхУслуг.ВидПоказателя,
		|			вт6МаркетинговыхУслуг.ТоварнаяКатегория,
		|			вт6МаркетинговыхУслуг.Проект,
		|			вт6МаркетинговыхУслуг.Вывеска,
		|			вт6МаркетинговыхУслуг.КатегорияКлиента,
		|			вт6МаркетинговыхУслуг.Дивизион,
		|			вт6МаркетинговыхУслуг.Период,
		|			вт6МаркетинговыхУслуг.Брендообъем) КАК ВложенныйЗапрос
		|		ПО вт6МаркетинговыхУслуг.Период = ВложенныйЗапрос.Период
		|			И вт6МаркетинговыхУслуг.Дивизион = ВложенныйЗапрос.Дивизион
		|			И вт6МаркетинговыхУслуг.КатегорияКлиента = ВложенныйЗапрос.КатегорияКлиента
		|			И вт6МаркетинговыхУслуг.Вывеска = ВложенныйЗапрос.Вывеска
		|			И вт6МаркетинговыхУслуг.Проект = ВложенныйЗапрос.Проект
		|			И вт6МаркетинговыхУслуг.ТоварнаяКатегория = ВложенныйЗапрос.ТоварнаяКатегория
		|			И вт6МаркетинговыхУслуг.ВидПоказателя = ВложенныйЗапрос.ВидПоказателя
		|			И вт6МаркетинговыхУслуг.Приоритет = ВложенныйЗапрос.Приоритет
		|			И вт6МаркетинговыхУслуг.Брендообъем = ВложенныйЗапрос.Брендообъем
		|
		|СГРУППИРОВАТЬ ПО
		|	вт6МаркетинговыхУслуг.Период,
		|	вт6МаркетинговыхУслуг.Дивизион,
		|	вт6МаркетинговыхУслуг.КатегорияКлиента,
		|	вт6МаркетинговыхУслуг.Вывеска,
		|	вт6МаркетинговыхУслуг.Проект,
		|	вт6МаркетинговыхУслуг.ТоварнаяКатегория,
		|	вт6МаркетинговыхУслуг.Брендообъем,
		|	вт6МаркетинговыхУслуг.ВидПоказателя,
		|	вт6МаркетинговыхУслуг.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Ссылка.Период,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Дивизион,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.КатегорияКлиента,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Вывеска,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.АдресПоставки,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Проект,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ТоварнаяКатегория,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Брендообъем,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Показатель) КАК Показатель,
		|	ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Группа,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ втИсходныеДанные_ПланДополнительногоИзмененияЦены
		|ИЗ
		|	Документ.ППП_ПланДополнительногоИзмененияЦеныПродажи.ТабличнаяЧасть КАК ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть
		|ГДЕ
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Ссылка.Проведен
		|	И ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ВидПоказателя,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Вывеска,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Брендообъем,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Ссылка.Период,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Дивизион,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.КатегорияКлиента,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Группа,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.АдресПоставки,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.Проект,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ТоварнаяКатегория,
		|	ППП_ПланДополнительногоИзмененияЦеныПродажиТабличнаяЧасть.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Период,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Дивизион,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.КатегорияКлиента,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Вывеска,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.АдресПоставки,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Проект,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ТоварнаяКатегория,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Брендообъем,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидПоказателя,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Показатель,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Приоритет,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Группа,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт41
		|ИЗ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены КАК втИсходныеДанные_ПланДополнительногоИзмененияЦены
		|ГДЕ
		|	НЕ втИсходныеДанные_ПланДополнительногоИзмененияЦены.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Период,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.КатегорияКлиента,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Вывеска,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.АдресПоставки,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Проект,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ТоварнаяКатегория,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Брендообъем,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидПоказателя,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Показатель,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Приоритет,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Группа,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидДополнительнойСкидки
		|ИЗ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены КАК втИсходныеДанные_ПланДополнительногоИзмененияЦены,
		|	втАПИБрендообъемы КАК втАПИБрендообъемы
		|ГДЕ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидПоказателя,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Период,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Брендообъем,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ТоварнаяКатегория,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Проект,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.АдресПоставки,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Вывеска,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.КатегорияКлиента,
		|	втАПИБрендообъемы.Дивизион,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Показатель,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Приоритет,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Группа,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт41.Период,
		|	вт41.Дивизион,
		|	вт41.КатегорияКлиента,
		|	вт41.Вывеска,
		|	вт41.АдресПоставки,
		|	вт41.Проект,
		|	вт41.ТоварнаяКатегория,
		|	вт41.Брендообъем,
		|	вт41.ВидПоказателя,
		|	вт41.Показатель,
		|	вт41.Приоритет,
		|	вт41.Группа,
		|	вт41.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт42
		|ИЗ
		|	вт41 КАК вт41
		|ГДЕ
		|	НЕ вт41.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт41.Период,
		|	вт41.Дивизион,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт41.Вывеска,
		|	вт41.АдресПоставки,
		|	вт41.Проект,
		|	вт41.ТоварнаяКатегория,
		|	вт41.Брендообъем,
		|	вт41.ВидПоказателя,
		|	вт41.Показатель,
		|	вт41.Приоритет,
		|	вт41.Группа,
		|	вт41.ВидДополнительнойСкидки
		|ИЗ
		|	вт41 КАК вт41
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт41.Дивизион = втАПИБрендообъемы.Дивизион
		|ГДЕ
		|	вт41.КатегорияКлиента = ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт41.Период,
		|	вт41.Вывеска,
		|	вт41.АдресПоставки,
		|	вт41.Проект,
		|	вт41.ТоварнаяКатегория,
		|	вт41.Брендообъем,
		|	вт41.ВидПоказателя,
		|	вт41.Показатель,
		|	вт41.Приоритет,
		|	вт41.Группа,
		|	втАПИБрендообъемы.КатегорияКлиента,
		|	вт41.Дивизион,
		|	вт41.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт42.Период,
		|	вт42.Дивизион,
		|	вт42.КатегорияКлиента,
		|	вт42.Вывеска,
		|	вт42.АдресПоставки,
		|	вт42.Проект,
		|	вт42.ТоварнаяКатегория,
		|	вт42.Брендообъем,
		|	вт42.ВидПоказателя,
		|	вт42.Показатель,
		|	вт42.Приоритет,
		|	вт42.Группа,
		|	вт42.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт43
		|ИЗ
		|	вт42 КАК вт42
		|ГДЕ
		|	НЕ вт42.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт42.Период,
		|	вт42.Дивизион,
		|	вт42.КатегорияКлиента,
		|	втАПИБрендообъемы.Вывеска,
		|	вт42.АдресПоставки,
		|	вт42.Проект,
		|	вт42.ТоварнаяКатегория,
		|	вт42.Брендообъем,
		|	вт42.ВидПоказателя,
		|	вт42.Показатель,
		|	вт42.Приоритет,
		|	вт42.Группа,
		|	вт42.ВидДополнительнойСкидки
		|ИЗ
		|	вт42 КАК вт42
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт42.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт42.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|ГДЕ
		|	вт42.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт42.Период,
		|	вт42.Дивизион,
		|	вт42.КатегорияКлиента,
		|	вт42.АдресПоставки,
		|	вт42.Проект,
		|	вт42.ТоварнаяКатегория,
		|	вт42.Брендообъем,
		|	вт42.ВидПоказателя,
		|	вт42.Показатель,
		|	вт42.Приоритет,
		|	вт42.Группа,
		|	втАПИБрендообъемы.Вывеска,
		|	вт42.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт43.Период,
		|	вт43.Дивизион,
		|	вт43.КатегорияКлиента,
		|	вт43.Вывеска,
		|	вт43.АдресПоставки,
		|	вт43.Проект,
		|	вт43.ТоварнаяКатегория,
		|	вт43.Брендообъем,
		|	вт43.ВидПоказателя,
		|	вт43.Показатель,
		|	вт43.Приоритет,
		|	вт43.Группа,
		|	вт43.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт44
		|ИЗ
		|	вт43 КАК вт43
		|ГДЕ
		|	НЕ вт43.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт43.Период,
		|	вт43.Дивизион,
		|	вт43.КатегорияКлиента,
		|	вт43.Вывеска,
		|	втАПИБрендообъемы.АдресПоставки,
		|	вт43.Проект,
		|	вт43.ТоварнаяКатегория,
		|	вт43.Брендообъем,
		|	вт43.ВидПоказателя,
		|	вт43.Показатель,
		|	вт43.Приоритет,
		|	вт43.Группа,
		|	вт43.ВидДополнительнойСкидки
		|ИЗ
		|	вт43 КАК вт43
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт43.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт43.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт43.Вывеска = втАПИБрендообъемы.Вывеска
		|ГДЕ
		|	вт43.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт43.Период,
		|	вт43.Дивизион,
		|	вт43.КатегорияКлиента,
		|	вт43.Вывеска,
		|	вт43.Проект,
		|	вт43.ТоварнаяКатегория,
		|	вт43.Брендообъем,
		|	вт43.ВидПоказателя,
		|	вт43.Показатель,
		|	вт43.Приоритет,
		|	вт43.Группа,
		|	втАПИБрендообъемы.АдресПоставки,
		|	вт43.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт44.Период,
		|	вт44.Дивизион,
		|	вт44.КатегорияКлиента,
		|	вт44.Вывеска,
		|	вт44.АдресПоставки,
		|	вт44.Проект,
		|	вт44.ТоварнаяКатегория,
		|	вт44.Брендообъем,
		|	вт44.ВидПоказателя,
		|	вт44.Показатель,
		|	вт44.Приоритет,
		|	вт44.Группа,
		|	вт44.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт45
		|ИЗ
		|	вт44 КАК вт44
		|ГДЕ
		|	НЕ вт44.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт44.Период,
		|	вт44.Дивизион,
		|	вт44.КатегорияКлиента,
		|	вт44.Вывеска,
		|	вт44.АдресПоставки,
		|	втАПИБрендообъемы.Проект,
		|	вт44.ТоварнаяКатегория,
		|	вт44.Брендообъем,
		|	вт44.ВидПоказателя,
		|	вт44.Показатель,
		|	вт44.Приоритет,
		|	вт44.Группа,
		|	вт44.ВидДополнительнойСкидки
		|ИЗ
		|	вт44 КАК вт44
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт44.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт44.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт44.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт44.АдресПоставки = втАПИБрендообъемы.АдресПоставки
		|ГДЕ
		|	вт44.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт44.Период,
		|	вт44.Дивизион,
		|	вт44.КатегорияКлиента,
		|	вт44.Вывеска,
		|	вт44.АдресПоставки,
		|	вт44.ТоварнаяКатегория,
		|	вт44.Брендообъем,
		|	вт44.ВидПоказателя,
		|	вт44.Показатель,
		|	вт44.Приоритет,
		|	вт44.Группа,
		|	втАПИБрендообъемы.Проект,
		|	вт44.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт45.Период,
		|	вт45.Дивизион,
		|	вт45.КатегорияКлиента,
		|	вт45.Вывеска,
		|	вт45.АдресПоставки,
		|	вт45.Проект,
		|	вт45.ТоварнаяКатегория,
		|	вт45.Брендообъем,
		|	вт45.ВидПоказателя,
		|	вт45.Показатель,
		|	вт45.Приоритет,
		|	вт45.Группа,
		|	вт45.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт46
		|ИЗ
		|	вт45 КАК вт45
		|ГДЕ
		|	НЕ вт45.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт45.Период,
		|	вт45.Дивизион,
		|	вт45.КатегорияКлиента,
		|	вт45.Вывеска,
		|	вт45.АдресПоставки,
		|	вт45.Проект,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт45.Брендообъем,
		|	вт45.ВидПоказателя,
		|	вт45.Показатель,
		|	вт45.Приоритет,
		|	вт45.Группа,
		|	вт45.ВидДополнительнойСкидки
		|ИЗ
		|	вт45 КАК вт45
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт45.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт45.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт45.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт45.АдресПоставки = втАПИБрендообъемы.АдресПоставки
		|			И вт45.Проект = втАПИБрендообъемы.Проект
		|ГДЕ
		|	вт45.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт45.Период,
		|	вт45.Дивизион,
		|	вт45.КатегорияКлиента,
		|	вт45.Вывеска,
		|	вт45.АдресПоставки,
		|	вт45.Проект,
		|	вт45.Брендообъем,
		|	вт45.ВидПоказателя,
		|	вт45.Показатель,
		|	вт45.Приоритет,
		|	вт45.Группа,
		|	втАПИБрендообъемы.ТоварнаяКатегория,
		|	вт45.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт46.Период,
		|	вт46.Дивизион,
		|	вт46.КатегорияКлиента,
		|	вт46.Вывеска,
		|	вт46.АдресПоставки,
		|	вт46.Проект,
		|	вт46.ТоварнаяКатегория,
		|	вт46.Брендообъем,
		|	вт46.ВидПоказателя,
		|	вт46.Показатель,
		|	вт46.Приоритет,
		|	вт46.Группа,
		|	вт46.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ вт47
		|ИЗ
		|	вт46 КАК вт46
		|ГДЕ
		|	НЕ вт46.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт46.Период,
		|	вт46.Дивизион,
		|	вт46.КатегорияКлиента,
		|	вт46.Вывеска,
		|	вт46.АдресПоставки,
		|	вт46.Проект,
		|	вт46.ТоварнаяКатегория,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт46.ВидПоказателя,
		|	вт46.Показатель,
		|	вт46.Приоритет,
		|	вт46.Группа,
		|	вт46.ВидДополнительнойСкидки
		|ИЗ
		|	вт46 КАК вт46
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАПИБрендообъемы КАК втАПИБрендообъемы
		|		ПО вт46.Дивизион = втАПИБрендообъемы.Дивизион
		|			И вт46.КатегорияКлиента = втАПИБрендообъемы.КатегорияКлиента
		|			И вт46.Вывеска = втАПИБрендообъемы.Вывеска
		|			И вт46.АдресПоставки = втАПИБрендообъемы.АдресПоставки
		|			И вт46.Проект = втАПИБрендообъемы.Проект
		|			И вт46.ТоварнаяКатегория = втАПИБрендообъемы.ТоварнаяКатегория
		|ГДЕ
		|	вт46.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт46.Период,
		|	вт46.Дивизион,
		|	вт46.КатегорияКлиента,
		|	вт46.Вывеска,
		|	вт46.АдресПоставки,
		|	вт46.Проект,
		|	вт46.ТоварнаяКатегория,
		|	вт46.ВидПоказателя,
		|	вт46.Показатель,
		|	вт46.Приоритет,
		|	вт46.Группа,
		|	втАПИБрендообъемы.Брендообъем,
		|	вт46.ВидДополнительнойСкидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт47.Период,
		|	вт47.Дивизион,
		|	вт47.КатегорияКлиента,
		|	вт47.Вывеска,
		|	вт47.АдресПоставки,
		|	вт47.Проект,
		|	вт47.ТоварнаяКатегория,
		|	вт47.Брендообъем,
		|	вт47.ВидПоказателя,
		|	вт47.Показатель,
		|	вт47.Приоритет,
		|	МАКСИМУМ(вт47.ВидДополнительнойСкидки) КАК ВидДополнительнойСкидки
		|ПОМЕСТИТЬ втПланДополнительногоИзмененияЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт47.Период КАК Период,
		|		вт47.Дивизион КАК Дивизион,
		|		вт47.КатегорияКлиента КАК КатегорияКлиента,
		|		вт47.Вывеска КАК Вывеска,
		|		вт47.АдресПоставки КАК АдресПоставки,
		|		вт47.Проект КАК Проект,
		|		вт47.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт47.Брендообъем КАК Брендообъем,
		|		вт47.ВидПоказателя КАК ВидПоказателя,
		|		МАКСИМУМ(вт47.Показатель) КАК Показатель,
		|		вт47.Приоритет КАК Приоритет
		|	ИЗ
		|		(ВЫБРАТЬ
		|			вт47.Период КАК Период,
		|			вт47.Дивизион КАК Дивизион,
		|			вт47.КатегорияКлиента КАК КатегорияКлиента,
		|			вт47.Вывеска КАК Вывеска,
		|			вт47.АдресПоставки КАК АдресПоставки,
		|			вт47.Проект КАК Проект,
		|			вт47.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|			вт47.Брендообъем КАК Брендообъем,
		|			вт47.ВидПоказателя КАК ВидПоказателя,
		|			МАКСИМУМ(вт47.Приоритет) КАК Приоритет
		|		ИЗ
		|			вт47 КАК вт47
		|		ГДЕ
		|			вт47.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Процент)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			вт47.Период,
		|			вт47.Дивизион,
		|			вт47.КатегорияКлиента,
		|			вт47.Вывеска,
		|			вт47.АдресПоставки,
		|			вт47.Проект,
		|			вт47.ТоварнаяКатегория,
		|			вт47.Брендообъем,
		|			вт47.ВидПоказателя) КАК ВложенныйЗапрос
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт47 КАК вт47
		|			ПО ВложенныйЗапрос.Период = вт47.Период
		|				И ВложенныйЗапрос.Дивизион = вт47.Дивизион
		|				И ВложенныйЗапрос.КатегорияКлиента = вт47.КатегорияКлиента
		|				И ВложенныйЗапрос.КатегорияКлиента = вт47.КатегорияКлиента
		|				И ВложенныйЗапрос.Вывеска = вт47.Вывеска
		|				И ВложенныйЗапрос.АдресПоставки = вт47.АдресПоставки
		|				И ВложенныйЗапрос.Проект = вт47.Проект
		|				И ВложенныйЗапрос.ТоварнаяКатегория = вт47.ТоварнаяКатегория
		|				И ВложенныйЗапрос.Брендообъем = вт47.Брендообъем
		|				И ВложенныйЗапрос.ВидПоказателя = вт47.ВидПоказателя
		|				И ВложенныйЗапрос.Приоритет = вт47.Приоритет
		|	
		|	СГРУППИРОВАТЬ ПО
		|		вт47.Дивизион,
		|		вт47.Период,
		|		вт47.КатегорияКлиента,
		|		вт47.Вывеска,
		|		вт47.АдресПоставки,
		|		вт47.Проект,
		|		вт47.ТоварнаяКатегория,
		|		вт47.Брендообъем,
		|		вт47.ВидПоказателя,
		|		вт47.Приоритет) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт47 КАК вт47
		|		ПО ВложенныйЗапрос.Период = вт47.Период
		|			И ВложенныйЗапрос.Дивизион = вт47.Дивизион
		|			И ВложенныйЗапрос.КатегорияКлиента = вт47.КатегорияКлиента
		|			И ВложенныйЗапрос.Вывеска = вт47.Вывеска
		|			И ВложенныйЗапрос.АдресПоставки = вт47.АдресПоставки
		|			И ВложенныйЗапрос.Проект = вт47.Проект
		|			И ВложенныйЗапрос.ТоварнаяКатегория = вт47.ТоварнаяКатегория
		|			И ВложенныйЗапрос.Брендообъем = вт47.Брендообъем
		|			И ВложенныйЗапрос.ВидПоказателя = вт47.ВидПоказателя
		|			И ВложенныйЗапрос.Показатель = вт47.Показатель
		|			И ВложенныйЗапрос.Приоритет = вт47.Приоритет
		|
		|СГРУППИРОВАТЬ ПО
		|	вт47.Период,
		|	вт47.Дивизион,
		|	вт47.КатегорияКлиента,
		|	вт47.Вывеска,
		|	вт47.АдресПоставки,
		|	вт47.Проект,
		|	вт47.ТоварнаяКатегория,
		|	вт47.Брендообъем,
		|	вт47.ВидПоказателя,
		|	вт47.Показатель,
		|	вт47.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчета.Период,
		|	втРезультатРасчета.План,
		|	втРезультатРасчета.Дивизион,
		|	втРезультатРасчета.КатегорияКлиента,
		|	втРезультатРасчета.Вывеска,
		|	втРезультатРасчета.АдресПоставки,
		|	втРезультатРасчета.Проект,
		|	втРезультатРасчета.ТоварнаяКатегория,
		|	втРезультатРасчета.Брендообъем,
		|	втРезультатРасчета.Количество,
		|	втРезультатРасчета.ЦенаБезНДС,
		|	втРезультатРасчета.ЦенаБезНДССУчетомПовышения,
		|	втРезультатРасчета.СуммаБазовойВыручки,
		|	втРезультатРасчета.СуммаВыручкиГросс,
		|	ЕСТЬNULL(втПланПромоАкций.Показатель, 0) КАК ПроцентПромо,
		|	ЕСТЬNULL(втПланРетроБонусов.Показатель, 0) КАК ПроцентРетробонусов,
		|	ЕСТЬNULL(втПланМаркетинговыхУслуг.Показатель, 0) КАК ПроцентМаркетинговыхУслуг,
		|	ЕСТЬNULL(втПланПромоАкцийСкидкаПослеСчета.Показатель, 0) КАК ПроцентПромоСкидкаПослеСчета,
		|	ЕСТЬNULL(втПланДополнительногоИзмененияЦены.Показатель, 0) КАК ПроцентДополнительногоИзмененияЦены,
		|	ВЫБОР
		|		КОГДА втПланДополнительногоИзмененияЦены.Показатель ЕСТЬ NULL 
		|			ТОГДА втРезультатРасчета.СуммаБазовойВыручки
		|		ИНАЧЕ втРезультатРасчета.СуммаБазовойВыручки - втРезультатРасчета.СуммаБазовойВыручки * ЕСТЬNULL(втПланДополнительногоИзмененияЦены.Показатель, 0) / 100
		|	КОНЕЦ КАК СуммаБазовойВыручкиСДопСкидкой,
		|	втПланДополнительногоИзмененияЦены.ВидДополнительнойСкидки
		|ПОМЕСТИТЬ втРезультатРасчетаИ2
		|ИЗ
		|	втРезультатРасчета КАК втРезультатРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПланМаркетинговыхУслуг КАК втПланМаркетинговыхУслуг
		|		ПО втРезультатРасчета.Период = втПланМаркетинговыхУслуг.Период
		|			И втРезультатРасчета.Дивизион = втПланМаркетинговыхУслуг.Дивизион
		|			И втРезультатРасчета.КатегорияКлиента = втПланМаркетинговыхУслуг.КатегорияКлиента
		|			И втРезультатРасчета.Вывеска = втПланМаркетинговыхУслуг.Вывеска
		|			И втРезультатРасчета.Проект = втПланМаркетинговыхУслуг.Проект
		|			И втРезультатРасчета.ТоварнаяКатегория = втПланМаркетинговыхУслуг.ТоварнаяКатегория
		|			И втРезультатРасчета.Брендообъем = втПланМаркетинговыхУслуг.Брендообъем
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПланПромоАкций КАК втПланПромоАкций
		|		ПО втРезультатРасчета.Период = втПланПромоАкций.Период
		|			И втРезультатРасчета.Брендообъем = втПланПромоАкций.Брендообъем
		|			И втРезультатРасчета.Дивизион = втПланПромоАкций.Дивизион
		|			И втРезультатРасчета.КатегорияКлиента = втПланПромоАкций.КатегорияКлиента
		|			И втРезультатРасчета.Вывеска = втПланПромоАкций.Вывеска
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПланРетроБонусов КАК втПланРетроБонусов
		|		ПО втРезультатРасчета.Период = втПланРетроБонусов.Период
		|			И втРезультатРасчета.Дивизион = втПланРетроБонусов.Дивизион
		|			И втРезультатРасчета.КатегорияКлиента = втПланРетроБонусов.КатегорияКлиента
		|			И втРезультатРасчета.Вывеска = втПланРетроБонусов.Вывеска
		|			И втРезультатРасчета.Проект = втПланРетроБонусов.Проект
		|			И втРезультатРасчета.ТоварнаяКатегория = втПланРетроБонусов.ТоварнаяКатегория
		|			И втРезультатРасчета.Брендообъем = втПланРетроБонусов.Брендообъем
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПланПромоАкцийСкидкаПослеСчета КАК втПланПромоАкцийСкидкаПослеСчета
		|		ПО втРезультатРасчета.Период = втПланПромоАкцийСкидкаПослеСчета.Период
		|			И втРезультатРасчета.Брендообъем = втПланПромоАкцийСкидкаПослеСчета.Брендообъем
		|			И втРезультатРасчета.Дивизион = втПланПромоАкцийСкидкаПослеСчета.Дивизион
		|			И втРезультатРасчета.КатегорияКлиента = втПланПромоАкцийСкидкаПослеСчета.КатегорияКлиента
		|			И втРезультатРасчета.Вывеска = втПланПромоАкцийСкидкаПослеСчета.Вывеска
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПланДополнительногоИзмененияЦены КАК втПланДополнительногоИзмененияЦены
		|		ПО втРезультатРасчета.Период = втПланДополнительногоИзмененияЦены.Период
		|			И втРезультатРасчета.АдресПоставки = втПланДополнительногоИзмененияЦены.АдресПоставки
		|			И втРезультатРасчета.Брендообъем = втПланДополнительногоИзмененияЦены.Брендообъем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка) КАК КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка) КАК Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка) КАК Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка) КАК ТоварнаяКатегория,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка) КАК Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки) КАК СуммаБазовойВыручки,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой) КАК СуммаБазовойВыручкиСДопСкидкой
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.Брендообъем
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.КатегорияКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Брендообъем
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	втРезультатРасчетаИ2.Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	втРезультатРасчетаИ2.Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	втРезультатРасчетаИ2.Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.План,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.АдресПоставки,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Количество,
		|	втРезультатРасчетаИ2.ЦенаБезНДС,
		|	втРезультатРасчетаИ2.ЦенаБезНДССУчетомПовышения,
		|	втРезультатРасчетаИ2.СуммаБазовойВыручки,
		|	втРезультатРасчетаИ2.СуммаВыручкиГросс,
		|	втРезультатРасчетаИ2.ПроцентПромо,
		|	втРезультатРасчетаИ2.ПроцентРетробонусов,
		|	втРезультатРасчетаИ2.ПроцентМаркетинговыхУслуг,
		|	втРезультатРасчетаИ2.ПроцентПромоСкидкаПослеСчета,
		|	втРезультатРасчетаИ2.ПроцентДополнительногоИзмененияЦены,
		|	втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой,
		|	втРезультатРасчетаИ2.ВидДополнительнойСкидки
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные.Период,
		|	втИсходныеДанные.Дивизион,
		|	втИсходныеДанные.КатегорияКлиента,
		|	втИсходныеДанные.Вывеска,
		|	втИсходныеДанные.Брендообъем,
		|	втИсходныеДанные.ВидПоказателя,
		|	втИсходныеДанные.Показатель,
		|	втИсходныеДанные.Приоритет,
		|	втИсходныеДанные.Группа
		|ИЗ
		|	втИсходныеДанные КАК втИсходныеДанные
		|ГДЕ
		|	втИсходныеДанные.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Сумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП_ПланЭТКТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланЭТКТабличнаяЧасть.Дивизион,
		|	ПП_ПланЭТКТабличнаяЧасть.КатегорияКлиента,
		|	ПП_ПланЭТКТабличнаяЧасть.ВидПоказателя,
		|	МАКСИМУМ(ПП_ПланЭТКТабличнаяЧасть.Показатель) КАК Показатель
		|ИЗ
		|	Документ.ПП_ПланЭТК.ТабличнаяЧасть КАК ПП_ПланЭТКТабличнаяЧасть
		|ГДЕ
		|	ПП_ПланЭТКТабличнаяЧасть.Ссылка.Проведен
		|	И ПП_ПланЭТКТабличнаяЧасть.Ссылка.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПП_ПланЭТКТабличнаяЧасть.Показатель <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПП_ПланЭТКТабличнаяЧасть.ВидПоказателя,
		|	ПП_ПланЭТКТабличнаяЧасть.Ссылка.Период,
		|	ПП_ПланЭТКТабличнаяЧасть.Дивизион,
		|	ПП_ПланЭТКТабличнаяЧасть.КатегорияКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеРетробонусы.Период,
		|	втИсходныеДанныеРетробонусы.Дивизион,
		|	втИсходныеДанныеРетробонусы.КатегорияКлиента,
		|	втИсходныеДанныеРетробонусы.Вывеска,
		|	втИсходныеДанныеРетробонусы.Проект,
		|	втИсходныеДанныеРетробонусы.ТоварнаяКатегория,
		|	втИсходныеДанныеРетробонусы.ВидПоказателя,
		|	втИсходныеДанныеРетробонусы.Показатель,
		|	втИсходныеДанныеРетробонусы.Приоритет,
		|	втИсходныеДанныеРетробонусы.Группа
		|ИЗ
		|	втИсходныеДанныеРетробонусы КАК втИсходныеДанныеРетробонусы
		|ГДЕ
		|	втИсходныеДанныеРетробонусы.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Сумма)
		|	И втИсходныеДанныеРетробонусы.Показатель <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеМаркетинговыхУслуг.Период,
		|	втИсходныеДанныеМаркетинговыхУслуг.Дивизион,
		|	втИсходныеДанныеМаркетинговыхУслуг.КатегорияКлиента,
		|	втИсходныеДанныеМаркетинговыхУслуг.Вывеска,
		|	втИсходныеДанныеМаркетинговыхУслуг.Проект,
		|	втИсходныеДанныеМаркетинговыхУслуг.ТоварнаяКатегория,
		|	втИсходныеДанныеМаркетинговыхУслуг.ВидПоказателя,
		|	втИсходныеДанныеМаркетинговыхУслуг.Показатель,
		|	втИсходныеДанныеМаркетинговыхУслуг.Приоритет,
		|	втИсходныеДанныеМаркетинговыхУслуг.Группа
		|ИЗ
		|	втИсходныеДанныеМаркетинговыхУслуг КАК втИсходныеДанныеМаркетинговыхУслуг
		|ГДЕ
		|	втИсходныеДанныеМаркетинговыхУслуг.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Сумма)
		|	И втИсходныеДанныеМаркетинговыхУслуг.Показатель <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанныеСкидкаПослеСчета.Период,
		|	втИсходныеДанныеСкидкаПослеСчета.Дивизион,
		|	втИсходныеДанныеСкидкаПослеСчета.КатегорияКлиента,
		|	втИсходныеДанныеСкидкаПослеСчета.Вывеска,
		|	втИсходныеДанныеСкидкаПослеСчета.Брендообъем,
		|	втИсходныеДанныеСкидкаПослеСчета.ВидПоказателя,
		|	втИсходныеДанныеСкидкаПослеСчета.Показатель,
		|	втИсходныеДанныеСкидкаПослеСчета.Приоритет,
		|	втИсходныеДанныеСкидкаПослеСчета.Группа
		|ИЗ
		|	втИсходныеДанныеСкидкаПослеСчета КАК втИсходныеДанныеСкидкаПослеСчета
		|ГДЕ
		|	втИсходныеДанныеСкидкаПослеСчета.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Сумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Период,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Дивизион,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.КатегорияКлиента,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Вывеска,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Брендообъем,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидПоказателя,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Показатель,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Приоритет,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.Группа,
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидДополнительнойСкидки
		|ИЗ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены КАК втИсходныеДанные_ПланДополнительногоИзмененияЦены
		|ГДЕ
		|	втИсходныеДанные_ПланДополнительногоИзмененияЦены.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ППП_ВидПоказателя.Сумма)
		|	И втИсходныеДанные_ПланДополнительногоИзмененияЦены.Показатель <> 0";

	Запрос.УстановитьПараметр("РезультатРасчета", РезультатРасчета.Выгрузить());	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Результат = Запрос.ВыполнитьПакет();
	
	Итоги = Результат[40].Выгрузить();
	РезультатРасчета.Загрузить(Результат[41].Выгрузить());
	ПромоДляРаспределения = Результат[42].Выгрузить();
	ЭТКДляРаспределения = Результат[43].Выгрузить();
	РетробонусыДляРаспределения = Результат[44].Выгрузить();
	МаркетинговыеУслугиДляРаспределения = Результат[45].Выгрузить();
	//{07.04.2016 Островерхий заявка №49367 
	ПромоСкидкаПослеСчетаДляРаспределения = Результат[46].Выгрузить(); 
	//07.04.2016 Островерхий} 

	//{06.02.2017 Островерхий заявка №57373 
	//{09.03.2017 Островерхий заявка №62932
	ДополнительноеИзмененияЦеныДляРаспределения = Результат[47].Выгрузить(); //47
	//Распределим план доп. изменения цены в руб
	тГруппы = ДополнительноеИзмененияЦеныДляРаспределения.Скопировать();
	тГруппы.Свернуть("Период,Группа");

	Для каждого ТекГруппа Из тГруппы Цикл
		
		НайденныеСтрокиДляРаспределения = ДополнительноеИзмененияЦеныДляРаспределения.НайтиСтроки(Новый Структура("Период,Группа",ТекГруппа.Период,ТекГруппа.Группа));
		тПоказательГруппы = НайденныеСтрокиДляРаспределения[0].Показатель;
		//{14.02.2017 Островерхий заявка №57373 
		тСуммаБазовойВыручки = ПосчитатьСуммуГруппы("СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,Итоги,Истина); 
				
		//Расчитаем сумму
		//{01.08.2017 Островерхий заявка №64854 
		тВидДополнительнойСкидки = НайденныеСтрокиДляРаспределения[0].ВидДополнительнойСкидки;
		
		//РасчитаемСуммуБонусов("СуммаДопСкидки","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина) 
		Если тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.Представленность Тогда
			РасчитаемСуммуБонусов("СуммаПредставленность","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина);	
		ИначеЕсли тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.ЭТК Тогда
			РасчитаемСуммуБонусов("СуммаЭТКВСчете","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина);	
		//{24.10.2017 Островерхий заявка №72059 
		ИначеЕсли тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.RSP Тогда
			РасчитаемСуммуБонусов("СуммаRSP","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина); 
		//24.10.2017 Островерхий} 	
		Иначе
			РасчитаемСуммуБонусов("СуммаДопСкидки","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина);
		КонецЕсли; 
		//01.08.2017 Островерхий} 
		//14.02.2017 Островерхий} 

	КонецЦикла; 
	
	//{14.03.2017 Островерхий заявка №57373 
	//Расчетаем СуммаБазовойВыручкиСДопСкидкой
	Для каждого СтрТЧ Из РезультатРасчета Цикл
		//{02.08.2017 Островерхий заявка №64854 
		//СтрТЧ.СуммаДопСкидки = СтрТЧ.СуммаДопСкидки + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентДополнительногоИзмененияЦены / 100;
		
		тВидДополнительнойСкидки = СтрТЧ.ВидДополнительнойСкидки;
		
		Если тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.Представленность Тогда
			СтрТЧ.СуммаПредставленность = СтрТЧ.СуммаПредставленность + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентДополнительногоИзмененияЦены / 100;	
		ИначеЕсли тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.ЭТК Тогда
			СтрТЧ.СуммаЭТКВСчете = СтрТЧ.СуммаЭТКВСчете + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентДополнительногоИзмененияЦены / 100;	
		//{24.10.2017 Островерхий заявка №72059 
		ИначеЕсли тВидДополнительнойСкидки = Перечисления.ППП_ВидДополнительнойСкидкиДляПланирования.RSP Тогда
			СтрТЧ.СуммаRSP = СтрТЧ.СуммаRSP + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентДополнительногоИзмененияЦены / 100; 
		//24.10.2017 Островерхий} 	
		Иначе
			СтрТЧ.СуммаДопСкидки = СтрТЧ.СуммаДопСкидки + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентДополнительногоИзмененияЦены / 100;
		КонецЕсли;
		//02.08.2017 Островерхий} 
		//{24.10.2017 Островерхий заявка №72059 
		//СтрТЧ.СуммаБазовойВыручкиСДопСкидкой = СтрТЧ.СуммаБазовойВыручки-СтрТЧ.СуммаДопСкидки-СтрТЧ.СуммаПредставленность-СтрТЧ.СуммаЭТКВСчете; 
		СтрТЧ.СуммаБазовойВыручкиСДопСкидкой = СтрТЧ.СуммаБазовойВыручки-СтрТЧ.СуммаДопСкидки-СтрТЧ.СуммаПредставленность-СтрТЧ.СуммаЭТКВСчете-СтрТЧ.СуммаRSP;
		//24.10.2017 Островерхий} 
		
	КонецЦикла; 
	//14.03.2017 Островерхий} 
	
	Итоги = ПересчитатьИтоги(РезультатРасчета);
	//09.03.2017 Островерхий}
	//06.02.2017 Островерхий} 
	
	//Распределим промо в руб
	тГруппы = ПромоДляРаспределения.Скопировать();
	тГруппы.Свернуть("Период,Группа");

	Для каждого ТекГруппа Из тГруппы Цикл
		
		НайденныеСтрокиДляРаспределения = ПромоДляРаспределения.НайтиСтроки(Новый Структура("Период,Группа",ТекГруппа.Период,ТекГруппа.Группа));
		тПоказательГруппы = НайденныеСтрокиДляРаспределения[0].Показатель;
		//{14.02.2017 Островерхий заявка №57373 
		//тСуммаБазовойВыручки = ПосчитатьСуммуГруппы("СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,Итоги,Истина); 
		тСуммаБазовойВыручкиСДопСкидкой = ПосчитатьСуммуГруппы("СуммаБазовойВыручкиСДопСкидкой",НайденныеСтрокиДляРаспределения,Итоги,Истина);
				
		//Расчитаем сумму ретробонусов
		//РасчитаемСуммуБонусов("СуммаПромоАкции","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина);
		РасчитаемСуммуБонусов("СуммаПромоАкции","СуммаБазовойВыручкиСДопСкидкой",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручкиСДопСкидкой,тПоказательГруппы,Истина);
		//14.02.2017 Островерхий} 

	КонецЦикла;
	
	//Расчетаем %
	Для каждого СтрТЧ Из РезультатРасчета Цикл
		
		//{14.02.2017 Островерхий заявка №57373 
		//СтрТЧ.СуммаПромоАкции = СтрТЧ.СуммаПромоАкции + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентПромо / 100;
		//СтрТЧ.СуммаВыручкиГросс = СтрТЧ.СуммаБазовойВыручки - СтрТЧ.СуммаПромоАкции;
		СтрТЧ.СуммаПромоАкции = СтрТЧ.СуммаПромоАкции + СтрТЧ.СуммаБазовойВыручкиСДопСкидкой * СтрТЧ.ПроцентПромо / 100;
		СтрТЧ.СуммаВыручкиГросс = СтрТЧ.СуммаБазовойВыручкиСДопСкидкой - СтрТЧ.СуммаПромоАкции;
		//14.02.2017 Островерхий} 
		СтрТЧ.СуммаРетробонусов = СтрТЧ.СуммаВыручкиГросс * СтрТЧ.ПроцентРетробонусов / 100;
	    СтрТЧ.СуммаМаркетинговыхУслуг = СтрТЧ.СуммаВыручкиГросс * СтрТЧ.ПроцентМаркетинговыхУслуг / 100;
		
		//{14.02.2017 Островерхий заявка №57373 
		////{07.04.2016 Островерхий заявка №49367 
		//СтрТЧ.СуммаПромоАкцииСкидкаПослеСчета = СтрТЧ.СуммаПромоАкцииСкидкаПослеСчета + СтрТЧ.СуммаБазовойВыручки * СтрТЧ.ПроцентПромоСкидкаПослеСчета / 100; 
		////07.04.2016 Островерхий} 
		СтрТЧ.СуммаПромоАкцииСкидкаПослеСчета = СтрТЧ.СуммаПромоАкцииСкидкаПослеСчета + СтрТЧ.СуммаБазовойВыручкиСДопСкидкой * СтрТЧ.ПроцентПромоСкидкаПослеСчета / 100;
		//14.02.2017 Островерхий} 

	КонецЦикла; 
	
	//Обновим ТЧ итоги для расчета Ретробонусов, Маркетинговых услуг и ЭТК выраженных в рублях на основе выручки ГРОСС
	Итоги = ПересчитатьИтоги(РезультатРасчета);
	
	
	//Распределим ретробонусы в руб
	тГруппы = РетробонусыДляРаспределения.Скопировать();
	тГруппы.Свернуть("Период,Группа");
	
	Для каждого ТекГруппа Из тГруппы Цикл
		
		НайденныеСтрокиДляРаспределения = РетробонусыДляРаспределения.НайтиСтроки(Новый Структура("Период,Группа",ТекГруппа.Период,ТекГруппа.Группа));
		тПоказательГруппы = НайденныеСтрокиДляРаспределения[0].Показатель;
		тСуммаГросс = ПосчитатьСуммуГруппы("СуммаВыручкиГросс",НайденныеСтрокиДляРаспределения,Итоги);
		
		//Расчитаем сумму ретробонусов
		РасчитаемСуммуБонусов("СуммаРетробонусов","СуммаВыручкиГросс",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаГросс,тПоказательГруппы);
		
	КонецЦикла; 
	
	//Распределим маркетинговые услуги в руб
	тГруппы = МаркетинговыеУслугиДляРаспределения.Скопировать();
	тГруппы.Свернуть("Период,Группа");

	Для каждого ТекГруппа Из тГруппы Цикл
		
		НайденныеСтрокиДляРаспределения = МаркетинговыеУслугиДляРаспределения.НайтиСтроки(Новый Структура("Период,Группа",ТекГруппа.Период,ТекГруппа.Группа));
		тПоказательГруппы = НайденныеСтрокиДляРаспределения[0].Показатель;
		тСуммаГросс = ПосчитатьСуммуГруппы("СуммаВыручкиГросс",НайденныеСтрокиДляРаспределения,Итоги);
		
		//Расчитаем сумму ретробонусов
		РасчитаемСуммуБонусов("СуммаМаркетинговыхУслуг","СуммаВыручкиГросс",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаГросс,тПоказательГруппы);
		
	КонецЦикла; 
 	
	//Распределим ЭТК в руб
	Для каждого СтрТЧ Из ЭТКДляРаспределения Цикл
		
		СтруктураПоиска = Новый Структура("Период,Дивизион,КатегорияКлиента,Вывеска,Брендообъем",СтрТЧ.Период,Справочники.ПРГДивизионы.ПустаяСсылка(),Справочники.НСИ_КатегорииКлиентов.ПустаяСсылка(),Справочники.НСИ_Вывески.ПустаяСсылка(),Справочники.НСИ_Брендообъемы.ПустаяСсылка());
		СтруктураПоиска2 = Новый Структура("Период",СтрТЧ.Период);
		
		Если ЗначениеЗаполнено(СтрТЧ.Дивизион) Тогда
			СтруктураПоиска.Вставить("Дивизион",СтрТЧ.Дивизион);
			СтруктураПоиска2.Вставить("Дивизион",СтрТЧ.Дивизион);
		КонецЕсли; 		
		Если ЗначениеЗаполнено(СтрТЧ.КатегорияКлиента) Тогда
			СтруктураПоиска.Вставить("КатегорияКлиента",СтрТЧ.КатегорияКлиента);
			СтруктураПоиска2.Вставить("КатегорияКлиента",СтрТЧ.КатегорияКлиента);
		КонецЕсли; 
		
		НайденныеСтрокиИтоги = Итоги.НайтиСтроки(СтруктураПоиска);
	    НайденныеСтроки = РезультатРасчета.НайтиСтроки(СтруктураПоиска2);
		
		Если НайденныеСтроки.Количество()>0 И НайденныеСтрокиИтоги.Количество()>0 И НайденныеСтрокиИтоги[0].СуммаВыручкиГросс > 0 Тогда
		
			Для каждого ТекСтр Из НайденныеСтроки Цикл
				ТекСтр.СуммаЭТК = ТекСтр.СуммаВыручкиГросс / НайденныеСтрокиИтоги[0].СуммаВыручкиГросс * СтрТЧ.Показатель; 	
			КонецЦикла; 	
			
		КонецЕсли; 
		
	КонецЦикла;
	
	//{07.04.2016 Островерхий заявка №49367 
	//Распределим промо в руб
	тГруппы = ПромоСкидкаПослеСчетаДляРаспределения.Скопировать();
	тГруппы.Свернуть("Период,Группа");

	Для каждого ТекГруппа Из тГруппы Цикл
		
		НайденныеСтрокиДляРаспределения = ПромоСкидкаПослеСчетаДляРаспределения.НайтиСтроки(Новый Структура("Период,Группа",ТекГруппа.Период,ТекГруппа.Группа));
		тПоказательГруппы = НайденныеСтрокиДляРаспределения[0].Показатель;
		//{14.02.2017 Островерхий заявка №57373 
		//тСуммаБазовойВыручки = ПосчитатьСуммуГруппы("СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,Итоги,Истина);
		тСуммаБазовойВыручкиСДопСкидкой = ПосчитатьСуммуГруппы("СуммаБазовойВыручкиСДопСкидкой",НайденныеСтрокиДляРаспределения,Итоги,Истина);

		//Расчитаем сумму промо
		//РасчитаемСуммуБонусов("СуммаПромоАкцииСкидкаПослеСчета","СуммаБазовойВыручки",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручки,тПоказательГруппы,Истина); 
		РасчитаемСуммуБонусов("СуммаПромоАкцииСкидкаПослеСчета","СуммаБазовойВыручкиСДопСкидкой",НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазовойВыручкиСДопСкидкой,тПоказательГруппы,Истина);
		//14.02.2017 Островерхий} 
		
	КонецЦикла; 
	//07.04.2016 Островерхий} 
	
	//Расчитаем выручку нетто
	Для каждого СтрокаТЧ Из РезультатРасчета Цикл
		
		СтрокаТЧ.СуммаВыручкиНетто = СтрокаТЧ.СуммаВыручкиГросс - СтрокаТЧ.СуммаРетробонусов - СтрокаТЧ.СуммаМаркетинговыхУслуг - СтрокаТЧ.СуммаЭТК;
		//{07.04.2016 Островерхий заявка №49367 
		СтрокаТЧ.СуммаВыручкиНетто = СтрокаТЧ.СуммаВыручкиНетто-СтрокаТЧ.СуммаПромоАкцииСкидкаПослеСчета; 
		//07.04.2016 Островерхий} 
		
	КонецЦикла;
	
	//Сохраним результат расчета
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатРасчета.Период КАК Период,
		|	РезультатРасчета.План КАК План,
		|	РезультатРасчета.Дивизион КАК Дивизион,
		|	РезультатРасчета.Вывеска КАК Вывеска,
		|	РезультатРасчета.АдресПоставки КАК АдресПоставки,
		|	РезультатРасчета.Проект КАК Проект,
		|	РезультатРасчета.Брендообъем КАК Брендообъем,
		|	РезультатРасчета.Количество,
		|	РезультатРасчета.ЦенаБезНДС,
		|	РезультатРасчета.ЦенаБезНДССУчетомПовышения,
		|	РезультатРасчета.СуммаБазовойВыручки,
		|	РезультатРасчета.КатегорияКлиента КАК КатегорияКлиента,
		|	РезультатРасчета.СуммаПромоАкции,
		|	РезультатРасчета.СуммаВыручкиГросс,
		|	РезультатРасчета.СуммаРетробонусов,
		|	РезультатРасчета.СуммаМаркетинговыхУслуг,
		|	РезультатРасчета.СуммаЭТК,
		|	РезультатРасчета.СуммаВыручкиНетто,
		|	РезультатРасчета.ТоварнаяКатегория,
		|	РезультатРасчета.СуммаПромоАкцииСкидкаПослеСчета,
		|	РезультатРасчета.СуммаБазовойВыручкиСДопСкидкой,
		|	РезультатРасчета.СуммаПредставленность,
		|	РезультатРасчета.СуммаЭТКВСчете,
		|	РезультатРасчета.СуммаRSP
		|ПОМЕСТИТЬ втРезультатРасчета
		|ИЗ
		|	&РезультатРасчета КАК РезультатРасчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	План,
		|	АдресПоставки,
		|	Брендообъем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланПродажСоставПлана.Ссылка КАК Ссылка,
		|	ПланПродажСоставПлана.Номенклатура,
		|	ПланПродажСоставПлана.ХарактеристикаНоменклатуры,
		|	ПланПродажСоставПлана.ЕдиницаИзмерения,
		|	ПланПродажСоставПлана.Коэффициент,
		|	СУММА(ПланПродажСоставПлана.Количество) КАК Количество,
		|	ПланПродажСоставПлана.СтавкаНДС,
		|	ПланПродажСоставПлана.Заказ,
		|	ПланПродажСоставПлана.Период,
		|	ПланПродажСоставПлана.Контрагент,
		|	ПланПродажСоставПлана.Договор,
		|	ПланПродажСоставПлана.Источник,
		|	ПланПродажСоставПлана.ВариантРаспределения,
		|	ПланПродажСоставПлана.ППП_АдресПоставки КАК ППП_АдресПоставки,
		|	ПланПродажСоставПлана.ППП_ТоварнаяКатегория,
		|	ПланПродажСоставПлана.ППП_Брендообъем КАК ППП_Брендообъем,
		|	ПланПродажСоставПлана.ППП_КаналПродаж,
		|	ПланПродажСоставПлана.ППП_ПрайсЛист,
		|	СУММА(ПланПродажСоставПлана.ППП_ВесБрутто) КАК ППП_ВесБрутто,
		|	СУММА(ПланПродажСоставПлана.ППП_ВесНетто) КАК ППП_ВесНетто,
		|	СУММА(ПланПродажСоставПлана.ППП_Литры) КАК ППП_Литры
		|ПОМЕСТИТЬ втПланПродажСоставПлана
		|ИЗ
		|	Документ.ПланПродаж.СоставПлана КАК ПланПродажСоставПлана
		|ГДЕ
		|	ПланПродажСоставПлана.Ссылка В(&МассивПланов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланПродажСоставПлана.Ссылка,
		|	ПланПродажСоставПлана.Номенклатура,
		|	ПланПродажСоставПлана.ХарактеристикаНоменклатуры,
		|	ПланПродажСоставПлана.ЕдиницаИзмерения,
		|	ПланПродажСоставПлана.Коэффициент,
		|	ПланПродажСоставПлана.СтавкаНДС,
		|	ПланПродажСоставПлана.Заказ,
		|	ПланПродажСоставПлана.Период,
		|	ПланПродажСоставПлана.Контрагент,
		|	ПланПродажСоставПлана.Договор,
		|	ПланПродажСоставПлана.Источник,
		|	ПланПродажСоставПлана.ВариантРаспределения,
		|	ПланПродажСоставПлана.ППП_АдресПоставки,
		|	ПланПродажСоставПлана.ППП_ТоварнаяКатегория,
		|	ПланПродажСоставПлана.ППП_Брендообъем,
		|	ПланПродажСоставПлана.ППП_КаналПродаж,
		|	ПланПродажСоставПлана.ППП_ПрайсЛист
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ППП_АдресПоставки,
		|	ППП_Брендообъем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПланПродажСоставПлана.Ссылка КАК Ссылка,
		|	втПланПродажСоставПлана.Номенклатура,
		|	втПланПродажСоставПлана.ХарактеристикаНоменклатуры,
		|	втПланПродажСоставПлана.ЕдиницаИзмерения,
		|	втПланПродажСоставПлана.Коэффициент,
		|	втПланПродажСоставПлана.Количество,
		|	ВЫБОР
		|		КОГДА втПланПродажСоставПлана.Количество = 0
		|			ТОГДА втРезультатРасчета.СуммаВыручкиНетто
		|		ИНАЧЕ втРезультатРасчета.СуммаВыручкиНетто / втПланПродажСоставПлана.Количество
		|	КОНЕЦ КАК Цена,
		|	втРезультатРасчета.СуммаВыручкиНетто КАК Сумма,
		|	втПланПродажСоставПлана.СтавкаНДС,
		|	втРезультатРасчета.СуммаВыручкиНетто * ВЫБОР
		|		КОГДА втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|				ИЛИ втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|			ТОГДА 0.18
		|		КОГДА втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|				ИЛИ втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|			ТОГДА 0.1
		|		КОГДА втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|				ИЛИ втПланПродажСоставПлана.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|			ТОГДА 0.2
		|		ИНАЧЕ 0
		|	КОНЕЦ * 0 КАК СуммаНДС,
		|	втПланПродажСоставПлана.Заказ,
		|	втПланПродажСоставПлана.Период,
		|	втПланПродажСоставПлана.Контрагент,
		|	втПланПродажСоставПлана.Договор,
		|	втПланПродажСоставПлана.Источник,
		|	втПланПродажСоставПлана.ВариантРаспределения,
		|	втПланПродажСоставПлана.ППП_АдресПоставки,
		|	втПланПродажСоставПлана.ППП_ТоварнаяКатегория,
		|	втПланПродажСоставПлана.ППП_Брендообъем,
		|	втПланПродажСоставПлана.ППП_КаналПродаж,
		|	втПланПродажСоставПлана.ППП_ВесБрутто,
		|	втПланПродажСоставПлана.ППП_ВесНетто,
		|	втПланПродажСоставПлана.ППП_Литры,
		|	втПланПродажСоставПлана.Количество * втРезультатРасчета.ЦенаБезНДС КАК ППП_СуммаПрайсЛист,
		|	втПланПродажСоставПлана.Количество * втРезультатРасчета.ЦенаБезНДССУчетомПовышения КАК ППП_СуммаПовышенияЦен,
		|	втРезультатРасчета.СуммаПромоАкции КАК ППП_СуммаПромоАкции,
		|	втРезультатРасчета.СуммаВыручкиГросс КАК ППП_СуммаГросс,
		|	втРезультатРасчета.СуммаРетробонусов КАК ППП_СуммаБюджетРетробонусов,
		|	втРезультатРасчета.СуммаМаркетинговыхУслуг КАК ППП_СуммаМаркетинговыеУслуги,
		|	втРезультатРасчета.СуммаЭТК КАК ППП_СуммаЭТК,
		|	втРезультатРасчета.ЦенаБезНДС КАК ППП_ЦенаПоПрайсЛистам,
		|	втРезультатРасчета.ЦенаБезНДССУчетомПовышения КАК ППП_ЦенаПовышенияЦен,
		|	втРезультатРасчета.СуммаПромоАкцииСкидкаПослеСчета КАК ППП_СуммаПромоАкцииСкидкаПослеСчета,
		|	втРезультатРасчета.СуммаБазовойВыручкиСДопСкидкой КАК ППП_СтоимостьСДопСкидкой,
		|	втРезультатРасчета.СуммаПредставленность КАК ППП_СуммаПредставленность,
		|	втРезультатРасчета.СуммаЭТКВСчете КАК ППП_СуммаЭТКСкидкаВСчете,
		|	втРезультатРасчета.СуммаRSP КАК ППП_СуммаRSP
		|ИЗ
		|	втПланПродажСоставПлана КАК втПланПродажСоставПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатРасчета КАК втРезультатРасчета
		|		ПО втПланПродажСоставПлана.ППП_АдресПоставки = втРезультатРасчета.АдресПоставки
		|			И втПланПродажСоставПлана.ППП_Брендообъем = втРезультатРасчета.Брендообъем
		|			И втПланПродажСоставПлана.Ссылка = втРезультатРасчета.План
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";

	Запрос.УстановитьПараметр("РезультатРасчета", РезультатРасчета.Выгрузить());
	Запрос.УстановитьПараметр("МассивПланов", ПланыПродаж);
	Результат = Запрос.Выполнить();
	
	Для каждого ТекСтрока Из НулевыеЦены Цикл
		ТекСтрока.ПериодПолученияЦен = ПериодПолученияЦен;	
	КонецЦикла; 
	
	ПРГ_Привелегированный.СохранитьРезультатРасчетаПланаПродаж(Результат.Выгрузить(),НулевыеЦены); 
	
КонецПроцедуры

Функция ПересчитатьИтоги(РезультатРасчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатРасчета.Период КАК Период,
		|	РезультатРасчета.Дивизион КАК Дивизион,
		|	РезультатРасчета.КатегорияКлиента КАК КатегорияКлиента,
		|	РезультатРасчета.Вывеска КАК Вывеска,
		|	РезультатРасчета.АдресПоставки,
		|	РезультатРасчета.Проект КАК Проект,
		|	РезультатРасчета.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	РезультатРасчета.Брендообъем,
		|	РезультатРасчета.Количество,
		|	РезультатРасчета.ЦенаБезНДС,
		|	РезультатРасчета.ЦенаБезНДССУчетомПовышения,
		|	РезультатРасчета.СуммаБазовойВыручки,
		|	РезультатРасчета.План,
		|	РезультатРасчета.СуммаВыручкиГросс,
		|	РезультатРасчета.СуммаБазовойВыручкиСДопСкидкой
		|ПОМЕСТИТЬ втРезультатРасчета
		|ИЗ
		|	&РезультатРасчета КАК РезультатРасчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Дивизион,
		|	КатегорияКлиента,
		|	Вывеска,
		|	Проект,
		|	ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчета.Период,
		|	втРезультатРасчета.План,
		|	втРезультатРасчета.Дивизион,
		|	втРезультатРасчета.КатегорияКлиента,
		|	втРезультатРасчета.Вывеска,
		|	втРезультатРасчета.АдресПоставки,
		|	втРезультатРасчета.Проект,
		|	втРезультатРасчета.ТоварнаяКатегория,
		|	втРезультатРасчета.Брендообъем,
		|	втРезультатРасчета.Количество,
		|	втРезультатРасчета.ЦенаБезНДС,
		|	втРезультатРасчета.ЦенаБезНДССУчетомПовышения,
		|	втРезультатРасчета.СуммаБазовойВыручки,
		|	втРезультатРасчета.СуммаВыручкиГросс,
		|	втРезультатРасчета.СуммаБазовойВыручкиСДопСкидкой
		|ПОМЕСТИТЬ втРезультатРасчетаИ2
		|ИЗ
		|	втРезультатРасчета КАК втРезультатРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка) КАК КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка) КАК Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка) КАК Брендообъем,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка) КАК Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка) КАК ТоварнаяКатегория,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки) КАК СуммаБазовойВыручки,
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс) КАК СуммаВыручкиГросс,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой) КАК СуммаБазовойВыручкиСДопСкидкой
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Брендообъем,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.Брендообъем
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.КатегорияКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Брендообъем,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Брендообъем,
		|	втРезультатРасчетаИ2.Вывеска,
		|	втРезультатРасчетаИ2.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Брендообъем,
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Брендообъем
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_КатегорииКлиентов.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.Дивизион,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.ТоварнаяКатегория,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втРезультатРасчетаИ2.Период,
		|	ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Вывеска,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка),
		|	втРезультатРасчетаИ2.Проект,
		|	ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручки),
		|	СУММА(втРезультатРасчетаИ2.СуммаВыручкиГросс),
		|	СУММА(втРезультатРасчетаИ2.СуммаБазовойВыручкиСДопСкидкой)
		|ИЗ
		|	втРезультатРасчетаИ2 КАК втРезультатРасчетаИ2
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультатРасчетаИ2.Период,
		|	втРезультатРасчетаИ2.КатегорияКлиента,
		|	втРезультатРасчетаИ2.Проект,
		|	втРезультатРасчетаИ2.Вывеска";

	Запрос.УстановитьПараметр("РезультатРасчета", РезультатРасчета.Выгрузить());	
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции //
  

Функция ПосчитатьСуммуГруппы(ВидБазы,НайденныеСтрокиДляРаспределения,Итоги,ИсключитьФильтрПоПроектуИТоварнойКатегории=Ложь) Экспорт 

	тСуммаГросс = 0;
	
	//Посчитаем сумму ГРОСС группы
	Для каждого СтрТЧ Из НайденныеСтрокиДляРаспределения Цикл
		
		Если ИсключитьФильтрПоПроектуИТоварнойКатегории Тогда
			
			СтруктураПоиска = Новый Структура("Период,Дивизион,КатегорияКлиента,Вывеска,Брендообъем"
				,СтрТЧ.Период,Справочники.ПРГДивизионы.ПустаяСсылка(),Справочники.НСИ_КатегорииКлиентов.ПустаяСсылка()
				,Справочники.НСИ_Вывески.ПустаяСсылка(),Справочники.НСИ_Брендообъемы.ПустаяСсылка()
				);
			
		Иначе
			
			СтруктураПоиска = Новый Структура("Период,Дивизион,КатегорияКлиента,Вывеска,Брендообъем,Проект,ТоварнаяКатегория"
				,СтрТЧ.Период,Справочники.ПРГДивизионы.ПустаяСсылка(),Справочники.НСИ_КатегорииКлиентов.ПустаяСсылка()
				,Справочники.НСИ_Вывески.ПустаяСсылка(),Справочники.НСИ_Брендообъемы.ПустаяСсылка()
				,Справочники.ПРГ_ПроектыГП.ПустаяСсылка(),Справочники.НСИ_ТоварныеКатегории.ПустаяСсылка()
				);
			
		КонецЕсли; 
		
		
		Если ЗначениеЗаполнено(СтрТЧ.Дивизион) Тогда
			СтруктураПоиска.Вставить("Дивизион",СтрТЧ.Дивизион);
		КонецЕсли; 		
		Если ЗначениеЗаполнено(СтрТЧ.КатегорияКлиента) Тогда
			СтруктураПоиска.Вставить("КатегорияКлиента",СтрТЧ.КатегорияКлиента);
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрТЧ.Вывеска) Тогда
			СтруктураПоиска.Вставить("Вывеска",СтрТЧ.Вывеска);
		КонецЕсли; 
		Если НЕ ИсключитьФильтрПоПроектуИТоварнойКатегории И ЗначениеЗаполнено(СтрТЧ.Проект) Тогда
			СтруктураПоиска.Вставить("Проект",СтрТЧ.Проект);
		КонецЕсли;
		Если НЕ ИсключитьФильтрПоПроектуИТоварнойКатегории И ЗначениеЗаполнено(СтрТЧ.ТоварнаяКатегория) Тогда
			СтруктураПоиска.Вставить("ТоварнаяКатегория",СтрТЧ.ТоварнаяКатегория);
		КонецЕсли;
		
		НайденныеСтрокиИтоги = Итоги.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтрокиИтоги.Количество()>0 И НайденныеСтрокиИтоги[0][ВидБазы] > 0 Тогда
			тСуммаГросс = тСуммаГросс + НайденныеСтрокиИтоги[0][ВидБазы]; 	
		КонецЕсли; 
		
	КонецЦикла;

	Возврат тСуммаГросс;
	
КонецФункции

Процедура РасчитаемСуммуБонусов(ВидБонуса,ВидБазы,НайденныеСтрокиДляРаспределения,РезультатРасчета,тСуммаБазыГруппы,тПоказательГруппы,ИсключитьФильтрПоПроектуИТоварнойКатегории=Ложь) Экспорт

	//{07.06.2016 Островерхий заявка №б/н запросу Нагорной А. 
	//{09.06.2016 Островерхий заявка №б/н 
	//Если тСуммаБазыГруппы = 0
	//	ИЛИ тПоказательГруппы = 0 Тогда
	//	Возврат;
	//КонецЕсли;  
	//09.06.2016 Островерхий} 
	//07.06.2016 Островерхий} 
	
	//Расчитаем сумму ретробонусов
	Для каждого СтрТЧ Из НайденныеСтрокиДляРаспределения Цикл
		
		СтруктураПоиска2 = Новый Структура("Период",СтрТЧ.Период);
		
		Если ЗначениеЗаполнено(СтрТЧ.Дивизион) Тогда
			СтруктураПоиска2.Вставить("Дивизион",СтрТЧ.Дивизион);
		КонецЕсли; 		
		Если ЗначениеЗаполнено(СтрТЧ.КатегорияКлиента) Тогда
			СтруктураПоиска2.Вставить("КатегорияКлиента",СтрТЧ.КатегорияКлиента);
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрТЧ.Вывеска) Тогда
			СтруктураПоиска2.Вставить("Вывеска",СтрТЧ.Вывеска);
		КонецЕсли; 
		Если НЕ ИсключитьФильтрПоПроектуИТоварнойКатегории И ЗначениеЗаполнено(СтрТЧ.Проект) Тогда
			СтруктураПоиска2.Вставить("Проект",СтрТЧ.Проект);
		КонецЕсли;
		Если НЕ ИсключитьФильтрПоПроектуИТоварнойКатегории И ЗначениеЗаполнено(СтрТЧ.ТоварнаяКатегория) Тогда
			СтруктураПоиска2.Вставить("ТоварнаяКатегория",СтрТЧ.ТоварнаяКатегория);
		КонецЕсли;
		
		НайденныеСтроки = РезультатРасчета.НайтиСтроки(СтруктураПоиска2);
		
		Для каждого ТекСтр Из НайденныеСтроки Цикл
			ТекСтр[ВидБонуса] = ТекСтр[ВидБонуса] + ТекСтр[ВидБазы] / тСуммаБазыГруппы * тПоказательГруппы; 	
		КонецЦикла; 
		
	КонецЦикла;

КонецПроцедуры

// ПользовательПодключенКИБ()
// Функция определяет подключен ли пользователь к информационной базе в режиме предприятия
// входящий параметер Пользователь может принимать тип "Строка" или "СправочникСсылка.Пользователи"
// на выходе булево - Истина = пользователь подключен
Функция ПользовательПодключенКИБ(Знач Пользователь) Экспорт 

	ЗначениеВозврата = Ложь;
	
	Если ТипЗнч(Пользователь) = Тип("Строка") Тогда
		
		ИмяПользователя = Пользователь;
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);		
		
		Если Пользователь.Пустая() Тогда
			ВызватьИсключение "Пользователь '"+ИмяПользователя+"' не найден в системе!";
		КонецЕсли; 
		
	КонецЕсли; 
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();

	Для каждого ТекСоединение Из МассивСоединений Цикл
	
		Если ТекСоединение.ИмяПриложения = "1CV8"
			И ТекСоединение.Пользователь.УникальныйИдентификатор = Пользователь.ИдентификаторПользователяИБ Тогда
		
			ЗначениеВозврата = Истина;
			Прервать;
			
		КонецЕсли; 	
	
	КонецЦикла; 
	
	Возврат ЗначениеВозврата;
	
КонецФункции // ПользовательПодключенКИБ()

 