
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//начало изменений ДС МСФО 12.12.2013
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодНач = Дата(Год(ТекущаяДата()) + 1, 1, 1); //начало следующего года
	ПериодКон = КонецГода(ПериодНач);
	//конец изменений ДС МСФО 12.12.2013
КонецПроцедуры //ОбработкаЗаполнения

Процедура ОбработкаПроведения(Отказ, Режим)
	//начало изменений ДС МСФО 12.12.2013
	// регистр ДС_ОбъемВыпускаДляРасчетаАмортизацииОС
	Движения.ДС_ОбъемВыпускаДляРасчетаАмортизацииОС.Записывать = Истина;
	Движения.ДС_ОбъемВыпускаДляРасчетаАмортизацииОС.Очистить();
	Для Каждого СтрокаТЧ Из ОбъемВыпуска Цикл
		Движение = Движения.ДС_ОбъемВыпускаДляРасчетаАмортизацииОС.Добавить();
		Движение.Период 						= Дата;
		Движение.ПроизводственнаяЛиния 			= ПроизводственнаяЛиния;
		Движение.ПериодАмортизации 				= СтрокаТЧ.ПериодАмортизации;
		Движение.КоличествоВыпущеннойПродукции 	= СтрокаТЧ.КоличествоВыпущеннойПродукции;
	КонецЦикла;
	//конец изменений ДС МСФО 12.12.2013
КонецПроцедуры //ОбработкаПроведения()
