
Процедура ПередЗаписью(Отказ)
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений	
	Если НЕ ЭтоГруппа Тогда
		Если Составной Тогда
			Остатки.Очистить();
			
		Иначе
			ВложенныеПоказатели.Очистить();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры //ПередЗаписью() 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	УмножатьНаСтавкуНалогаНаПрибыль = Истина;
КонецПроцедуры //ОбработкаЗаполнения() 
